[
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Rafflesiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10756",
    "knowledge_content":[
      "Herbs, fleshy, parasitic on roots, stems, or branches of various hosts. Vegetative body thalloid or reduced to myceliumlike tissue within host. Normal leaves absent. Inflorescences terminal, usually 1-flowered, rarely a spike; bracts scale-like, several at base of inflorescence. Flowers usually unisexual (plants dioecious or monoecious), bisexual in Mitrastemon, actinomorphic, minute to extremely large [Rafflesia arnoldii R. Brown of Indonesia (Sumatra) produces a flower to 7.5 kg and to 1 m in diam.], 4-10-merous. Perianth lobes well-developed or absent, basally connate, rarely free. Stamens 5 to very numerous, in 1-3 series, fused with the rudimentary pistil into a gynostemium or in bisexual flowers connate into a cylinder; free filaments absent; anthers 2-loculed, dehiscent longitudinally or by apical pores. Ovary superior, semisuperior, or inferior, absent in male flowers, 1-loculed with many parietal placentas; ovules numerous, anatropous, integuments 1 or 2. Style 1 or none; stigma discoid, capitate, or with many lobes. Fruit a berry. Seeds minute, very numerous; testa hard; endosperm present.\r",
      "Eight genera and 27 species: mostly in tropical and subtropical regions; two genera and two species in China.",
      "Wu Te-lin. 1988. Rafflesiaceae. In: Kiu Hua-shing & Ling Yeou-ruenn, eds., Fl. Reipubl. Popularis Sin. 24: 246–249.",
      "Inflorescence bracts decussate, in 4-series; flowers bisexual, less than 2 cm in diam.; perianth truncate; stamens connate into a tube covering ovary; ovary superior.",
      "Inflorescence bracts imbricate, in a spiral; flowers unisexual, more than 8 cm in diam.; perianth lobes 10; stamens connate into a cupular synandrium; ovary inferior."
    ],
    "authors":"Shumei Huang & Michael G. Gilbert"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Rhoipteleaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10769",
    "knowledge_content":[
      "Trees, deciduous. Young branches densely covered with resinous glands and pubescence. Winter buds naked, shortly stalked. Stipules caducous. Leaves alternate, odd-pinnately compound; leaflets alternate, sessile, margin serrate. Inflorescences polygamous, axillary in distal leaves, paniculiform, fascicled from many spikes; flower clusters alternate, usually a simple dichasium with bisexual flower in middle and sterile female flowers laterally. Flowers actinomorphic. Tepals 4, free. Bisexual flowers: stamens 6; filament slender, erect; anther with little glands, apically slightly foveolate, longitudinally dehiscent; connective very narrow; pistil 1; ovary superior, covered with glands, 2-loculed but only 1 developing, with 1 campylotropous ovule; stigmas free. Female flowers: sterile; pistil small; staminodes absent. Nutlets developed only from bisexual flowers, slightly compressed, with persistent tepals at base and persistent stigma at apex; exocarp papery; wings 2. Seeds without endosperm; embryo erect.\r",
      "Kuang Kozen & Fu Likuo. 1998. Rhoipteleaceae. In: Chun Woonyong & Huang Chengchiu, eds., Fl. Reipubl. Popularis Sin. 22: 414–416."
    ],
    "authors":"Liguo Fu, Yiqun Xin & Bruce Bartholomew"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Santalaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10791",
    "knowledge_content":[
      "Herbs or shrubs, rarely trees, usually root hemiparasites, occasionally aerial hemiparasites (Dendrotrophe and Phacellaria); nodes not articulated, mostly glabrous, less often hairy, hairs simple. Leaves usually alternate (opposite in Buckleya), sometimes scale-like (absent in Phacellaria); stipules absent; petiole often indistinct; leaf blade simple, usually pinnately veined, sometimes palmately 3-9-veined (in Dendrotrophe), margin entire. Inflorescences mostly axillary, occasionally terminal (in Buckleya), cymose, umbellate, paniculate, racemelike, spicate, or clustered, sometimes 1-flowered; bracts scale-like, small, sometimes forming involucre, sometimes ± adnate to pedicel (in Thesium); bracteoles sometimes present, paired. Flowers bisexual or unisexual (plants usually dioecious, rarely monoecious), actinomorphic, 3-6(-8)-merous, very small; perianth lobes 3-6(-8), slightly fleshy. Male flowers: perianth lobes valvate or slightly imbricate in bud, incurved or patent when flowering, sparsely hairy or with tongue-shaped appendage at the insertion of the stamens. Disk epigynous or perigynous, sometimes absent, margin sinuate or lobed, sometimes distinct, glandular or scaly. Stamens as many as and opposite to perianth lobes, usually on the base of lobes; filaments filiform, short; anthers gynobasic or dorsifixed near base, 2-celled, parallel or divaricate, dehiscence usually longitudinal. Female and bisexual flowers: perianth tube usually longer than that of male. Ovary inferior or half-inferior, 1- or 5-12-loculed; ovules 1-3(-5), anatropous or hemitropous, integument absent. Style 1; stigma capitate, small, truncate or lobed. Fruit a drupe or a nut, exocarp usually fleshy, endocarp crustaceous or bony. Seed 1, without a differentiated testa; endosperm copious, usually white and partitioned, fleshy; embryo cylindric, straight, small, smooth, rugose, or many ridged. 2n = 5, 6, 7, 12, 13+.\r",
      "About 36 genera and 500 species: widely distributed in tropical and temperate regions; seven genera and 33 species (13 endemic) in China.",
      "Three species of sandalwood, Santalum album Linnaeus, S. myrtifolium Linnaeus, and S. papuanum Summerhayes, have been recorded as cultivated in China. Wu Zhengyi (editor’s note) adds that he collected a fruiting specimen of a Santalum in the coastal forests of Taiwan (at KUN).",
      "Tam Pui-cheung. 1988. Santalaceae. In: Kiu Hua-shing & Ling Yeou-ruenn, eds., Fl. Reipubl. Popularis Sin. 24: 52–86.",
      "Leaves and vegetative stems almost absent; aerial epiparasite growing on Loranthaceae or Dendrotrophe; flowers minute, sessile, often very densely clustered.",
      "Leaves and vegetative stems usually well developed; trees, shrubs, or vines, or terrestrial herbs with scale-like leaves; flowers often large, pedicellate, solitary, paired, or clustered.",
      "Terrestrial herbs; leaves linear or scale-like; each flower subtended by 1, 2, or rarely 4, prominent, persistent bracteoles; fruit a nutlet, exocarp dry [sometimes fleshy].",
      "Trees, shrubs, or vines; leaves well developed, lanceolate to ovate; flowers usually without conspicuous, persistent bracteoles; fruit a drupe, exocarp fleshy.",
      "Leaves opposite, first-formed leaves on shoots with prominent scarious, scale-like tips; fruit with 4(or 5) conspicuous, persistent, accrescent bracts near apex.",
      "Inflorescences racemelike, thyrsoid, catkinlike, or 1-flowered; flowers 5(or 6)-merous; stems terete; fruit 3-5 cm.",
      "Inflorescences terminal, on leafy axillary shoots, female inflorescences with flowers subtended by well-developed leaves and effectively solitary and axillary; anther cells longitudinally dehiscent; fruit with apical disk more than 5 mm wide.",
      "Inflorescences axillary, lacking normal leaves, male inflorescences sometimes in cluster; anther cells transversely dehiscent; fruit with apical disk to 2.5 mm wide.",
      "Buckleya  TorreyDendrotrophe  MiquelOsyris  LinnaeusPhacellaria  BenthamPyrularia  MichauxScleropyrum  ArnottThesium  Linnaeus"
    ],
    "authors":"Nianhe Xia & Michael G. Gilbert"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Ulmaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10928",
    "knowledge_content":[
      "Trees or shrubs, evergreen or deciduous. Winter buds with scales, rarely naked; axillary buds developed; terminal bud usually dying back early. Stipules usually membranous, caducous. Leaves simple, alternate or rarely opposite, usually distichous, petiolate; leaf blade pinnately veined, basally 3(or 5)-veined, margin entire or serrate. Inflorescences axillary. Flowers monochlamydeous, bisexual, or rarely unisexual or polygamous. Perianth lobes 4-9, imbricate or rarely valvate, persistent or caducous. Stamens usually equal in number to and opposite perianth lobes, opposite, basally adnate to tepals; filaments distinct; anthers 2-celled, longitudinally fissured. Pistil 2-carpellate; ovary superior, 1(or 2)-loculed; ovule 1, suspended, anatropous; integuments 2. Style very short; stigmas 2, linear. Fruit samara, drupes, or winged nutlets, apically usually with persistent stigmas. Endosperm scanty or absent; embryo erect, curved, or involute; cotyledons flat, curved, or flexed. Seedling epigeous.\r",
      "About 16 genera and ca. 230 species: widespread in temperate and tropical areas; eight genera (one endemic) and 46 species (23 endemic) in China.",
      "Recent research strongly suggests that the subfamily Celtidoideae (Aphananthe, Celtis, Gironniera, Pteroceltis, and Trema) is not the closest relative of the subfamily Ulmoideae (Hemiptelea, Ulmus, and Zelkova). It would probably be more accurate to exclude Celtidoideae from Ulmaceae, and move it to Cannabaceae, rather than treating it as a separate family, Celtidaceae. More data are needed before a stable, new classification of the Urticales can be produced. Until these data are available, it is more practical to retain the traditional circumscription of Ulmaceae.Most species of this family yield fine timber, the cortex is a good substitute for hemp, the fruit are edible, and the seed oil is used medicinally and industrially. Many species of Ulmaceae are cultivated, and it is not always certain whether specimens are from wild or cultivated plants.",
      "Fu Likuo, Chen Chiajui & Tang Yancheng. 1998. Ulmaceae. In: Chun Woonyong & Huang Chengchiu, eds., Fl. Reipubl. Popularis Sin. 22: 334–413.",
      "Flowers unisexual; anthers apically pubescent; leaves 3-veined from base; secondary veins curving inward, not reaching margin.",
      "Flowers bisexual or polygamous; anthers apically glabrous; leaves pinnately veined; secondary veins straight, each ending in a marginal tooth.",
      "Flowers unisexual (polygamous in Trema cannabina), shortly pedicellate; fruit 1.5-4 mm in diam., with persistent tepals and stigmas, stalk short; leaf blade margin denticulate.",
      "Flowers polygamous, long pedicellate; fruit 5-15 mm in diam., without persistent tepals and stigmas, stalk long; leaf blade margin entire or serrate.",
      "Flowers polygamous; leaf blade serrate to crenate; secondary veins extending to margin, each ending in a tooth.",
      "Flowers unisexual; leaf blade entire, shallowly serrate, or denticulate; secondary veins anastomosing before reaching margin.",
      "Stipules usually basally connate, enclosing bud, leaving a single transverse scar that completely encircles stem at each node.",
      "Stipules not connate, nor enclosing bud, leaving two small transverse scars one on each side of leaf base.",
      "Leaf blade narrowly ovate, ovate, or oblong-lanceolate, margin usually entire or occasionally inconspicuously serrate; drupe 13-20 mm (Aphananthe cuspidata).",
      "Leaf blade elliptic-lanceolate to narrowly lanceolate, margin denticulate; drupe 1.5-2.5 mm (Trema levigata).",
      "Aphananthe  PlanchonCeltis  LinnaeusGironniera  Gaudichaud-BeaupréHemiptelea  PlanchonPteroceltis  MaximowiczTrema  LoureiroUlmus  LinnaeusZelkova  Spach"
    ],
    "authors":"Liguo Fu, Yiqun Xin & Alan Whittemore"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Urticaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10931",
    "knowledge_content":[
      "Herbs, subshrubs, or shrubs, rarely trees, very rarely climbing, stems often fibrous, sometimes succulent. sometimes armed with stinging hairs; epidermal cells of leaves, sometimes stems, perianths mostly with prominent cystoliths punctiform to linear; Leaves alternate or opposite, stipules present, rarely absent; leaf blade simple. Inflorescences cymose, paniculate, racemose, spicate, or cluster-capitate, usually formed from glomerules, sometimes crowded on common enlarged cuplike or discoid receptacle, rarely reduced into a single flower. Flowers unisexual (plants monoecious or dioecious), rarely bisexual in partial flowers; actinomorphic, very small, (1-)4- or 5-merous, rarely perianth absent in female flowers. Calyx absent. Perianth lobes imbricate or valvate. Male flowers: stamens as many as and opposite to perianth lobes, filaments inflexed in bud; anthers 2-locular, opening lengthwise, rudimentary ovary often present. Female flowers: perianth lobes free or connate, usually enlarged in fruit and persistent, occasionally absent; staminodes scarious, opposite to the perianth lobes, or absent. Ovary rudimentary in male flowers, sessile or shortly stipitate, free or adnate to the perianth; 1-locular, ovule solitary, erect from the base; style simple, or absent; stigma diverse, capitate, penicillate-capitate (brushlike), subulate, filiform, ligulate, or peltate. Fruit usually a dry achene, sometimes a fleshy drupe, often enclosed by the persistent perianth. Seed solitary, endosperm usually present; embryo straight; cotyledons ovate elliptical or orbicular.\r",
      "About 47 genera and 1300 species: most numerous in wet tropical regions, extending into temperate regions; 25 genera and 341 species (163 endemic, one introduced) in China.",
      "Plants in this family have numerous uses. The stem fiber of some genera and species is of high quality and used to make cloth, fishing nets, and ropes and for some industrial materials. In central and southern China, Boehmeria nivea is widely cultivated for ramie fiber and Girardinia diversifolia subsp. triloba is widely cultivated for “red huo ma” fiber. Boiled young shoots of Girardinia, Laportea, and Urtica are eaten as vegetables. Some species are used in local Chinese medicine. Pellionia repens, Pilea cadierei, P. microphylla, and P. peperomioides, among other species, are widely cultivated as ornamentals in China and elsewhere. Some genera, such as Elatostema, Pellionia, and Pilea, occur frequently in shady, moist habitats of subtropical forests and become dominant elements of the forest floor vegetation. Plants of the first five genera belong to tribe Urticeae, which is usually characterized by the distinctive stinging hairs.",
      "Chen Chiajui & Wang Wentsai. 1995. Urticaceae. In: Wang Wentsai & Chen Chiajui, eds., Fl. Reipubl. Popularis Sin. 23(2): 1–404.",
      "Leaves opposite; perianth lobes of female flowers free, lateral pair outer and much smaller than dorsiventral pair.",
      "Stipules interpetiolar; achene straight, sessile; stigma penicillate-capitate; slender herb to 40 cm.",
      "Stipules intrapetiolar; achene strongly oblique, stipitate; stigma filiform, ligulate, or subulate; trees, shrubs or usually robust herbs.",
      "Female perianth with 3 lobes fused and the 4th absent or reduced to a bristle; robust herb with longest stinging hairs more than 5 mm.",
      "Female perianth lobes 4, dorsal lobe largest, ventral lobe smallest, joined at base only, never bristle-like; ± woody shrub or tree or herbs with longest stinging hairs less than 5 mm.",
      "Stipules completely joined, apex entire; trees or shrubs; pedicels of female flowers absent or terete, not winged in fruit.",
      "Stipules 2-fid at apex; herbs or subshrubs; pedicels of female flowers always present, winged in fruit.",
      "Cystoliths usually linear or fusiform; stigma sessile, penicillate-capitate; perianth lobes of female flowers free or connate at base, staminodes present (except in Procris).",
      "Cystoliths dotlike or very short blunt rods (botuliform); stigma often on a style, mostly linear, less often penicillate-capitate; perianth lobes of female flowers usually connate into a tube, rarely strongly reduced, or absent, staminodes absent.",
      "Leaves opposite, rarely spirally alternate and then leaf blade peltate; leaf blade usually symmetric.",
      "Leaves alternate or very strongly heterophyllous with 1 leaf of the pair reduced to a nanophyll very much smaller than the other, leaves usually distichous; leaf blade usually asymmetric.",
      "Flowers usually forming loose cymes or cymose panicles, sometimes spikes or in clusters; achene without crested appendix at apex.",
      "Flowers inserted on discoid or concave, fleshy receptacle; achene with crested or U-shaped appendix at apex.",
      "Perianth lobes of female flowers usually 4 or 5, much shorter than ovary, or strongly reduced, not corniculate at apex; achene 6-10-ribbed; male inflorescences usually with receptacle, rarely cymose; female inflorescences with discoid receptacle and bracteoles along margin.",
      "Perianth lobes of female flowers 3-5, longer than ovary, usually corniculate below apex; achene tuberculate or striate, rarely smooth, never ribbed; male inflorescences cymose; female inflorescences cymose or captitate on globose receptacle.",
      "Female inflorescences cymose, rarely with discoid receptacle and involucre; perianth lobes of female flowers (4 or)5; staminodes present.",
      "Female inflorescences capitate on globose receptacle, but without involucre; perianth lobes of female flowers 3 or 4; staminodes absent.",
      "Stipules absent; flowers sometimes bisexual, each subtended by 1 or more leaflike bracts longer than the flower, contrasting with the chaffy brown perianth and glossy black achene.",
      "Inflorescence enclosed within involucre, usually bisexual with several male flowers surrounding 1 or 2 female flowers; male flower with 1 stamen; female flower without perianth.",
      "Inflorescence without involucre, often unisexual; male flower with 3-5 stamens; female flower with tubular perianth around ovary.",
      "Male buds truncate, perianth with annular, often villous, crown formed from transverse crests of lobes; leaf blade 3-veined from base.",
      "Male flowers without this combination of characters; leaf blade with at least 2 major lateral veins arising clearly above base.",
      "Stigma ovoid-capitate, on short style; stipules persistent, reflexed at flowering; slender stoloniferous herb.",
      "Stigma minute, less than 0.5 mm, hooked, persistent; fruit symmetrically enlarged at apex; inflorescences paired at nodes, sessile, ± globose, very dense with base partly enveloping stem.",
      "Stigma relatively long, variously curved [but if hooked then more than 1 mm], sometimes deciduous; fruit ± symmetric at apex, often winged; inflorescence various, often pedunculate, if sessile then base not enveloping stem.",
      "Female perianth fleshy at maturity, apex with tiny, entire opening, lobes completely fused; style deciduous.",
      "Inflorescence elongated with short lateral branches, all axes completely hidden by very closely spaced flowers; stigma ringlike.",
      "Inflorescence globose or nearly so or, if more elongated and branched then axes exposed between discrete glomerules of flowers; stigma peltate or penicillate.",
      "Stigma peltate with long ciliate hairs along margin; achene adnate to thinly fleshy perianth, surrounded at base or almost wholly enclosed by discoid or cuplike fleshy receptacle.",
      "Perianth of female flowers inconspicuous, connate into a shallow pocket or absent; leaves usually discolorous, abaxially white tomentose.",
      "Female perianth small, cupular, 4 or 5-lobed or -toothed, adnate to base of ovary; inflorescences paired, unbranched pedunculate heads.",
      "Female perianth enclosing ovary, tube obovoid or jug-shaped, mouth contracted, very minutely 3- or 4-toothed, in fruit often enlarged, fleshy, and adnate to ovary, rarely membranous and free; inflorescences often branched."
    ],
    "authors":"Jiarui Chen, Prof. Qi Lin, Ib Friis, C. Melanie Wilmot-Dear & Alex K. Monro"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Viscaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20330",
    "knowledge_content":[
      "Shrubs or herbs, sometimes aerial hemiparasites on other seed plants, never with external runners, sometimes spreading within host (in Arceuthobium); nodes articulated, often enlarged, glabrous, except sometimes inflorescences. Leaves opposite, often reduced to scales; stipules absent; petiole often indistinct; leaf blade, when present, simple, mostly palmately 3-5-veined, margin entire. Inflorescences terminal or axillary, in spikes or cymes, sometimes a solitary flower; bracts inconspicuous. Flowers unisexual (plants dioecious or monoecious), (2-)3-4-merous, actinomorphic, minute (1-4 mm). Perianth lobes free, valvate. Disk absent. Stamens opposite to perianth lobes, adnate or free; anthers 1-many-loculed, sometimes connate into synandria, dehiscence longitudinal or by several pores. Pollen spheric. Ovary absent in male flowers, inferior in female flowers, 1-loculed, without true ovules, embryo sacs originating from a short placental column, integument absent. Style simple or absent; stigma small. Fruit a berry, with a viscin layer (sticky mucilaginous tissue) inside vascular bundles. Seed 1; testa absent; endosperm starchy; embryo rather large.\r",
      "About seven genera and 350 species: mainly tropical and subtropical regions; three genera and 18 species (seven endemic) in China.",
      "Kiu Hua-shing. 1988. Viscoideae. In: Kiu Hua-shing & Ling Yeou-ruenn, eds., Fl. Reipubl. Popularis Sin. 24: 139–158.",
      "Stems 15-80 cm; leaves well developed or reduced to scales; anthers dehiscent by numerous pores; fruit 4 mm or more, indehiscent.",
      "Stems 2-15(-20) cm; leaves reduced to scales; anthers dehiscent by single slit or fused into synandrium with single apical pore; fruit mostly less than 4 mm (to 6 mm in Arceuthobium chinense), explosively dehiscent.",
      "Stem internodes flattened; scale leaves in 2 ranks; flowers subtended by hairs; anthers fused into synandrium; plants parasitic on angiosperms.",
      "Stem internodes terete; scale leaves decussate, in 4 ranks; flowers not subtended by hairs; anthers separate; plants parasitic on gymnosperms."
    ],
    "authors":"Huaxing Qiu & Michael G. Gilbert"
  },
  {
    "group_title":"Caryophyllaceae through Lardizabalaceae",
    "family":"Cabombaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10140",
    "knowledge_content":[
      "Herbs perennial, aquatic. Stems slender, branched, rhizomatous, repent; internodes at first elongate and apically floating, later erect, foliate, and shortened. Leaves dimorphic. Submersed leaves (Cabomba only), opposite or sometimes whorled, palmately dissected. Floating leaves alternate, peltate, entire. Flowers solitary, axillary from distal nodes, short to long pedunculate, bisexual, hypogynous, actinomorphic, borne at or above water surface; perianth persistent. Sepals 3, separate or nearly so. Petals 3, distinct, alternating with sepals. Stamens 3--36(--51), anthers dehiscent by longitudinal slits. Pistils 3--18, simple, obclavate or ventricose. Ovary 1-loculed; ovules 1--3, pendulous. Styles short. Stigmas capitate or linear-decurrent. Fruit achenelike or folliclelike, coriaceous, indehiscent. Seed endosperm little, perisperm abundant; embryo minute; cotyledons 2, fleshy.\r",
      "Leaves opposite, dissected and submersed, but when flowering also alternate, tiny, peltate, and floating; stamens 3--6; submersed parts without evident mucilage coating",
      "Leaves alternate, entire, peltate, floating; stamens 12--36(--51); submersed parts heavily coated with mucilage"
    ],
    "authors":"Dezhi Fu & John H. Wiersema"
  },
  {
    "group_title":"Caryophyllaceae through Lardizabalaceae",
    "family":"Caryophyllaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10166",
    "knowledge_content":[
      "Authors: Dequan Lu, Zhengyi Wu, Lihua Zhou, Shilong Chen, Michael G. Gilbert, Magnus Lidén, John McNeill, John K. Morton, Bengt Oxelman, Richard K. Rabeler, Mats Thulin, Nicholas J. Turland & Warren L. Wagner",
      "Herbs annual or perennial, rarely subshrubs or shrubs. Stems and branches usually swollen at nodes. Leaves opposite, decussate, rarely alternate or verticillate, simple, entire, usually connate at base; stipules scarious, bristly, or often absent. Inflorescence of cymes or cymose panicles, rarely flowers solitary or few in racemes, capitula, pseudoverticillasters, or umbels. Flowers actinomorphic, bisexual, rarely unisexual, occasionally cleistogamous. Sepals (4 or)5, free, imbricate, or connate into a tube, leaflike or scarious, persistent, sometimes bracteate below calyx. Petals (4 or)5, rarely absent, free, often comprising claw and limb; limb entire or split, usually with coronal scales at juncture of claw and limb. Stamens (2--)5--10, in 1 or 2 series. Pistil 1; carpels 2--5, united into a compound ovary. Ovary superior, 1-loculed or basally imperfectly 2--5-loculed. Gynophore present or absent. Placentation free, central, rarely basal; ovules (1 or) few or numerous, campylotropous. Styles (1 or)2--5, sometimes united at base. Fruit usually a capsule, with pericarp crustaceous, scarious, or papery, dehiscing by teeth or valves 1 or 2 × as many as styles, rarely berrylike with irregular dehiscence or an achene. Seeds 1 to numerous, reniform, ovoid, or rarely dorsiventrally compressed, abaxially grooved, blunt, or sharply pointed, rarely fimbriate-pectinate; testa granular, striate or tuberculate, rarely smooth or spongy; embryo strongly curved and surrounding perisperm or straight but eccentric; perisperm mealy.\r",
      "Between 75 and 80 genera and ca. 2000 species: widespread but mainly of temperate or warm-temperate occurrence in the N hemisphere, with principal centers of distribution in the Mediterranean region and W Asia to W China and the Himalayas, fewer species in Africa S of the Sahara, America, and Oceania; 30 genera (two endemic) and 390 species (193 endemic) in China.",
      " Arenaria,  Silene, and Stellaria  contain over half the species in the family in China. They are mostly concentrated in the Qinghai-Xizang plateau, and are especially rich from the Hengduan Mountains to the Himalayas.",
      "The main uses of this family are medicinal and ornamental.  Dianthus superbus,  Pseudostellaria heterophylla,  Stellaria dichotoma var.  lanceolata, and  Vaccaria hispanica  are commonly used in traditional Chinese medicine. Some species of  Arenaria,  Dianthus,  Gypsophila,  Psammosilene, and Silene  are used as medicinal herbs among the people or are habitually used in local Chinese medicine. Many species of  Dianthus,  Gypsophila,  Lychnis,  Saponaria, and  Silene are grown as ornamentals.  Atocion armeria  (Linnaeus) Rafinesque ( Silene armeria  Linnaeus), native to Russia and Europe, is also cultivated in China. It differs from  Silene in having a corymbose inflorescence and obscure calyx veins.",
      "Wu Cheng-yih, Ke Ping, Zhou Li-hua, Tang Chang-lin & Lu De-quan. 1996. Caryophyllaceae.  In: Tang Chang-lin, ed., Fl. Reipubl. Popularis Sin. 26: 47–449.",
      "Sepal apex not aristate; pistil 2-carpeled; style apex 2-fid; leaves oblong, elliptic, or subcordate; herbs perennial",
      "Sepals centrally ridged abaxially, hyaline at margin; style apex 3-lobed; leaves obovate or spatulate",
      "Sepals free, rarely connate at base; petals nearly clawless, rarely absent; stamens often perigynous (subfam. Alsinoideae).",
      "Sepals connate into a distinct calyx tube; petals usually clawed; stamens hypogynous (subfam. Caryophylloideae).",
      "Flowers of 2 types: chasmogamous at stem apex, with petals, usually sterile; cleistogamous at stem base, without petals, fertile; plants with fleshy root tubers",
      "Petals 2-fid for up to 1\/3 their length, retuse, or rarely entire; capsule cylindric, usually greatly exceeding calyx, apex 8--10-toothed",
      "Petals deeply 2-fid; capsule ovoid to shortly cylindric, shorter than or slightly exceeding calyx, apex 10-toothed, or 5-valved to middle with valves 2-fid at apex.",
      "Capsule ovoid, slightly exceeding calyx, 5-valved to middle, valves 2-fid at apex; styles alternisepalous",
      "Inflorescence cymose, paniculate, or flowers solitary; capsule ovoid or oblong; seeds reniform or globose.",
      "Seeds few or numerous, rarely 1; sepals herbaceous; petals shorter or longer than sepals; herbs erect, diffuse, or cushionlike"
    ],
    "authors":"Dequan Lu, Zhengyi Wu, Lihua Zhou, Shilong Chen, Michael G. Gilbert, Magnus Lidén, John McNeill, John K. Morton, Bengt Oxelman, Richard K. Rabeler, Mats Thulin, Nicholas J. Turland & Warren L. Wagner"
  },
  {
    "group_title":"Caryophyllaceae through Lardizabalaceae",
    "family":"Ceratophyllaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10178",
    "knowledge_content":[
      "Herbs perennial, submersed, hydrophilous, monoecious. Roots absent. Stems glabrous, branched, free or attached by slender shoots. Stipules absent. Leaves cauline, 3--11 in a whorl; petiole inconspicuous; leaf blade divided dichotomously into filiform segments; segments with 2 rows of denticles. Inflorescences reduced, solitary or with vestigial branches, 1-several at a node, extra-axillary, alternating with leaves, sessile or peduncles lengthening in fruit; involucre of 8--15 foliaceous bracts; bracts 1.5--2 mm, apex terminated by 2 denticles and a medial multicellular appendage. Flowers naked, subsessile. Staminate flower: stamens 3--50, spiral; filaments short; anthers 2-celled, dehiscing by longitudinal slits. Pistillate flower: pistil 1, simple; ovary 1-loculed, placentation laminar; ovule 1, pendulous; style persistent, short or elongate; stigma decurrent. Achene leathery, indehiscent, ellipsoid, smooth or tuberculate, basal spines 0--2, facial spines 0--2, marginal wing present or absent, marginal spines 1--8. Seed 1, unitegmic, endosperm and perisperm absent; cotyledons fleshy.\r"
    ],
    "authors":"Dezhi Fu & Donald H. Les"
  },
  {
    "group_title":"Caryophyllaceae through Lardizabalaceae",
    "family":"Cercidiphyllaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10180",
    "knowledge_content":[
      "Trees deciduous, dioecious. Ramification system with long vegetative shoots and short vegetative or reproductive shoots. Stipules early deciduous. Leaves opposite or rarely alternate on long shoots, single on short shoots, petiolate; leaf blades papery, simple, palmately veined. Inflorescences appearing before leaves, fasciculate. Flowers produced on short shoots, each flower subtended by a bract or bract suppressed; perianth lacking. Staminate inflorescences subsessile; flowers ca. 4 or more, difficult to separate from each other, sessile; stamens (1--)7--13 per flower. Pistillate inflorescences short pedunculate; flowers 2--6(--8), sessile; carpel 1; ovules 15--30, in 2 rows. Fruit a follicle. Seeds flattened, winged; endosperm oily; embryo large.\r"
    ],
    "authors":"Dezhi Fu & Peter K. Endress"
  },
  {
    "group_title":"Caryophyllaceae through Lardizabalaceae",
    "family":"Circaeasteraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10193",
    "knowledge_content":[
      "Herbs annual. Cotyledons persistent. Leaves rosulate, borne on elongated hypocotyl; veins dichotomous. Flowers fascicled in axil of upper leaves, bisexual but number of organs variable. Sepals 2 or 3, persistent. Petals absent. Stamens 1 or 2(or 3), alternating with sepals; anthers 2-loculed, introrse. Carpels 1--3, separate; ovary superior; style absent; stigma terminal, papillate; ovule 1 per ovary, subapical, pendulous. Fruit indehiscent. Seeds with copious endosperm; embryo terete, straight, with short cotyledons.\r"
    ],
    "authors":"Dezhi Fu & Bryan E. Dutton"
  },
  {
    "group_title":"Caryophyllaceae through Lardizabalaceae",
    "family":"Eupteleaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10329",
    "knowledge_content":[
      "Trees or shrubs, deciduous. Branches sympodial. Stipules absent. Leaves spirally arranged, simple, petiolate; leaf blade pinnately veined. Inflorescences appearing before leaves, composed of 6--12 clustered flowers borne in axils of bracts at base of a leafy shoot. Flowers bisexual. Perianth absent. Stamens 6--19, ± in one series. Carpels 8--31, free, ± in one series, stipitate, with 1--3 ovules attached below ventral suture. Fruit stalked, composed of several stipitate samaras. Endosperm copious, oily; embryo small.\r"
    ],
    "authors":"Dezhi Fu & Peter K. Endress"
  },
  {
    "group_title":"Caryophyllaceae through Lardizabalaceae",
    "family":"Lardizabalaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10477",
    "knowledge_content":[
      "Woody climbers, rarely erect shrubs (Decaisnea). Monoecious, rarely dioecious. Stems climbing or twining (erect in Decaisnea); wood with broad medullary rays. Winter buds large; outer scales 2 to numerous; scales subtending leaves persistent, scaly. Stipules usually absent (present and very small in Sinofranchetia). Leaves alternate, palmate or 3-foliolate, rarely pinnate (Decaisnea). Petiole and petiolules swollen at both ends, articulate. Flowers functionally unisexual by reduction or abortion, actinomorphic. Sepals 6 (usually 3 in Akebia), petaloid, in 2 whorls, imbricate or outer 3 valvate. Petals 6, nectariferous, much smaller than sepals or absent. Male flowers: stamens free or ± connate into a tube; anthers 2-celled, extrorsely dehiscent by longitudinal slit; connective apical appendage hornlike or apiculate, sometimes unappendaged. Pistillodes 3--6(--9), small, filiform. Female flowers: staminodes 6. Carpels 3(--9) or numerous (Sargentodoxa), superior, free; ovules numerous, orthotropous or anatropous, in 2 to several longitudinal rows on laminar placenta, rarely 1, pendulous, hemitropous to subanatropous (Sargentodoxa). Stigma conspicuous, sessile or subsessile. Fruit fleshy follicles or baccate, indehiscent or dehiscent along abaxial suture. Seeds numerous, rarely solitary; seed coat crustaceous; endosperm copious; embryo small, straight.\r",
      "Nine genera and ca. 50 species: mainly in E Asia, two monotypic genera in S America; seven genera (two endemic) and 37 species (25 endemic) in China.",
      "Stems erect; leaves odd pinnate with 13--25 leaflets; inflorescences terminal; winter bud outer scales 2",
      "Stems climbing or twining; leaves palmate or (1 or)3--9-foliolate; inflorescences axillary; winter bud outer scales numerous.",
      "Stem without red sap when cut; lateral leaflets slightly asymmetric at base, smaller than terminal leaflet; carpels 3 in female flowers, ovules ca. 20 per carpel; mature carpels 1--3 at each node of infructescence",
      "Stems with red sap when cut; lateral leaflets extremely asymmetric on one side, larger than terminal leaflet; carpels numerous in female flowers; ovules 1 per carpel; mature carpels 20--40 spirally arranged on an enlarged receptacle",
      "Leaflet apex rounded to obtuse and emarginate; filaments very short; anthers incurved; fruit dehiscent.",
      "Leaflet apex usually acuminate or caudate; filaments conspicuous; anthers straight; fruit indehiscent.",
      "Akebia  DecaisneArchakebia  C. Y. WuDecaisnea  J. D. Hooker & ThomsonHolboellia  WallichSargentodoxa  Rehder & E. H. WilsonSinofranchetia  (Diels) HemsleyStauntonia  de Candolle"
    ],
    "authors":"Dezhao Chen & Tatemi Shimizu"
  },
  {
    "group_title":"Caryophyllaceae through Lardizabalaceae",
    "family":"Nelumbonaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10608",
    "knowledge_content":[
      "Herbs perennial, aquatic. Rhizomes branched, repent, forming swollen terminal storage tubers late in growing season. Leaves arising from rhizome, alternate, emersed or floating, long petiolate; leaf blade centrally peltate, veins radially extended. Flowers solitary, axillary, long pedunculate, bisexual, hypogynous, actinomorphic, entomophilous, borne above water surface. Tepals numerous, distinct, outermost reduced, inner ones larger and petaloid. Stamens numerous; anthers dehiscent by longitudinal slits. Pistils numerous, simple, separately and loosely embedded in cavities on flattened top of receptacle. Ovary 1-loculed; ovule 1, pendulous; styles very short; stigmas capitate. Fruit nutlike, indehiscent. Seeds without endosperm and perisperm; embryo large; cotyledons 2, fleshy.\r",
      "One genus and two species: E and S Asia, N Australia, Central and North America; one species in China."
    ],
    "authors":"Dezhi Fu & John H. Wiersema"
  },
  {
    "group_title":"Caryophyllaceae through Lardizabalaceae",
    "family":"Nymphaeaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10618",
    "knowledge_content":[
      "Herbs perennial or rarely annual, aquatic. Stems rhizomatous; rhizomes erect or repent, branched or unbranched. Leaves arising from rhizome, simple, alternate, floating, emersed, or submersed, long petiolate but short petiolate on submersed vernal ones; leaf blade undivided, usually with a basal sinus, often peltate. Flowers solitary, axillary, long pedunculate, bisexual, hypogynous to epigynous, actinomorphic, entomophilous, mostly emergent. Sepals 4--7, usually green, occasionally petaloid. Petals numerous (rarely absent), distinct, usually showy, often transitional to stamens. Stamens numerous; anthers introrse, dehiscent by longitudinal slits; connective sometimes appendaged. Pistil 1, compound; carpels 5--many, partially or completely united, surrounding a sometimes projecting floral axis. Ovary multilocular; placentation laminar; ovules numerous. Styles absent or modified into abaxially projecting carpellary appendages. Stigmas radiate on distal surface, often disclike. Fruit berrylike, many seeded, irregularly dehiscent. Seeds mostly arillate; endosperm little, perisperm abundant; embryo small; cotyledons 2, fleshy.\r",
      "Six genera and ca. 70 species: widespread in temperate and tropical regions; three genera and eight species in China.",
      "Leaf venation primarily pinnate; sepals yellow or orange, petaloid; ovary superior; seeds not arillate",
      "Leaf venation primarily palmate or radiate; sepals greenish, not petaloid; ovary semi-inferior or inferior; seeds arillate.",
      "Leaves and fruit spinulose; leaf blade centrally peltate, base only slightly indented; ovary inferior"
    ],
    "authors":"Dezhi Fu, John H. Wiersema & Donald Padgett"
  },
  {
    "group_title":"Caryophyllaceae through Lardizabalaceae",
    "family":"Paeoniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10646",
    "knowledge_content":[
      "Shrubs or perennial herbs, to 3.5 m tall. Roots fleshy, thick but attenuate toward tip, or tuberous. Stems (in herbs) or current year’s branchlets (in shrubs) terete, with several persistent scales at base. Leaves alternate, compound; proximal 1--3 best developed, 1--3-ternate or 1- or 2-pinnate; leaflets entire or divided. Flowers solitary and terminal, or 2 or more per shoot and both terminal and axillary, more than 4 cm in diam. Bracts 1--6, leaflike, varying in shape and size, grading into sepals. Sepals 2--9, varying in shape and size. Petals 4--13, varying in color. Stamens up to 230; filaments and anthers varying in color. Disc leathery or fleshy, annular (in herbs) or extended into a sheath and 1\/3 to wholly enveloping carpels (in shrubs). Carpels 1--5(--8), free, glabrous or hairy; ovules numerous, borne in two rows along ventral suture. Styles present or absent; stigmas laterally flattened, recurved, crested. Fruit a follicle. Seeds black or dark brown, globose or ovoid-globose, to 1.3 cm in diam.\r",
      "One genus and ca. 30 species: NW Africa, temperate Asia and Europe, W North America; 15 species (ten endemic) in China."
    ],
    "authors":"Deyuan Hong, Kai-yu Pan & Nicholas J. Turland"
  },
  {
    "group_title":"Caryophyllaceae through Lardizabalaceae",
    "family":"Ranunculaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10757",
    "knowledge_content":[
      "Authors: Wencai Wang, Dezhi Fu, Liang-Qian Li, Bruce Bartholomew, Anthony R. Brach, Bryan E. Dutton, Michael G. Gilbert, Yuichi Kadota, Orbélia R. Robinson, Michio Tamura, Michael J. Warnock, Guanghua Zhu & Svetlana N. Ziman",
      "Herbs perennial or annual, sometimes subshrubs or herbaceous or woody vines. Leaves basal and cauline, alternate, rarely opposite or whorled, simple or variously compound, palmately nerved, rarely penninerved, with or without stipules. Inflorescence a simple or compound monochasium, dichasium, simple or compound raceme, or flowers solitary. Flowers bisexual, sometimes unisexual, actinomorphic, rarely zygomorphic, hypogynous. Sepals 3--6 or more, free, petaloid or sepaloid, imbricate or sometimes valvate in bud. Petals present or absent, 2--8 or more, free, usually with nectaries. Stamens numerous, rarely few, free; filaments linear or filiform; anthers latrorse, introrse, or extrorse; sometimes some sterile stamens becoming staminodes. Carpels numerous or few, rarely 1, free, rarely connate to various degrees; ovary with 1 to many ovules. Fruit follicles or achenes, rarely capsules or berries. Seeds small, with abundant endosperm and minute embryo.\r",
      "About 60 genera and 2500 species: worldwide, but richly represented in N temperate regions, particularly in E Asia; 38 genera (four endemic) and 921 species (604 endemic) in China.",
      " Nigella damascena  Linnaeus and  N. glandulifera  Freyn & Sintenis are cultivated (not native) in China.",
      "Wang Wen-tsai, Wang Shu-hsiou & Hsiao Pei-ken. 1979. Ranunculaceae subfam. Helleboroideae and subfam. Thalictroideae.  In: Fl. Reipubl. Popularis Sin. 27: 59–601; Wang Wen-tsai, Chang Mei-chen, Fang Ming-yuan, Ling Ping-ping, Ting Chih-tsun, Wang Shu-hsiou & Liou Liang. 1980. Ranunculaceae subfam. Ranunculoideae.  In: Wang Wen-tsai, ed., Fl. Reipubl. Popularis Sin. 28: 1–345.",
      "Leaves 1 to few times palmately or subpinnately divided, palmately nerved; pollen grains not spinulose.",
      "Sepals valvate in bud; style usually strongly elongate and plumose in fruit; cauline leaves opposite, rarely alternate",
      "Basal leaves several, palmately lobed or undivided, veins reticulately anastomosing; staminodes absent",
      "Aggregate fruit terete, achene with a robust, rostrate, persistent style at apex and 2 tubercles near base",
      "Aggregate fruit not terete, achene with neither robust, rostrate, persistent style at apex nor tubercles near base.",
      "Leaves all basal, simple, 3-sect, or ternate; petals ca. 1\/3 as long as sepals, not petaloid (instead specialized nectariferous organs); style ca. 2 × as long as ovary; follicles cubic-globose",
      "Leaves both basal and cauline, 2 or more times ternate; petals subequaling sepals, petaloid; style ca. 1\/2 as long as ovary; follicles narrowly cylindric",
      "Leaves all basal, persistent remnants of petioles forming a dense clump; flower solitary, terminal; petals clawless",
      "Leaves both basal and cauline, petioles not forming a clump; flowers few, borne in a monochasium; petals very shortly clawed."
    ],
    "authors":"Wencai Wang, Dezhi Fu, Liang-Qian Li, Bruce Bartholomew, Anthony R. Brach, Bryan E. Dutton, Michael G. Gilbert, Yuichi Kadota, Orbélia R. Robinson, Michio Tamura, Michael J. Warnock, Guanghua Zhu & Svetlana N. Ziman"
  },
  {
    "group_title":"Caryophyllaceae through Lardizabalaceae",
    "family":"Tetracentraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10877",
    "knowledge_content":[
      "Trees, evergreen, with vessel-less wood. Terminal bud at first enclosed by stipule, later free. Stipule adnate to petiole. Leaves simple, alternate on long, 1-year-old branchlets or single and subterminal on short, many-year-old branchlets, marked by crowded concentric scars from petiole bases and bud scales from former years; leaf blade palmately veined. Inflorescences catkinlike multiflowered spikes, borne near base of petiole at apex of short branchlets. Flowers bisexual, in whorls of 4 alternating on inflorescence, 4-merous. Sepals 4. Petals absent. Stamens 4, opposite sepals; anthers basifixed. Ovary superior; carpels 4, alternating with stamens, united at base, each 1-loculed; placenta 2 per locule, parallel along the locule ventral suture; ovules (5 or)6, attached near placenta middle, horizontal at anthesis. Seeds with oily endosperm; embryo minute.\r"
    ],
    "authors":"Bruce Bartholomew"
  },
  {
    "group_title":"Caryophyllaceae through Lardizabalaceae",
    "family":"Trochodendraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10918",
    "knowledge_content":[
      "Trees or shrubs, evergreen, with vessel-less wood. Reproductive shoots sympodial. Stipules absent. Leaves spirally arranged, pseudoverticillate, simple, petiolate; leaf blade pinnately veined. Inflorescences terminal racemes or panicles. Flowers bisexual, long-lived. Pedicel usually with 2--5 small bracteoles. Receptacle expanded. Perianth absent. Stamens 40--70, in several series. Carpels (4--) 6--17, in a single series, laterally fused; ovules 15--30 per carpel, in two rows along ventral suture of carpel. Fruit composed of laterally fused follicles, ventricidal and shortly loculicidal. Seeds basally and apically with winglike projections; endosperm oily; embryo minute.\r"
    ],
    "authors":"Dezhi Fu & Peter K. Endress"
  },
  {
    "group_title":"Menispermaceae through Capparaceae",
    "family":"Calycanthaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10148",
    "knowledge_content":[
      "Shrubs or small trees, deciduous or evergreen. Branchlets dichotomous, quadrangular to subterete, with oil cells; buds covered with scales or naked and hidden [or not hidden] by base of petiole. Stipules absent. Leaves opposite, simple, petiolate; leaf blade pinnately veined, margin entire or subentire. Flowers bisexual, axillary or terminal on branchlets, usually solitary, radially symmetric, usually fragrant, generally appearing before leaves for deciduous taxa, undifferentiated into calyx and corolla but sometimes tepals of more than one form. Pedicel short. Tepals 15-27[-30], yellow, yellowish white, or white flushed pink [or brownish red], spirally arranged on outer surface of a cup-shaped or urceolate receptacle, shape variable, outer usually bractlike, inner petaloid. Stamens numerous, spirally inserted on apical surface of receptacle, in 2 series, outer series fertile, inner series aborted; fertile stamens spirally arranged; filaments short and free; anthers 2-locular, incumbent against connective, extrorse, dehiscing lengthwise by slits; connective exserted, apex apiculate; staminodes linear, linear-lanceolate, or oblong, pubescent or puberulous. Carpels few to numerous, distinct, spirally arranged on basal inner surfaces of hollow cuplike receptacle, 1-loculed; ovules 2 per carpel but usually 1 abortive, anatropous; styles filamentous and extended. Pseudocarp polygynaecial, fleshy when young but becoming dry and sometimes woody, composed of achenes contained within an expanded torus, apex with appendages from persistent staminodes. Achenes 1-seeded; endosperm little or absent; embryo large; cotyledons convolute, foliose.\r",
      "Two genera and nine species: E Asia and North America; two genera (one endemic) and seven species (all endemic) in China.",
      "Sometimes the monotypic genus Idiospermum Blake, endemic to Queensland, Australia, is included in Calycanthaceae (see S. L. Zhou et al., Molec. Phylogenetic. Evol. 39: 1-15. 2006).Li Ping-t’ao. 1979. Calycanthaceae. In: Tsiang Ying & Li Ping-t’ao, eds., Fl. Reipubl. Popularis Sin. 30(2): 1-10.",
      "Vegetative buds with imbricate scales; flowers axillary, subsessile or very shortly pedicellate; tepals varying in size and shape from outer to inner but not distinctly dimorphic; fertile stamens 5-8.",
      "Vegetative buds naked, hidden by base of petiole; flowers terminal, long pedicellate; tepals distinctly dimorphic in size and shape; fertile stamens 16-19."
    ],
    "authors":"Bingtao Li & Bruce Bartholomew"
  },
  {
    "group_title":"Menispermaceae through Capparaceae",
    "family":"Capparaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10158",
    "knowledge_content":[
      "Shrubs, trees, or woody vines, evergreen (deciduous in some Crateva), with branched or simple trichomes. Stipules spinelike, small, or absent. Leaves alternate or rarely opposite, simple or compound with 3[-9] leaflets. Inflorescences axillary or superaxillary, racemose, corymbose, subumbellate, or paniculate, 2-10-flowered or 1-flowered in leaf axil. Flowers bisexual or sometimes unisexual, actinomorphic or zygomorphic, often with caducous bracteoles. Sepals 4(-8), in 1 or 2 whorls, equal or not, distinct or basally connate, rarely outer whorl or all sepals connected and forming a cap. Petals (0-)4(-8), alternating with sepals, distinct, with or without a claw. Receptacle flat or tapered, often extended into an androgynophore, with nectar gland. Stamens (4-)6 to ca. 200; filaments on receptacle or androgynophore apex, distinct, inflexed or spiraled in bud; anthers basifixed (dorsifixed in Stixis), 2-celled, introrse, longitudinally dehiscent. Pistil 2(-8)-carpellate; gynophore ± as long as stamens; ovary ovoid and terete (linear and ridged in Borthwickia), 1-loculed, with 2 to several parietal placentae (3-6-loculed with axile placentation in Borthwickia and Stixis); ovules several to many, 2-tegmic; style obsolete or highly reduced, sometimes elongated and slender; stigma capitate or not obvious, rarely 3-branched. Fruit a berry or capsule, globose, ellipsoid, or linear, with tough indehiscent exocarp or valvately dehiscent. Seeds 1 to many per fruit, reniform to polygonal, smooth or with various sculpturing; embryo curved; endosperm small or absent.\r",
      "About 28 genera and ca. 650 species: worldwide in tropical, subtropical, and a few in temperate regions; four genera and 46 species (10 endemic) in China.",
      "Sun Bishin. 1999. Capparaceae (excluding Cleome). In: Wu Chengyi, ed., Fl. Reipubl. Popularis Sin. 32: 484-531.",
      "Leaves opposite; sepals connate to form a cap that splits along one side as petals expand; fruit capsular, linear, after dehiscence leaving a persistent axis.",
      "Petals 4; anthers basifixed; placentation parietal; fruit a berry; gynophore equaling or exceeding length of mature fruit.",
      "Petals none; anthers dorsifixed; placentation axile; fruit a drupe; gynophore less than 1\/5 as long as mature fruit."
    ],
    "authors":"Mingli Zhang & Gordon C. Tucker"
  },
  {
    "group_title":"Menispermaceae through Capparaceae",
    "family":"Cleomaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10199",
    "knowledge_content":[
      "Herbs [rarely shrubs], sometimes woody at base, producing mustard oils. Stems erect, sparsely or profusely branched, glabrous or glandular pubescent. Stipules scalelike or absent, caducous (petiolar spines sometimes present). Leaves alternate, spirally arranged, palmately compound; petiole often pulvinate; leaflets [1 or]3-7[-11]; leaflet blades with pinnate venation. Inflorescences racemes or corymbs or flowers solitary and axillary; peduncle present; bract present [or absent] at base of pedicels. Pedicel present; bracteoles absent. Flowers bisexual but sometimes appearing unisexual due to incomplete development, actinomorphic or slightly zygomorphic, rotate, crateriform, campanulate, or urceolate, hypogynous. Sepals 4, distinct or basally connate, persistent. Petals 4, distinct, imbricate, attached directly to receptacle; intrastaminal nectary-disk or glands present or sometimes absent. Stamens 6(-32); filaments free or basally adnate to gynophore (or along basal 1\/3-1\/2 in Gynandropsis); anthers dehiscing by longitudinal slits; pollen shed in single grains, 2-nucleate, commonly 3-colporate. Pistil 1, 2-carpellate; ovary superior; ovules 1 to many per locule, 2-tegmic, anatropous, placentation parietal; style 1, straight, short, thick; stigma 1, capitate, unlobed. Fruit an elongate capsule, ± dehiscent by lateral valves along their entire length [indehiscent or dehiscent schizocarp], usually stipitate from elongation of gynophore (lacking in Arivela). Seeds 1-10(-40) per capsule, tan, yellowish brown, or brown, cochleate-reniform, papillose or tuberculate, arillate or not; endosperm scanty or none but a persistent perisperm sometimes present.\r",
      "Seventeen genera and ca. 150 species: worldwide in tropical and temperate regions; five genera and five species (three introduced) in China.",
      "The generic reclassification of Cleomaceae followed here is based on studies of New World taxa by Iltis and Cochrane (Novon 17: 447-451. 2007). They recognized a number of smaller, more clearly delimited genera, based on seed anatomy and morphology, chromosome numbers, biogeographic analyses, and published molecular data. The resultant dismantling of the paraphyletic genus Cleome as it occurs in the New World is applicable in other regions, including Asia, because of the worldwide distribution of all the genera of the Cleomaceae.Sun Bishin. 1999. Cleome. In: Wu Chengyi, ed., Fl. Reipubl. Popularis Sin. 32: 531-540.",
      "Bract at base of pedicels simple; petals 1.5-4.5 cm; filaments 3-8.5 cm; anthers 6-10 mm; seeds 1.9-3.5 mm",
      "Bract at base of pedicels 3-foliate or sometimes apical-most simple; petals 0.7-1.4 cm; filaments 0.5-3 cm; anthers 1-3 mm; seeds 1-1.6 mm",
      "Androgynophore absent; gynophore 4.5-8 cm; nodal spines present (prickles often present on petiole and major leaf veins).",
      "Androgynophore 3-7 mm (in fruiting specimens look for separate scars from filaments distal to sepals or sepal scars)."
    ],
    "authors":"Mingli Zhang & Gordon C. Tucker"
  },
  {
    "group_title":"Menispermaceae through Capparaceae",
    "family":"Hernandiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10407",
    "knowledge_content":[
      "Trees, shrubs, or scandent lianas. Leaves simple or palmately compound, petiolate, circinate and scandent in part, estipulate. Flowers bisexual, unisexual, or polygamous, actinomorphic, in axillary or terminal corymbs or cymose panicles, with bracts or not. Outer tepals (sepals) 3-5. Inner tepals (petals) similar to outer ones. Stamens 3-5; filament bases with appendages on external sides or not; anthers 2-celled; cells valvate. Ovary inferior, 1-loculed, 1-ovuled; ovule pendulous. Drupe ± costate, broadly 2-4-winged or enclosed in an inflated cupule and wings absent. Seed 1, exalbuminous, coat leathery.\r",
      "About four genera and 60 species: tropical regions of E and W Africa, SE Asia, NE Australasia, and Central and South America; two genera and 16 species (seven endemic) in China."
    ],
    "authors":"Xi-wen Li, Jie Li & Brigitta E. E. Duyfjes"
  },
  {
    "group_title":"Menispermaceae through Capparaceae",
    "family":"Illiciaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10450",
    "knowledge_content":[
      "Trees or shrubs, evergreen, glabrous or very rarely young twigs obscurely puberulent. Perules (vegetative bud scales) imbricate, usually caducous. Young twigs with oily or resinous cells, aromatic. Stipules absent. Leaves alternate, usually fascicled near twig apex or sometimes pseudoverticillate or subopposite, simple, petiolate; leaf blade leathery or papery, margin entire and slightly reflexed, midvein abaxially prominent or flat and usually adaxially impressed, secondary veins pinnate. Flowers axillary or supraaxillary, often appearing subterminal near twig apex, rarely cauliflorous, usually solitary, rarely 2-5-clustered, bisexual. Tepals 7-33(-55), yellow or red, rarely white, spirally arranged, distinct, imbricate, usually glandular; outer tepals small, sometimes bractlike; inner tepals large, tonguelike and membranous or ovate to suborbicular and slightly fleshy. Stamens generally numerous, spirally arranged; filaments tonguelike to subterete; anthers 2-celled, basifixed, introrse to introrse-lateral, longitudinally dehiscent. Carpels (5-)7-15(-21), in 1 whorl, distinct; ovary 1-loculed; ovule anatropous, ventral or near basal; style short, subulate. Fruit a star-shaped follicetum of single-seeded follicles, dehiscent along ventral suture. Seeds elliptic to ovate, laterally compressed, glossy; endosperm abundant, oily; embryo small.\r",
      "One genus and ca. 40 species: mostly in E and SE Asia, a few in SE North America and tropical America; 27 species (18 endemic) in China."
    ],
    "authors":"Nianhe Xia & Richard M. K. Saunders"
  },
  {
    "group_title":"Menispermaceae through Capparaceae",
    "family":"Lauraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10479",
    "knowledge_content":[
      "Trees or shrubs (Cassytha a twining parasitic perennial herb with leaves reduced or absent), mostly evergreen (deciduous in temperate regions), sometimes dioecious. Bark and foliage usually aromatic. Leaves usually alternate, occasionally opposite or subopposite or verticillate, simple, usually entire, rarely lobed (Sassafras), mostly pinninerved and subpalmately veined, or often triplinerved, usually punctate and leathery, estipulate. Flowers in usually axillary, occasionally subterminal, panicles, spikes, racemes, or pseudoumbels, generally bisexual, sometimes unisexual, actinomorphic, mostly 3-merous, also 2-merous, small, greenish, yellowish, or white. Perianth biseriate, of usually 4 or 6 basally connate usually undifferentiated sepal-like segments, deciduous or persistent; perianth tube usually persisting as a cupule at base of fruit. Androecium typically of 4 whorls of 3 stamens each, adnate to perianth tube, innermost whorl rarely united, usually reduced to staminodes; filaments usually free, 3rd whorl usually bearing 2 usually sessile and distinct basal glandular protuberances; anthers basifixed, 2-celled or 4-celled at anthesis, those of 2 outer whorls mostly introrse, inner 3rd whorl extrorse, dehiscing by flaplike valves opening upward. Pistil 1; ovary usually superior, 1-loculed; ovule solitary, anatropous, pendulous, placentation parietal; style 1; stigma 1, occasionally 2- or 3-lobed. Fruit a drupe or berry usually surrounded at base by enlarged and often persistent perianth tube seated on a large receptacle or pedicel. Seed with large straight embryo; endosperm absent.\r",
      "About 45 genera and 2000-2500 species: tropical and subtropical regions but mostly in tropical SE Asia and tropical America; 25 genera (two endemic, two introduced) and 445 species (316 endemic, three introduced) in China; two additional species (one endemic) are of uncertain placement.",
      "The Lauraceae are economically important as sources of medicine, timber, nutritious fruits (e.g., Persea americana), spices (e.g., Cinnamomum cassia, C. subavenium, Laurus nobilis), and perfumes. The fruits of Actinodaphne, Cinnamomum, Cryptocarya, Lindera, Litsea, and Syndiclis contain abundant oil and fat. Cinnamomum trees, such as Cinnamomum camphora, C. glanduliferum, and C. parthenoxylon, yield camphor and essential oil, which are used for making perfumes and medicines. The bark of C. cassia and the roots of Lindera aggregata are famous traditional Chinese medicines.The Chinese species of Lauraceae remain poorly known and difficult to identify. The main reason for this is that for a substantial number of species the fruits or flowers are not known. This makes generic placement of such species uncertain, since most genera are defined by floral characters. A second problem is that characters of both flowers and fruits are used in most generic keys and since specimens almost never bear both flowers and fruits, identification is often almost impossible. A drastic remedy for this problem would be to make keys based on flowering specimens and list species known only with fruits as incompletely known species and not include them in the keys. This approach has not been followed in this treatment.The genera are here maintained as they have been recognized in earlier works on Chinese Lauraceae. The present authors are aware that this will seem inconsistent; for instance, in the case of Sassafras, species with 2-celled and 4-celled anthers are included in the same genus, while in other cases pairs of genera are separated based on this character (for example Lindera-Litsea, Alseodaphne-Nothaphoebe, and Parasassafras-Sinosassafras). Generic boundaries in the Litsea group (Actinodaphne, Dodecadenia, Iteadaphne, Lindera, Litsea, Neolitsea, Parasassafras, and Sinosassafras) are not well defined, and generic concepts are likely to change after further research.Aside from these problems, there are a number of vegetative characters that are helpful in the identification process. They are listed below.Leaves opposite or subopposite: Beilschmiedia p.p., Caryodaphnopsis, Cinnamomum p.p.Leaves verticillate or clustered: Actinodaphne, Neolitsea; rarely in Lindera (L. megaphylla) and Litsea (L. verticillata); weakly clustered in Alseodaphne, Dehaasia, Machilus, Phoebe.Leaves triplinerved and alternate: Cinnamomum p.p., Cryptocarya p.p., Lindera p.p., Neocinnamomum.Leaves triplinerved and clustered: Neolitsea.Leaves triplinerved and opposite: Caryodaphnopsis, Cinnamomum p.p.Leaves lobed: Lindera p.p., Sassafras.Leaves with tufts of hairs in axils of lateral veins: Cinnamomum p.p.The three genera Machilus, Persea, and Phoebe cannot be identified adequately by floral characters; they have been separated traditionally on the fruit characters listed in the key.Li Hsi-wen et al. 1982. Lauraceae. In: Li Hsi-wen, ed., Fl. Reipubl. Popularis Sin. 31: 1-463.One of the present authors (van der Werff) provides this alternative key to genera. Nothaphoebe is deliberately not included; see the comment under that genus (p. 200).",
      "Flowers unisexual, rarely bisexual, in pseudoumbels or racemes, rarely solitary; bracts large, forming an involucre",
      "Flowers bisexual, rarely unisexual, in panicles or clusters, rarely in pseudoumbels; bracts small, not forming an involucre",
      "Male flowers: 12 stamens in 3 whorls, all stamens or those of 2nd and 3rd whorl glandular, anthers 2-celled; female flowers: staminodes 4.",
      "Male flowers: 6 stamens in 3 whorls, only those of 3rd whorl glandular, anthers 4-celled; female flowers: staminodes 6.",
      "Evergreen habit; leaves usually whorled, rarely opposite or alternate, unlobed; inflorescence of umbels.",
      "Tepals shorter than stamens; stamens exserted from flower; anther cells apically opening, small, roundish.",
      "Flowers in panicles; anther cells in pairs above each other; perianth lobes deciduous or persistent but not thickened when in fruit; leaves alternate or subopposite, pinninerved, trinerved, or triplinerved.",
      "Flowers in glomerules; anther cells in an arc or in pairs above each other, lower 2 cells large and lateral; perianth lobes persistent and dilated when in fruit; leaves alternate, triplinerved."
    ],
    "authors":"Shugang Li, Xi-wen Li, Jie Li, Puhua Huang, Fa-Nan Wei, Hongbin Cui & Henk van der Werff"
  },
  {
    "group_title":"Menispermaceae through Capparaceae",
    "family":"Magnoliaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10530",
    "knowledge_content":[
      "Trees or shrubs, evergreen or deciduous, usually with perfect flowers, rarely dioecious, monoecious, or andro-dioecious, usually with trichomes or rarely glabrous. Vegetative buds enclosed by hooded stipules. Stipules 2, connate and adnate to or free from petiole, splitting and caducous but with a remaining annular scar on twig or if adnate to petiole with scar on petiole. Leaves simple, spirally arranged, rarely distichous, sometimes fascicled on twig apex and becoming pseudoverticillate, petiolate; leaf blade pinnately veined, margin entire or rarely lobed. Flowers terminal or terminal on axillary brachyblasts, solitary, large, insect pollinated. Spathaceous bracts 1 to several, basal to tepals. Tepals 6-9(-45), in 2 to many whorls, 3(-6) per whorl, usually fleshy, sometimes outer ones (perules) nearly leathery or reduced and sepal-like. Carpels and stamens many, distinct, spirally arranged on an elongated torus. Androecium usually at basal part of torus; filaments thick and short, sometimes elongated; connective usually exserted and forming a long or short tip; anthers linear, with 2 thecae, introrsely, laterally, or rarely extrorsely longitudinally dehiscing. Gynoecium at apical part of torus, sessile or with a gynophore; carpels folded, usually distinct, sometimes connate at base or rarely completely connate; ovules 2-14 per carpel, in 2 series on ventral sutures. Fruit apocarpous or sometimes syncarpous; mature carpels usually dehiscing along dorsal and\/or ventral sutures, rarely connate and irregularly dehiscing or (in Liriodendron) indehiscent, samaroid, and adnate to seed endotesta. Seeds 1-12 per fruiting carpel, pendulous on a filiform elastic funiculus, exserted from mature carpels; testa fleshy, red; endotesta bony; embryo minute; endosperm copious, oily.\r",
      "Seventeen or two genera and ca. 300 species: mainly in SE Asia and Central America, E and S North America, including Mexico and Antilles, and N South America; 13 (one introduced) or two genera and 112 or 108 species including two to eight hybrid species (66 or 62 endemic, four introduced) in China.",
      "Several species in the Magnolioideae are grown for their dried flower buds, known as xinyi (辛夷), which are used medicinally. In addition, HOUPOEA officinalis (Magnolia officinalis) is extensively grown for its medicinal bark. All species in the family are ornamental, and many are grown in public and private gardens throughout much of China and in other parts of the world.One of the co-authors (Nooteboom) considers the Magnoliaceae to include two monogeneric subfamilies, with Magnolioideae containing the genus Magnolia and Liriodendroideae containing the genus Liriodendron. The reduction of the former genera of Magnolioideae to a single genus is based on DNA analysis (S. Kim et al., Amer. J. Bot. 88: 717-728. 2001; H. Azuma et al., J. Plant Res. 112: 291-306. 1999; H. Azuma et al., Proc. Int. Symp. Fam. Magnoliac. 1988, 219-227. 2000; H. Azuma et al., Amer. J. Bot. 88: 2275-2285. 2001; W. S. Judd et al., Pl. Syst. Phylogenet. Approach, 222-224. 1999) and morphology (R. B. Figlar, Proc. Int. Symp. Fam. Magnoliac. 1988, 14-25. 2000; R. B. Figlar & H. P. Nooteboom, Blumea 49: 87-100. 2004). In the present treatment, not only are previously recognized genera still included but additional new and\/or reinstated segregate genera of Magnolioideae are recognized.Nooteboom observes problems in the present treatment of segregate genera. An example of morphological similarity, which is strengthened by DNA results, is the similar fruit of Michelia species and Yulania (Magnolia) stellata. The present treatment distinguishes Michelia and Yulania on the basis of pseudoaxillary flowers in Michelia, but Y. stellata also has pseudoaxillary flowers. Furthermore, the emphasis given to fruit characters in order to separate genera is inconsistent, which renders the key to genera unworkable for specimens that lack fruit. Michelia (Magnolia) baillonii has fruit with connate carpels and is regarded as a Michelia species, although, even with fruit, it cannot be determined to Michelia and instead keys out as Talauma. The same character, fruit with connate carpels, is used to distinguish T. (Magnolia) hodgsonii from Lirianthe, even though, in the absence of fruit, it can hardly or not at all be distinguished from L. (Magnolia) henryi.The following checklist is provided for the benefit of those who prefer to recognize Magnolioideae to include only the genus Magnolia. All the names in Magnolioideae accepted in the present treatment (in italics) are cross-referenced to the corresponding names in Magnolia (in boldface), with the latter followed by full bibliographic references. Except for treating Magnolioideae as monogeneric, the taxonomy at the specific and infraspecific levels in this checklist differs from the following main text of this treatment only in that one co-author (Nooteboom) considers that Magnolia fordiana var. calcarea, M. fordiana var. forrestii, M. figo var. crassipes, and M. figo var. skinneriana should be recognized rather than be treated as species.",
      "Leaf blade 4-10-lobed; anthers dehiscent extrorsely; mature carpels samaroid, indehiscent, deciduous, fruit axis persistent; testa thin and dry, adnate to endocarp (subfam. Liriodendroideae).",
      "Leaf blade unlobed or rarely 2-lobed at apex; anthers dehiscent introrsely or latrorsely; mature carpels not samaroid but in various shapes such as globose, ovoid, ellipsoid, or terete, usually twisted because of abortion of some carpels, dehiscent or circumscissile; testa fleshy, free from fruit segments (subfam. Magnolioideae)",
      "Flowers terminal on terminal brachyblasts; peduncle with internodes of brachyblasts; leaves spirally arranged, ± fascicled, or pseudowhorled"
    ],
    "authors":"Nianhe Xia, Yuhu Liu & Hans P. Nooteboom"
  },
  {
    "group_title":"Menispermaceae through Capparaceae",
    "family":"Menispermaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10561",
    "knowledge_content":[
      "Climbing or twining vines, rarely erect shrubs or small trees; indumentum of simple hairs, often absent. Stems striate, without spines; wood often with radial pith rays. Leaves alternate, spiral; stipules absent; petiole swollen at base and apex; leaf blade simple, sometimes palmately lobed, rarely trifoliolate, venation often palmate, less often pinnate. Inflorescences axillary, sometimes from old wood, rarely superaxillary or terminal, often umbelliform cymes, rarely reduced to single flower or flowers in a head on a discoid receptacle, arranged in thyrses, compound umbels, or racemelike; bracts usually small, rarely leafy (female Cocculus). Flowers unisexual (plants dioecious), usually small, inconspicuous, mostly pedicellate. Sepals often in whorls of (2 or)3(or 4), rarely reduced to 1 (female Stephania), sometimes spirally arranged (Hypserpa, Menispermum), free or less often connate, imbricate or valvate. Petals usually 3 or 6 in 1 or 2 whorls, rarely 2 or 4, sometimes reduced to 1 or absent, usually free, rarely connate, imbricate or valvate. Stamens (2-)6-8(to many); filaments free or connate, sometimes stamens completely fused into synandrium; anthers 1- or 2-locular or apparently 4-locular, dehiscing longitudinally or transversely. Staminodes sometimes present in female flowers. Carpels 1-6[to many], free, often swollen on one side; style initially terminal; stigma lobed or divided, rarely entire. Ovules 2 reducing to 1 by abortion. Pistillodes very small or absent in male flower. Fruit a drupe, straight or often horseshoe-shaped; exocarp membranous or leathery; mesocarp usually fleshy; endocarp bony or sometimes woody, rarely leathery, surface usually variously ornamented, rarely smooth, sides usually with central smooth and sunken condyle, rarely inconspicuous or lacking (e.g., Tinomiscium). Seed usually curved; seed coat thin; endosperm present or absent; embryo mostly curved (straight in Tinomiscium); radicle small, opposite to style scar; cotyledons flat and foliaceous or thick and semiterete.\r",
      "About 65 genera and 350 species: tropical, subtropical, and few temperate regions; 19 genera and 77 species (43 endemic) in China.",
      "Plants of the family contain many different alkaloids and are famous for their medicinal usages. Some species, such as Pericampylus glaucus and Sinomenium acutum, are used for making rattan articles in Sichuan.Lo Hsienshui. 1996. Menispermaceae. In: Law Yuwu, ed., Fl. Reipubl. Popularis Sin. 30(1): 1-81.",
      "Leaf blade venation pinnate, with main lateral veins inserted distinctly above base, never peltate; petiole scars conspicuously discoid or cuplike",
      "Leaf blade venation palmate, with lowermost lateral veins inserted at base of blade or at petiole insertion if peltate, usually more prominent than other lateral veins; petiole scars not conspicuous",
      "Inner whorl of male sepals fused into tube, 5-7 mm; stamens 18-27, fused into conical synandrium; female infructescence usually 1-flowered; drupe with style scar close to base; lateral veins 3-5 pairs.",
      "Male sepals all free, imbricate, 1.5-2.8 mm; stamens 4-18, free or with only filaments fused; female inflorescence with several flowers; drupe with style scar distant from base; lateral veins 5-10 pairs",
      "Flowers and fruits in pedunculate umbel-like cymes or discoid heads, these often in compound umbels, sometimes forming a terminal thyrse by reduction of apical leaves, rarely a slender axillary thyrse of heads (Stephania tetrandra).",
      "Adaxial leaf surface very finely and closely striate; inflorescence racemose, on leafless stems, usually ferruginous tomentose; male flower with 3 pistillodes; petals 2-2.5(-3.5) mm, deeply emarginate.",
      "Adaxial leaf surface not striate; inflorescence cymose, sometimes racemelike but with flowers in small cymes or fascicles; male flower without pistillodes; petals 0.2-2 mm (rarely to 2.5 mm in Tinospora crispa)",
      "Inflorescence longer than leaves, up to 30(-50) cm; sepals usually 12 in 4 whorls, outermost minute, inner whorls spatulate to obovate.",
      "Petals connate or free, rarely absent; sepals usually connate, rarely free; inflorescence a slender axillary racemelike or paniclelike thyrse.",
      "Inflorescence to 30 cm; stamens 3 or 6, free, filaments thick with a prominent collar below anther; wood yellow.",
      "Drupe 2.2-5.5 cm with style scar on one side, borne on clavate carpophore to 4 cm; endocarp with fibrous covering and apparently hairy; leaf blade with abaxial domatia in axils of main veins.",
      "Drupe with terminal style scar; endocarp smooth or sculptured, not fibrous; leaf blade usually without domatia, or only present in basal vein axils",
      "Lowermost lateral veins of leaf blade arising several mm above base; endocarp subellipsoid, 2-2.5 cm, condyle forming narrow groove adaxially; inflorescence a lax panicle with branches to 12 cm; wood yellow.",
      "Lowermost lateral veins truly basal; endocarp flattened and without condyle or subglobose with condyle forming adaxial cavity with a central opening; inflorescence a narrow panicle with branches to 3 cm; wood not yellow",
      "Endocarp almost smooth with a small central perforation; seed with large cotyledons, endosperm absent.",
      "Endocarp laterally concave, condyle lamella-shaped or disciform, not perforate or with small eccentric perforation",
      "Leaf blade never lobed, main basal veins and their outer branches leading directly to margin; endocarp abaxially covered with short pointed processes.",
      "Leaf blade lobed or, if not lobed, main basal veins and their outer branches divided or fused before reaching margin; endocarp with abaxial and lateral ridged crests.",
      "Sepals with black and striped marks, outer whorl subequal to inner whorl; leaf blade ca. as long as wide.",
      "Sepals without black marks, outer whorl much smaller than inner whorl; leaf blade often conspicuously longer than wide.",
      "Sepals and petals each 3 or more; carpels 3; leaves usually not peltate (peltate in Menispermum and Parabaena)"
    ],
    "authors":"Qiming Hu, Xianrui Luo, Tao Chen & Michael G. Gilbert"
  },
  {
    "group_title":"Menispermaceae through Capparaceae",
    "family":"Myristicaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10596",
    "knowledge_content":[
      "Evergreen trees, with tawny or red juice in bark or around heart wood. Leaves simple, alternate, entire, exstipulate, with pinnate veins, often pellucid punctate, spirally or distichously arranged. Inflorescences axillary, paniculate, racemose, capitate, or cymose; flowers fascicled, in various racemose arrangements or clusters; bracts caducous; bracteoles inserted on pedicels or at base of perianth. Plants monoecious or dioecious. Flowers small, unisexual. Perianth gamophyllous; lobes (2 or)3-5, valvate. Stamens 2-40 (often 16-18 in China); filaments connate into a column (staminal column) or peltate disk (staminal disk), apex with anthers connivent or connate into disciform, globose, or elongate synandrium; anthers 2-locular, extrorse, dehiscing longitudinally, adnate to column abaxially, or free. Ovary superior, sessile, 1-locular, anatropous ovule 1, inserted near base; style short or lacking; stigma 2-lobed or lobes connate into a disk, with 2 fissures or with lacerate margin. Fruit with pericarp leathery-fleshy, or near woody, dehiscent into 2 valves. Seed 1, large, arillate; aril fleshy, entire or shallowly or deeply lacerate; testa of 3 or 4 layers, outer layer crustose, middle layer often woody and rather thick, inner layer membranous; endosperm often with volatile oil, ruminate or wrinkled, containing fat (mainly 14C fatty acid) and little amylum; embryo near base. Pollen often with slender reticulate pattern. x = 9, 21, 25.\r",
      "About 20 genera and ca. 500 species: tropical Asia to Pacific islands, also in Africa and tropical America; three genera and 11 species (one introduced) in China.",
      "Li Yan-hui. 1979. Myristicaceae. In: Tsiang Ying & Li Ping-t’ao, eds., Fl. Reipubl. Popularis Sin. 30(2): 176-205.",
      "Pedicel without bracteole; male inflorescences complex panicles; aril entire or shallowly lacerate at apex.",
      "Pedicel with bracteole; male inflorescences with flowers arranged in dense raceme or subumbellate; aril entire, lacerate at apex, or deeply laciniate almost to base",
      "Inflorescences unbranched (or bifurcate); filaments connate into a peltate disk, anthers short; stigmas discoid, shallowly bifid or margin dentate or lacerate; aril entire or lacerate at apex.",
      "Inflorescences dichotomously branched; filaments connate into a column, anthers slender; stigmas shallowly bifid; aril deeply laciniate almost to base."
    ],
    "authors":"Bingtao Li & Thomas K. Wilson"
  },
  {
    "group_title":"Menispermaceae through Capparaceae",
    "family":"Papaveraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10650",
    "knowledge_content":[
      "Herbs, annual, biennial, monocarpic perennial, perennial, or shrubby. Laticifers or elongated idioblasts present. Leaves alternate or in a basal rosette, rarely opposite or whorled, usually without stipules; leaf blade entire to compound. Inflorescences racemes, panicles, dichasia, pseudoumbels, or solitary flowers. Flowers actinomorphic, bisymmetric, or zygomorphic, always bisexual, usually 2-merous, rarely 3- or 4-merous. Calyx caducous, green or petaloid. Corolla choripetalous or quasi-sympetalous, very rarely absent. Anthers opening by slits. Ovary superior, syncarpous with 2 to several carpels; placentation parietal.\r",
      "Forty genera and ca. 800 species: mainly in the N Hemisphere of both the Old and New Worlds, extending into Central and South America, a few in Africa; 19 genera (one endemic, two introduced) and 443 species (295 endemic, five introduced, one requiring verification) in China.",
      "Many species are used medicinally due to the high content of alkaloids.The two subfamilies recognized here are often treated as separate families.Wu Chengyi, Chuang Hsuan & Su Ziyun. 1999. Papaveraceae. In: Wu Chengyi, ed., Fl. Reipubl. Popularis Sin. 32: 1-483, 541-545.",
      "Laticifers present; sap watery or milky; sepals green, entire, enclosing corolla in bud, imbricate or (in Eschscholzia) fused into a caducous hood; corolla actinomorphic, with (0-)4-8 (rarely more) petals; petals all similar, flat, imbricate and crumpled in bud; stamens several with filiform filaments; nectaries absent",
      "Laticifers lacking; sap watery, but sometimes colored; sepals usually petaloid, not enclosing petals in bud; corolla bisymmetric or zygomorphic; petals 4 in 2 very dissimilar whorls, with wings, crests, and\/or spurs, pairwise valvate in bud; androecium of 8 thecae distributed on 2, 4, or 6 \"stamens\" with broad hyaline filaments; nectaries usually present"
    ],
    "authors":"Mingli Zhang, Zhiyun Su, Magnus Lidén & Christopher Grey-Wilson"
  },
  {
    "group_title":"Menispermaceae through Capparaceae",
    "family":"Schisandraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10803",
    "knowledge_content":[
      "Vines, woody, monoecious or dioecious. Stipules absent. Leaves alternate or ± clustered, simple, petiolate. Flowers axillary to leaves on ultimate branches or in axils of fugacious bracts near base of ultimate shoots, generally solitary but occasionally in pairs or clusters to 8, unisexual, hypogynous, with few to numerous parts generally spirally arranged, pedunculate. Perianth segments not as separate sepals and petals, distinct, outermost and innermost sometimes reduced. Staminate flowers: stamens 4-80, ± distinct, distinct but basally connate, or connate as a fleshy synandrium or tightly compressed; anthers basifixed (except Schisandra plena), thecae dehiscing by longitudinal slits. Pistillate flowers: carpels 12 to ca. 300, developmentally conduplicate; stigmatic crest as unvascularized \"pseudostyle,\" sometimes modified as peltate \"pseudostigma\"; ovary unilocular; ovules 2-5(-11) per ovary, anatropous, ventrally attached or pendulous, 2-tegmic, crassinucellar. Fruit aggregates of apocarps; receptacle ellipsoid or elongate; apocarps with fleshy pericarp. Seeds 1-5(or more) per apocarp, ventrally attached or pendulous, laterally flattened; endosperm copious, oily.\r",
      "Two genera and 39 species: mainly in E and SE Asia but one species of Schisandra in North America; two genera and 27 species (16 endemic) in China.",
      "Law Yuwu. 1996. Schisandreae. In: Law Yuwu, ed., Fl. Reipubl. Popularis Sin. 30(1): 231-269, 271-273.",
      "Androecium of distinct but highly compressed stamens or of connate stamens in a fleshy androecial mass",
      "Apex of androecium with variable number of staminodes or occasionally staminodes absent; pollen 6-colpate."
    ],
    "authors":"Nianhe Xia, Yuhu Liu & Richard M. K. Saunders"
  },
  {
    "group_title":"Brassicaceae through Saxifragaceae",
    "family":"Brassicaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10120",
    "knowledge_content":[
      "Herbs annual, biennial, or perennial, sometimes subshrubs or shrubs, with a pungent, watery juice. Eglandular trichomes unicellular, simple, stalked or sessile, 2- to many forked, stellate, dendritic, or malpighiaceous (medifixed, bifid, appressed), rarely peltate and scalelike; glandular trichomes multicellular, with uniseriate or multiseriate stalk. Stems erect, ascending, or prostrate, sometimes absent. Leaves exstipulate, simple, entire or variously pinnately dissected, rarely trifoliolate or pinnately, palmately, or bipinnately compound; basal leaf rosette present or absent; cauline leaves almost always alternate, rarely opposite or whorled, petiolate or sessile, sometimes absent. Inflorescence bracteate or ebracteate racemes, corymbs, or panicles, sometimes flowers solitary on long pedicels originating from axils of rosette leaves. Flowers hypogynous, mostly actinomorphic. Sepals 4, in 2 decussate pairs, free or rarely united, not saccate or lateral (inner) pair saccate. Petals 4, alternate with sepals, arranged in the form of a cross (cruciform; hence the earlier family name Cruciferae), rarely rudimentary or absent. Stamens 6, in 2 whorls, tetradynamous (lateral (outer) pair shorter than median (inner) 2 pairs), rarely equal or in 3 pairs of unequal length, sometimes stamens 2 or 4, very rarely 8-24; filaments slender, winged, or appendaged, median pairs free or rarely united; anthers dithecal, dehiscing by longitudinal slits. Pollen grains 3-colpate, trinucleate. Nectar glands receptacular, highly diversified in number, shape, size, and disposition around base of filaments, always present opposite bases of lateral filaments, median glands present or absent. Pistil 2-carpelled; ovary superior, sessile or borne on a distinct gynophore, mostly 2-locular and with a false septum connecting 2 placentae; placentation parietal, rarely apical; ovules anatropous or campylotropous, bitegmic, 1 to many per locule. Fruit typically a 2-valved capsule, generally termed silique (siliqua) when length 3 × or more than width, or silicle (silicula) when length less than 3 × width, dehiscent or indehiscent, sometimes schizocarpic, nutletlike, lomentaceous, or samaroid, segmented or not, terete, angled, or flattened parallel to septum (latiseptate) or at a right angle to septum (angustiseptate); valves 2(or 3-6); replum (persistent placenta) rounded, rarely flattened or winged; septum complete, perforated, reduced to a rim, or lacking; style 1, distinct, obsolete, or absent; stigma capitate or conical, entire or 2-lobed, sometimes lobes decurrent and free or connate. Seeds without endosperm, uniseriately or biseriately arranged in each locule, aseriate when 1, winged or wingless, mucilaginous or not when wetted; cotyledons incumbent (embryo notorrhizal: radicle lying along back of 1 cotyledon), accumbent (embryo pleurorrhizal: radicle applied to margins of both cotyledons), or conduplicate (embryo orthoplocal: cotyledons folded longitudinally around radicle), rarely spirally coiled (embryo spirolobal). Germination epigeal.\r",
      "About 330 genera and 3500 species: all continents except Antarctica, mainly in temperate areas, with highest diversity in Irano-Turanian, Mediterranean, and W North American regions; 102 genera (eight endemic) and 412 species (115 endemic) in China.",
      "Because of lack of a comprehensive classification based on phylogenetic relationships among genera, and in order to facilitate direct comparison between the accounts in FOC and FRPS, the sequence of genera follows Schulz (Nat. Pflanzenfam. 17b: 227-658. 1936). However, it should be emphasized that his system is largely artificial because he placed closely related genera in different tribes and remotely related genera in the same tribe. For example, Arabis, Aubrieta, Draba, and Macropodium, which are very closely related on the basis of recent molecular studies, were placed by Schulz in four different tribes, whereas the unrelated Capsella, Lepidium, and Thlaspi were placed in one tribe. The delimitation of genera is often difficult, and mature fruits are needed for reliable identification.The Brassicaceae include many important crop plants that are grown as vegetables (Brassica, Nasturtium, Raphanus) and sources of vegetable oils (Brassica) and condiments (Armoracia, Brassica, Eutrema, Sinapis). Oils of Brassica probably rank first in terms of tonnage of the world's production of edible oils. The family includes many ornamentals in the genera Erysimum, Iberis Linnaeus, Lobularia, Malcolmia, and Matthiola. Of these, only Lobularia maritima has become naturalized in China. The family also includes more than 120 species of weeds. Arabidopsis thaliana, which is naturalized in China, has become the model organism in many fields of experimental biology.The delimitation of genera in the Brassicaceae is often difficult because of the frequent independent evolution of what appear to be similar character states, the variability of a given character in one genus and its fixture in another, and the inadequate sampling of material by most authors. Fruit characters are essential in the identification of genera. However, a key emphasizing flowering material is given in addition to the one emphasizing fruit. The most reliable determination of genera can be achieved when the material has both fruit and flowers and when both keys are successfully used to reach the same genus.The types of cotyledonary position, which in reality is the position of the radicle in relation to the cotyledons (e.g., radicle accumbent, incumbent, or conduplicate, though radicle referred to as \"cotyledon\" throughout) are important in the separation of many genera, and a cross section of the seed provides the easiest and simplest way of determining that position. The exact number of ovules per ovary can easily be determined from the fruit because aborted ovules persist through fruit dehiscence. However, it is more laborious to determine the ovule number from pistils and young fruit.Cheo Tai-yien, Guo Rong-lin, Lan Young-zhen, Lou Lian-li, Kuan Ke-chien & An Zheng-xi. 1987. Cruciferae. In: Cheo Tai-yien, ed., Fl. Reipubl. Popularis Sin. 33: 1-483.Leads marked with a \"double asterisk\" (**) indicate that mature fruits are necessary for the identification of genera in the subordinate couplet(s).",
      "Fruit much wider than long, 2-16-spined, with prominently 3-20-veined lateral wings larger than the seed-bearing part",
      "Fruit longer than wide or about as long as wide, not spiny, wingless or with veinless wings smaller than the seed-bearing part.",
      "Cauline leaves petiolate or cuneate to petiolelike base, not auriculate or sagittate; fruit oblong, elliptic, obovate, or suborbicular.",
      "Fruiting pedicels strongly recurved, often forming a loop; fruit 1- or 2-seeded, often aborted on 1 side; plants rhizomatous perennials",
      "Fruiting pedicels straight, erect, ascending, or divaricate; fruit more than 5-seeded, not aborted on 1 side; plants annual, biennial, or rarely non-rhizomatous perennials.",
      "Fruiting raceme bracteate throughout or rarely along proximal half; leaves 1- or 2-pinnatisect; fruit more than 20-seeded",
      "Cauline leaves sessile, auriculate, sagittate, or amplexicaul; roots not fleshy, cylindric; fruit often winged apically",
      "Cauline leaves petiolate or sessile but not auriculate, sagittate, or amplexicaul; roots fleshy, fusiform or conical; fruit wingless or cristate apically.",
      "Plants 0.5-2 m tall; infructescence a large panicle; replum slender, not flattened; racemes ebracteate",
      "Plants rarely to 0.3 m tall; infructescence a small raceme or corymb; replum broad, flattened at least basally; racemes often bracteate throughout.",
      "Cauline leaves sessile; fruit often cristate apically; fruit valves obscurely veined; seeds minutely reticulate",
      "Cauline leaves petiolate; fruit not cristate apically; fruit valves with a prominent midvein; seeds papillate or foveolate",
      "Dwarf plants rarely more than 3 cm tall; all or most fruit on solitary pedicels originating from basal rosette; leaves palmately veined; fruit halves smooth; stamens 6",
      "Plants often more than 10 cm tall; fruit in racemes; leaves pinnately veined; fruit halves prominently reticulate to rugose, very rarely smooth; stamens 2 or 4",
      "Fruit 1-seeded, obscurely differentiated into halves, without a septum, indehiscent, with thickened, central, seed-bearing part; fruiting pedicels reflexed; petals yellow.",
      "Fruit 2-seeded, well differentiated into halves, with a well-developed septum, dehiscent or rarely indehiscent, not thickened at center; fruiting pedicels not reflexed; petals white or pink (yellow in Lepidium perfoliatum).",
      "Fruit navicular, semiovoid to semiglobose, with strongly involute wing margins bearing 1 or 2 rows of tubercles; fruiting pedicels articulate at base",
      "Fruit oblong, elliptic, ovate, or pyriform, flat, wingless or wing margins neither involute nor tuberculate; fruiting pedicels not articulate.",
      "Fruit somewhat 4-angled; leaves leathery; caudex thick, with petiolar remains of previous years; stamens 6",
      "Fruit flat, not angled; leaves herbaceous rarely leathery; caudex absent or slender, rarely thick and with petiolar remains of previous years; stamens 2, 4, or 6",
      "Fruit readily detached from pedicel; valve apex persistently united with replum; replum not flattened; valves marginal veins prominent; petals purple, pink, or blue",
      "Fruit not detached from pedicel; valve apex readily separated from replum at dehiscence; replum strongly flattened; valves marginal veins obscure or absent; petals white",
      "Style slender, 1.5-3.5 mm, readily caducous from a basal articulation; replum strongly expanded laterally",
      "Style obsolete, or fruit attenuate into a conical, persistent, stylelike beak without a basal articulation; replum not expanded laterally.",
      "Cauline leaves petiolate, not auriculate; plants 0.5-2.5 m tall; fruit rounded at apex, strongly differentiated into a seedless basal segment and a larger, 1-seeded terminal segment",
      "Cauline leaves sessile, auriculate to amplexicaul; plants rarely to 0.5 m tall; fruit tapered to apex, unsegmented.",
      "Fruiting pedicels divaricate, not articulate at base; fruit 2-seeded, not constricted at middle; cotyledons spirolobal; petals white",
      "Fruiting pedicels reflexed, articulate at base; fruit 1-3-seeded, constricted between seeds; cotyledons incumbent; petals purplish or pink",
      "Some or all cauline leaves auriculate or sagittate at base; seeds more than 50 per fruit; petals yellow",
      "Cauline leaves not auriculate or sagittate at base; seeds less than 25 per fruit; petals white, pink, blue, or purple.",
      "Leaves trifoliolate, pinnately compound, pinnatisect, or rarely simple; racemes ebracteate, if bracteate, then basal bracts trifoliolate; fruiting pedicels glabrous or pubescent all around; petals white",
      "Leaves palmately 3-5-lobed; racemes bracteate throughout; fruiting pedicels puberulent adaxially; petals purple, blue, or rarely pink",
      "Raceme bracteate throughout; fruit 1- or 2-seeded; valves with 3 rows of crests; filaments of median stamens appendaged",
      "Racemes ebracteate; fruit more than 2-seeded; valves without rows of crests; filaments of median stamens unappendaged.",
      "Fruit (0.8-)1-1.7 cm wide; valves with prominent midvein and lateral and marginal veins, apex persistently united with replum",
      "Fruit rarely to 0.3 cm wide; valves obscurely veined or only with a prominent midvein, apex readily separated from replum at dehiscence.",
      "Fruit slightly 4-angled, on a short gynophore; stems leafy; lowermost leaves cordate to ovate, often palmately veined",
      "Fruiting pedicels divaricate; trichomes simple and forked; seeds wingless, 1 or 2; cotyledons spirolobal; petals bright yellow",
      "Fruiting pedicels strongly reflexed; trichomes dendritic; seeds winged, often more than 2; cotyledons accumbent; petals yellowish white",
      "Cauline leaves sessile, auriculate or sagittate; style less than 1 mm; stigma entire; fruit readily detached from divaricate pedicels; petals yellow",
      "Cauline leaves petiolate, not auriculate or sagittate; style 1-7 mm; stigma deeply 2-lobed; fruit not readily detached from erect-ascending pedicels; petals white or pink.",
      "Fruit valves with 3 rows of crests; fruiting pedicels straight or slightly curved, not forming a loop; leaves entire; filaments of median stamens appendaged",
      "Fruit valves without crests; fruiting pedicels often forming a loop; at least some leaves dentate or lobed near apex; filaments of median stamens unappendaged",
      "Branched trichomes dendritic; inflorescence non-flexuous racemes, if branched then fruit more than 10-seeded.",
      "Cauline leaves auriculate or sagittate at base; fruit obpyriform; valves connate at margin and hiding replum, beaklike apex caudate, extending into style",
      "Cauline leaves often neither auriculate nor sagittate at base; fruit variously shaped but not obpyriform; valve margins not connate, apex not extending into a caudate beak.",
      "Seeds wingless or narrowly margined (margin to 0.1 mm wide); petals obtuse or emarginate; filaments often toothed or winged",
      "Style conical or subconical; fruit 5-10 mm wide; cotyledons incumbent, if accumbent then septum reduced to a rim",
      "Perennials, or if annuals then styles obsolete; petals obtuse or rarely emarginate, sometimes absent; seeds not margined.",
      "Fruit strongly flattened; valves prominently veined, apex persistently united with replum; style obsolete; calyx deciduous before fruit maturity; cotyledons accumbent",
      "Fruit terete; valves obscurely veined, readily separated from replum at dehiscence; style distinct; calyx persistent at fruit base; cotyledons incumbent",
      "Fruit valves obscurely veined; replum flattened; fruiting pedicels persistent next season, puberulent along 1 line",
      "Fruit valves prominently veined; replum terete; fruiting pedicels neither persistent nor puberulent along 1 line.",
      "Style distinct, to 1 mm; valve apex readily separated from replum at dehiscence; cotyledons incumbent",
      "Fruit valves with a prominent midvein; branched trichomes forked; stigma lobes decurrent; glands on uniseriate, few-celled stalks; median filaments not united",
      "Fruit valves not or obscurely veined; branched trichomes dendritic; stigma lobes not decurrent; glands on multiseriate, multicellular stalks; median filaments united in pairs",
      "Stigma slightly lobed, lobes neither decurrent nor connivent; median filaments united in pairs or strongly flattened; lateral sepals not saccate",
      "Stigma prominently lobed; lobes decurrent, connivent; median filaments neither united nor strongly flattened; lateral sepals saccate.",
      "Fruit dimorphic, lowermost indehiscent, corky, and terete, uppermost dehiscent and flattened; replum rounded",
      "Cauline leaves auriculate or amplexicaul; style obsolete or rarely to 2 mm; lateral sepals not saccate.",
      "Cauline leaves not auriculate or amplexicaul; style distinct, 5-50 mm; lateral sepals often strongly saccate.",
      "Fruit nutletlike, terete or angled, 1-3 seeded, if 2- or 3- seeded then breaking transversely into 1-seeded units; petals purple or pink",
      "Fruit more than 2-seeded, linear, lanceolate, or ovoid, sessile or nearly so; fruiting pedicels not articulate at base.",
      "Stigma capitate, entire or slightly lobed; cotyledons conduplicate; plants annual or biennial; petal veins darker in color than rest of petal",
      "Stigma conical, with prominently decurrent and connivent lobes; cotyledons accumbent; plants perennial; petals uniform in color",
      "Taproot fleshy, fusiform; stigma 2-lobed; fruiting pedicels glabrous; cotyledons accumbent; median staminal filaments 1-toothed; petals white",
      "Taproot not fleshy, slender; stigma entire; fruiting pedicels papillate adaxially; cotyledons incumbent; petals purple",
      "Fruit valves with prominent midvein and marginal veins, apex persistently united with replum; at least some leaves dentate; fruit 14-26-seeded; style obsolete",
      "Fruit valves usually obscurely veined, readily separated from replum at dehiscence; leaves entire; fruit 4-12-seeded; style more than 0.5 mm.",
      "Replum terete; roots not fleshy; plants with rhizomes or caudices; basal leaves or petioles often persistent.",
      "Leaves simple or pinnatisect, terminal lobe considerably larger than lateral ones; cotyledons conduplicate",
      "Cotyledons conduplicate; fruit often segmented, usually with a beaklike terminal segment; seeds globose, rarely ovoid, ellipsoid, or oblong.",
      "Cotyledons accumbent or incumbent; fruit unsegmented, not beaked at apex; seeds variously shaped but never globose.",
      "Stigma entire; seeds globose; fruit often segmented, without style or with stylelike beak; petals yellow",
      "Stigma distinctly 2-lobed, lobes subdecurrent; seeds oblong; fruit not segmented, with a distinct style; petals purple, lavender, or white",
      "Fruit valves with a prominent midvein or sometimes obscurely veined, never coiled during or after dehiscence; replum terete or rarely slightly flattened (a few Dontostemon).",
      "Leaf margin with distinct, mucronate callosities terminating ultimate veins; fruit valves obscurely veined.",
      "Leaves flabellate, obovate, or spatulate; fruit latiseptate, valve apex persistently united with replum; cotyledons accumbent",
      "Leaves reniform, ovate, or deltoid; fruit terete or 4-angled, valve apex readily separated from replum at dehiscence; cotyledons incumbent.",
      "Fruit valves not veined or obscurely veined, if with a distinct midvein then seeds biseriate and colliculate.",
      "Leaves pinnatisect or lyrate; stems solid, not rooting from lowermost nodes; seeds foveolate or colliculate; petals yellow",
      "Leaves pinnately compound; stems hollow, rooting from lowermost nodes; seeds coarsely reticulate; petals white",
      "Seeds reticulate, fewer per fruit, (to 96 in Thellungiella salsuginea); petals white, lavender, or purple (yellow in Christolea); cotyledons incumbent (accumbent in some Dontostemon).",
      "Raceme rachis with minute, twisted trichomes; plants not glaucous; cauline leaves not auriculate or amplexicaul; filaments of median stamens united in pairs",
      "Raceme rachis glabrous; plants glaucous; cauline leaves auriculate or amplexicaul (except for Thellungiella parvula); filaments of median stamens free.",
      "At least middle and lower cauline leaves petiolate, dentate; seeds transversely oriented in fruit; petals yellow",
      "Fruit readily dehiscent, torulose; ultimate leaf segment oblong; stigma capitate; seeds narrowly winged distally",
      "Pulvinate perennials; petals white or rarely pale yellow; style 0.5-1.5 mm; seeds not mucilaginous when wetted",
      "Annuals or biennials; petals yellow; style obsolete or rarely to 0.5 mm; seeds mucilaginous when wetted.",
      "Fruit terete or 4-angled (latiseptate in Malcolmia hispida and M. karelinii); seeds wingless; trichomes simple and forked; cotyledons incumbent.",
      "At least fruit, pedicels, and distal portions of stem exclusively or predominately with malpighiaceous trichomes and without simple trichomes ones.",
      "Fruit indehiscent, breaking transversely into 1-seeded segments; septum absent; lowermost parts of plant with stalked trichomes",
      "Fruit margins strongly indurated, bases of valves and replum persistently united; petals white; filaments of median stamens winged",
      "Fruit margins not indurated, bases of valves and replum readily separated at dehiscence; petals purplish; median stamens slender",
      "Fruit indehiscent, breaking transversely into 1-seeded segments; filaments of median stamens united to middle or nearly to apex",
      "Cauline leaves auriculate at base, or absent; valves obscurely veined or only midvein distinct; fruit elliptic-linear in cross section",
      "Cauline leaves petiolate; valves with prominent midvein and 2 marginal veins and conspicuous lateral ones; fruit rectangular in cross section",
      "Plants exclusively with appressed, stellate trichomes; lateral sepals subsaccate; replum constricted between seeds; seeds 6-12 per fruit",
      "Plants with more than 1 kind of trichomes; lateral sepals often not saccate; replum not constricted between seeds; seeds (16-)20-80 per fruit.",
      "Seeds biseriate; fruit narrowly oblong, lanceolate, lanceolate-linear, or rarely linear, often slightly to strongly contorted",
      "Cauline leaves sessile, auriculate, sagittate, or amplexicaul at base; at least some trichomes stellate",
      "Cauline leaves petiolate or narrowed to a petiolelike base, never auriculate, or fruiting stems leafless.",
      "Fruit terete, variously oriented, if appressed to stem then racemes bracteate and\/or fruit pubescent; plants not glaucous distally; cotyledons incumbent.",
      "Branched trichomes forked, submalpighiaceous, subdendritic, and stellate, often more than 1 type present.",
      "Fruit glabrous or with stellate or forked trichomes; petals purple, pink, or white; racemes often bracteate at least basally",
      "Plants with exclusively stalked, stellate trichomes; filaments of median stamens strongly flattened or winged at base",
      "Plants with a mixture of simple, forked, stellate, or submalpighiaceous trichomes; filaments of median stamens slender.",
      "Fruit linear, sometimes curved or twisted; stems often subdecumbent; plants annual, if perennial then racemes bracteate at least basally",
      "Plants with some stellate and\/or dendritic trichomes; at least some upper cauline leaves dentate, denticulate, or lobed; seeds larger"
    ],
    "authors":"Tai-yien Cheo, Lianli Lu, Guang Yang, Ihsan Al-Shehbaz & Vladimir Dorofeev"
  },
  {
    "group_title":"Brassicaceae through Saxifragaceae",
    "family":"Bretschneideraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20002",
    "knowledge_content":[
      "Trees. Myrosin cells present in bark of branches and in inflorescence, producing glucosinolates. Leaves alternate, imparipinnate; leaflets petiolulate, opposite or lower ones alternate, entire; veins pinnate; stipules absent. Racemes terminal, erect. Flowers bisexual, zygomorphic. Calyx broadly campanulate, 5-lobed. Petals 5, free, imbricate, unequal, clawed, adnate from middle to upper part of calyx tube. Stamens 8, attached to thin, annular nectary disc at base of petals, shorter than petals; filaments filiform, hairy, especially in basal 1\/2. Pistil 1; ovary superior, sessile, 3-5-loculed; placentation axile; ovules 2 per locule, pendulous; style longer than stamens; stigma capitate, minute. Fruit a capsule; valves 3-5, thick walled, dehiscent. Seeds oblong; endosperm absent.\r",
      "The taxonomic placement of the Bretschneideraceae has been enigmatic, with alliances postulated among such widely divergent families as Capparaceae, Fabaceae, Hippocastanaceae, Moringaceae, and Sapindaceae. Two studies (Boufford et al., Biochem. Syst. Ecol. 17: 375-379. 1989; Tobe & Peng, Bot. J. Linn. Soc. 103: 139-152. 1990) indicate a close relationship with Hippocastanaceae and Sapindaceae. More recent evidence aligns Bretschneidera with the monotypic Akania J. D. Hooker (from Australia) in the Akaniaceae, distinct from the Sapindaceae (Doweld, Bot. J. Linn. Soc. 120: 379-389. 1996; Rodman, Syst. Bot. 16: 598-618 and 619-629. 1991; Rodman et al., Ann. Missouri Bot. Gard. 80: 866-699. 1993).Chen Wei-chiu. 1984. Bretschneideraceae. In: Fu Shu-hsia & Fu Kun-tsun, eds., Fl. Reipubl. Popularis Sin. 34(1): 8-10."
    ],
    "authors":"Lianli Lu & David E. Boufford"
  },
  {
    "group_title":"Brassicaceae through Saxifragaceae",
    "family":"Crassulaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10225",
    "knowledge_content":[
      "Herbs, subshrubs, or shrubs. Stems mostly fleshy. Leaves alternate, opposite, or verticillate, usually simple; stipules absent; leaf blade entire or slightly incised, rarely lobed or imparipinnate. Inflorescences terminal or axillary, cymose, corymbiform, spiculate, racemose, paniculate, or sometimes reduced to a solitary flower. Flowers usually bisexual, sometimes unisexual in Rhodiola (when plants dioecious or rarely gynodioecious), actinomorphic, (3 or)4-6(-30)-merous. Sepals almost free or basally connate, persistent. Petals free or connate. Stamens as many as petals in 1 series or 2 × as many in 2 series. Nectar scales at or near base of carpels. Follicles sometimes fewer than sepals, free or basally connate, erect or spreading, membranous or leathery, 1- to many seeded. Seeds small; endosperm scanty or not developed.\r",
      "About 35 genera and over 1500 species: Africa, America, Asia, Europe; 13 genera (two endemic, one introduced) and 233 species (129 endemic, one introduced) in China.",
      "Some species of Crassulaceae are cultivated as ornamentals and\/or used medicinally.Fu Shu-hsia & Fu Kun-tsun. 1984. Crassulaceae. In: Fu Shu-hsia & Fu Kun-tsun, eds., Fl. Reipubl. Popularis Sin. 34(1): 31-220.",
      "Stamens usually in 2 series, 2 × as many as petals; flowers sometimes unisexual and male flowers without stamens.",
      "Leaves always opposite, joined to form a basal sheath; inflorescences axillary, often shorter than subtending leaf; plants not developing enlarged rootstock",
      "Leaves alternate, occasionally opposite proximally; inflorescence terminal, often very large; plants sometimes developing enlarged, perennial rootstock.",
      "Inflorescence with a distinct, elongated main axis forming a raceme or thyrse much longer than broad; carpels narrowed at base, free; basal leaves often densely hairy",
      "Inflorescence cymose with no distinct main axis, often broader than long; carpels broad at base, often ± connate; basal leaves often glabrous.",
      "Plants with conspicuous basal leaf rosettes; corolla campanulate, petals initially erect then spreading above middle, ± S-shaped in longitudinal section",
      "Flowers 4-merous and with prominent, persistent corolla tube completely enclosing follicles; leaves opposite.",
      "Flowers 5- or 6(-12)-merous, rarely 3- or 4-merous (Rhodiola) and then petals free or joined at base only and not enclosing follicles; leaves alternate, opposite, or in a rosette.",
      "Carpels sessile, base not constricted (slightly attenuate in some Rhodiola species) and usually connate (free in Sedum chuhsingense, S. semilunatum, and sometimes in S. przewalskii).",
      "Plants perennial, usually with several to many flowering stems; basal leaves not in a conspicuous rosette; inflorescence formed from a terminal group of cymes, usually broader than long, sometimes with aditional cymes in axils of distal leaves",
      "Plants monocarpic, with a single flowering stem; basal leaves in a somewhat conspicuous rosette, dying when plant flowers; inflorescence with an elongated main axis and numerous lateral cymules, sometimes a true raceme with cymules reduced to single flowers",
      "Stems dimorphic with usually very stout caudex or rhizome, usually with brown or blackish, membranous, scalelike leaves, sharply differentiated from much more slender, erect or ascending, leafy flowering stems.",
      "Leaves terete or semiterete in cross section, margin entire (4-8-dentate in Sedum rosthornianum and remotely dentate in S. engleri var. dentatum); seed testa reticulate or papillate-reticulate",
      "Petals yellow; basal leaf rosette almost as wide as inflorescences are long; plants glabrous throughout"
    ],
    "authors":"Kunjun Fu, Hideaki Ohba & Michael G. Gilbert"
  },
  {
    "group_title":"Brassicaceae through Saxifragaceae",
    "family":"Droseraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10290",
    "knowledge_content":[
      "Herbs perennial or annual, mostly terrestrial or rarely aquatic, carnivorous. Stem with much reduced leaf blades that function as rhizoids below ground, with or without tubers or rhizomes. Leaves basal and rosulate, or alternate, rarely whorled, stipulate or exstipulate; leaf blade with sticky, glandular hairs, or with sensitive hairs that trigger closing of blade to trap small animals, juvenile leaf blade circinate. Flowers axillary, lateral or terminal, usually borne in a cincinnus, rarely in a raceme or solitary, bisexual, actinomorphic, 4- or 5-merous. Sepals 4 or 5(or 6-8), persistent. Petals as many as sepals or more. Stamens 4 or 5, hypogynous, free, alternate with petals; anthers 2-loculed, dehiscing by longitudinal slits. Ovary superior or nearly so, globose or ovoid, 2-5-carpellate, 1-3-loculed; placentation parietal or basal; styles (2 or )3-5(or 6), simple or branched; stigma simple or multifid. Fruit a capsule, dehiscent or indehiscent. Seeds few to numerous; endosperm fleshy; embryo straight.\r",
      "Four genera and more than 100 species: temperate and tropical regions of both hemispheres; two genera and seven species (one endemic) in China.",
      "Ruan Yun-zhen. 1984. Droseraceae. In: Fu Shu-hsia & Fu Kun-tsun, eds., Fl. Reipubl. Popularis Sin. 34(1): 14-30.",
      "Herbs terrestrial; leaves basal and rosulate, or alternate, leaf blade with sticky, glandular hairs; ovary 2-5-carpellate; capsule dehiscent",
      "Herbs aquatic; leaves whorled, leaf blades with sensitive hairs that trigger closing of leaf blades; ovary 5-carpellate; capsule indehiscent"
    ],
    "authors":"Lianli Lu & Katsuhiko Kondo"
  },
  {
    "group_title":"Brassicaceae through Saxifragaceae",
    "family":"Moringaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10585",
    "knowledge_content":[
      "Trees, shrubs, or herbs, deciduous, massive to slender, tuberous when young and sometimes as adults; bark and pith with gum canals. Leaves alternate, 1-3(or 4)-imparipinnate, glabrous to puberulent; leaflets opposite, entire, sometimes caducous; stipules absent but stalked glands present at base of petiole and leaflets. Flowers borne in axillary panicles, bisexual, white to yellow or red, actinomorphic to zygomorphic, with or without hypanthium. Sepals 5, often reflexed at anthesis. Petals 5, equal or unequal, often reflexed. Stamens in 2 series, 5 perfect and 5 reduced to staminodes; filaments free. Pistil 1; ovary superior, borne on short gynophore, 1-loculed; placentas 3, parietal; ovules numerous; style 1; stigma minute. Fruit a capsule, 3-12-ribbed, sometimes with elongated beak; valves 3, dehiscent. Seeds numerous, 3-winged or wingless, without endosperm.\r",
      "One genus and ca. 13 species: NE and SW Africa, SW Asia, India, Madagascar: one species (introduced) in China.",
      "Chen Wei-qiu. 1984. Moringaceae. In: Fu Shu-hsia & Fu Kun-tsun, eds., Fl. Reipubl. Popularis Sin. 34(1): 6-8."
    ],
    "authors":"Lianli Lu & Mark Olson"
  },
  {
    "group_title":"Brassicaceae through Saxifragaceae",
    "family":"Nepenthaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10610",
    "knowledge_content":[
      "Lianas or shrubs to 20 m, sometimes only weakly woody, dioecious, carnivorous. Stem simple or branched, erect, climbing, or procumbent, cylindric or triangular in cross section, glabrous or pubescent. Leaves alternate, petiolate or sessile; midvein prolonged into a tendril, apex of tendril usually developing into a dimorphic pitcher with a lid usually projecting over mouth and a spur inserted at base of lid. Pitchers toward base of plant ovoid, facing inward, with 2 fringed wings, tendril ventral, uncoiled; pitchers toward apex of plant cylindric or funnelform, facing outward, wings generally unfringed or reduced to ridges, tendril dorsal, coiled. Inflorescence terminal (appearing leaf opposed because of continued axillary growth), racemose, or with secondary branches 2-flowered or cincinni, usually sparsely bracteate. Flowers regular; perianth in 1 whorl of (3 or)4 tepals. Male flowers with 4-24 anthers; filaments united into a column; pistils inconspicuous. Female flowers with inconspicuous anthers; pistils (3 or)4; ovary superior, stipitate or not, ovoid-globose or tetragonal-terete, rarely obdeltoid, (3 or)4-loculed; placentation axile; ovules numerous, in many rows; style very short to obsolete; stigma disclike, (3 or)4-lobed. Capsule (3 or)4-valved, leathery or woody, loculicidally dehiscent. Seeds numerous, usually hairlike; embryo straight; endosperm fleshy.\r",
      "One genus and ca. 85 species: Africa (Madagascar), S and SE Asia, N Australia, Pacific Islands (Caroline Islands); one species in China.",
      "All species of the Nepenthaceae are carnivorous, so far as is known.Ruan Yun-zhen. 1984. Nepenthaceae. In: Fu Shu-hsia & Fu Kun-tsun, eds., Fl. Reipubl. Popularis Sin. 34(1): 11-14."
    ],
    "authors":"Lianli Lu, Martin Cheek & Matthew H. P. Jebb"
  },
  {
    "group_title":"Brassicaceae through Saxifragaceae",
    "family":"Resedaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10760",
    "knowledge_content":[
      "Herbs annual to perennial, rarely woody. Leaves alternate, entire to pinnatifid, with small, glandular stipules. Flowers bisexual, rarely unisexual, in terminal racemes or spikes. Sepals persistent, 4-7. Petals usually 4-7 or absent, entire or cleft, hypogynous or perigynous. Stamens 3-40, inserted on disc, exposed in bud; disc often eccentric; filaments free or connate at base; anthers 2-loculed. Carpels 2-6, free or united into a 1-loculed ovary; ovules numerous; placentation parietal or basal. Fruit a capsule or berrylike. Seeds numerous, reniform or suborbicular; endosperm almost absent; cotyledons curved.\r",
      "Six genera and ca. 80 species: Africa, C and SW Asia, Atlantic Islands, S Europe, SW North America, widely naturalized elsewhere; two genera (one introduced) and four species (three introduced) in China.",
      "Reseda chinensis Loureiro (Fl. Cochinch. 1: 299. 1790) and R. cochinchinensis Loureiro (loc. cit.) are both synonyms of Hypericum japonicum Thunberg (Clusiaceae) according to Merrill (Trans. Amer. Philos. Soc., n.s., 24(2): 267. 1935).Chen Wei-chiu. 1984. Resedaceae. In: Fu Shu-hsia & Fu Kun-tsun, eds., Fl. Reipubl. Popularis Sin. 34(1): 1-6."
    ],
    "authors":"Lianli Lu & Nicholas J. Turland"
  },
  {
    "group_title":"Brassicaceae through Saxifragaceae",
    "family":"Saxifragaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10800",
    "knowledge_content":[
      "Authors: Jin-tang Pan, Cuizhi Gu, Shumei Huang, Chao-fen Wei, Shu-ying Jin, Lingdi Lu, Shinobu Akiyama, Crinan Alexander, Bruce Bartholomew, James Cullen, Richard J. Gornall, Ulla-Maj Hultgård, Hideaki Ohba & Douglas E. Soltis",
      "Herbs or shrubs, rarely trees or vines. Leaves simple or compound, usually alternate or opposite, usually exstipulate. Flowers usually in cymes, panicles, or racemes, rarely solitary, usually bisexual, rarely unisexual, hypogynous or ± epigynous, rarely perigynous, usually biperianthial, rarely monochlamydeous, actinomorphic, rarely zygomorphic, 4- or 5(-10)-merous. Sepals sometimes petal-like. Petals usually free, sometimes absent. Stamens (4 or)5-10 or many; filaments free; anthers 2-loculed; staminodes often present. Carpels 2, rarely 3-5(-10), usually ± connate; ovary superior or semi-inferior to inferior, 2- or 3-5(-10)-loculed with axile placentation, or 1-loculed with parietal placentation, rarely with apical placentation; ovules usually many, 2- to many seriate, crassinucellate or tenuinucellate, sometimes with transitional forms; integument 1- or 2-seriate; styles free or ± connate. Fruit a capsule or berry, rarely a follicle or drupe. Seeds albuminous, rarely not so; albumen of cellular type, rarely of nuclear type; embryo small.\r",
      "About 80 genera and 1200 species: worldwide; 29 genera (two endemic), and 545 species (354 endemic, seven introduced) in China.",
      "During the past several years, cladistic analyses of morphological, chemical, and DNA data have made it clear that the recognition of the Saxifragaceae sensu lato (Engler, Nat. Pflanzenfam. 18a: 74-226. 1928) is untenable. Among the angiosperm families, Saxifragaceae sensu lato may in fact represent the most extreme example of a polyphyletic assemblage. For example, recent analyses of DNA sequence data indicate that these taxa represent at least ten separate evolutionary lines, many of which are only distantly related to one another (Morgan & Soltis, Ann. Missouri Bot. Gard. 80: 631-660. 1993; Soltis & Soltis, Amer. J. Bot. 84: 504-522. 1997). Furthermore, very large molecular phylogenetic analyses of hundreds of angiosperms indicate that these separate lineages are distributed among four of the six traditionally recognized subclasses of dicotyledons (Savolainen et al., Syst. Biol. 49: 306-362. 2000; Soltis et al., Nature 402: 402-404. 1999). These recent studies have also greatly clarified how this phylogenetically diverse assemblage should be divided into families and treated taxonomically (see The Angiosperm Phylogeny Group (APG), Ann. Missouri Bot. Gard. 85: 531-553. 1998). Recent studies of DNA sequence data have clarified both the circumscription and affinities of a narrowly defined Saxifragaceae (Saxifragaceae sensu stricto) and Hydrangeaceae (Soltis et al., Amer. J. Bot. 82: 504-514. 1995; Savolainen et al., loc. cit.; Soltis et al., loc. cit. 1999). Saxifragaceae sensu stricto should consist only of Saxifragoideae, a group of about 30 herbaceous genera. Members of Saxifragaceae sensu stricto from the Chinese flora include Astilbe, Astilboides, Bergenia, Chrysosplenium, Mitella, Mukdenia, Oresitrophe, Rodgersia, Saxifraga, Tanakaea, Tiarella, and the recently described Saniculiphyllum. Close relatives of Saxifragaceae sensu stricto include Itea, Penthorum, and Ribes. These genera, the sole members of Iteoideae, Penthoroideae, and Ribesioideae, respectively, are also best treated in separate families: Iteaceae, Penthoraceae, and Grossulariaceae (see APG, loc. cit.). These taxa, as well as several others, such as Crassulaceae, are basal to a large assemblage of taxa, most of which were traditionally placed in Rosidae. Sequence data also indicate that Parnassia (the sole member of the Parnassioideae) is a more derived member of the rosid alliance, most closely related to Brexia and Lepuropetalon (also part of Saxifragaceae sensu lato) and Celastraceae. Parnassia and Lepuropetalon should be placed in Parnassiaceae with Brexia part of an expanded Celastraceae (APG, loc. cit.).Both morphological and molecular data indicate that Hydrangeoideae and Escallonioideae are, in contrast, allied with taxa traditionally placed in Asteridae. Hydrangeoideae are a well-defined, monophyletic lineage that should be treated as Hydrangeaceae. In China they include Cardiandra, Decumaria, Deinanthe, Deutzia, Dichroa, Hydrangea, Kirengeshoma, Philadelphus, Pileostegia, Platycrater, and Schizophragma, and are closely allied with families such as Cornaceae, Loasaceae, and Nyssaceae. Escallonioideae appear to be polyphyletic, and this group of approximately 14 genera is in need of thorough study. Members of this subfamily are allied with several different lineages of higher asterids. Polyosma, the only member of Escallonioideae in China, appears closely allied with Caprifoliaceae (Xiang & Soltis in Boufford & Ohba, Sino-Japanese Flora: its Characteristics and Diversification, 1998).Nevertheless, in the present account, the Saxifragaceae are retained in the sense of FRPS, using the same sequence of genera and indicating the subfamilies in the key below, in order to facilitate comparison with that flora.The genus Changiodendron R. H. Miao (Acta Sci. Nat. Univ. Sunyatseni 34: 65. 1995) and its single species, C. guangxiense R. H. Miao (loc. cit.: 66), was described from Guangxi (Napo Xian) and stated to belong to the Iteaceae (i.e., Iteoideae). However, Peng (Acta Bot. Yunnan. 18: 299-300. 1996) demonstrated that C. guangxiense is a synonym of Sabia parviflora Wallich (Sabiaceae).Pan Jin-tang. 1992. Saxifragaceae (1) [Penthoroideae, Saxifragoideae]. In: Pan Jin-tang, ed., Fl. Reipubl. Popularis Sin. 34(2): 1-309; Hwang Shu-mei, Wei Chao-fen, Lu Ling-ti, Ku Tsue-chih & Jin Shu-ying. 1995. Saxifragaceae (2) [Parnassioideae, Hydrangeoideae, Escallonioideae, Iteoideae, Ribesioideae]. In: Lu Ling-ti & Hwang Shu-mei, eds., Fl. Reipubl. Popularis Sin. 35(1): 1-406.",
      "Stamens ca. 2 × as many as sepals, sometimes more; leaves usually opposite or verticillate, alternate or fascicled in Cardiandra (Hydrangeoideae).",
      "Leaves never lobed; stipules present, linear; sepals not petal-like; petals narrow; ovary 2-loculed; fruit a capsule (Iteoideae)",
      "Leaves often palmately lobed; stipules absent, spines or prickles sometimes present; sepals usually petal-like; petals usually scalelike; ovary 1-loculed; fruit a berry (Ribesioideae)",
      "Shrubs, scandent shrubs, or herbs; leaf blade not palmately lobed; stamens numerous or 2 × as many as petals.",
      "Filaments subulate, flat, apex 2-dentate or 2-lobed; shrubs; calyx lobes never enlarged and petaloid.",
      "Filaments linear, neither subulate nor flat; herbs or shrubs; calyx lobes sometimes enlarged and petaloid.",
      "Leaves not stellate hairy; petals 4; stamens 20-40; capsule 4-valved, loculicidally or septicidally dehiscent",
      "Inflorescences with both fertile and sterile flowers (except Schizophragma crassum); calyx lobes ± petaloid.",
      "Leaves opposite or verticillate; anthers oblong, ellipsoid, or subglobose, apex obtuse to subrounded, connective not dilated.",
      "Herbs perennial or subshrubs, with horizontal rhizomes; stem simple; petals imbricate in bud; styles 5, connate into a column",
      "Shrubs or subshrubs, sometimes scandent, rarely small trees; stems often branched; petals valvate in bud; styles 2-5, free or connate only at base",
      "Flower solitary; stamens 5, staminodes 5, conspicuous, spreading into a lamina, usually distally lobed, inserted opposite petals; ovary 1-loculed (Parnassioideae)",
      "Flowers usually in cymes, racemes, or panicles, sometimes solitary; stamens 4-14, staminodes absent; ovary 1-5-loculed.",
      "Leaves usually not membranous; inflorescence often not helicoid; stamens 4-14; ovary usually less than 5-loculed, rarely more (Saxifragoideae).",
      "Leaves usually compound, rarely simple; sepals 4 or 5, sometimes 1-3 or absent; carpels 2 or 3(or 4); ovary 2- or 3(or 4)-loculed with axile placentation or 1-loculed with marginal placentation.",
      "Leaves simple; petals 5(or 6) or absent; carpels 2(-5); ovary 2(-5)-loculed with axile placentation, or 1-loculed with marginal or parietal placentation, sometimes proximally with 2 terminal, parietal placentas and distally with marginal placentation.",
      "Leaves simple, leaf blade peltate, margin palmatilobed; petals 4 or 5; stamens (6-)8; carpels 2(-4), ovary 2(-4)-loculed",
      "Leaves usually compound (or, if simple, leaf blade not peltate), usually 3-5-lobed; petals 1-5 or absent; stamens (5-)8-10(-14); carpels 2 or 3, ovary 1-3-loculed.",
      "Leaves palmately, pinnately, or subpinnately compound; bract absent; sepals (4 or)5(-7); petals usually absent; stamens 10(-14); ovary 2- or 3-loculed with axile placentation",
      "Leaves ternately compound, rarely simple; bracts conspicuous; sepals (4 or)5; petals 1-5, sometimes more or absent; stamens (5-)8-10; ovary 2(or 3)-loculed with axile placentation or 1-loculed with marginal placentation",
      "Leaves all basal or both basal and cauline; bracts conspicuous; sepals 4 or 5(-7); petals 5 or absent; stamens 4-10.",
      "Leaf blade ovate to cordate, glandular hairy abaxially, glabrous adaxially, margin irregularly dentate; sepals 5-7, unequal, many veined; petals absent; stamens 10-14",
      "Leaves broadly ovate to orbicular, glabrous on both surfaces, margin palmately 5-7(-9)-cleft, lobes serrate; sepals 5 or 6, subequal, 1-veined; petals 5 or 6(or 7), white; stamens 5 or 6(or 7)",
      "Sepals 5; petals 5; stamens 10; ovary 2-loculed with axile placentation or 1-loculed with marginal placentation.",
      "Sepals 4 or 5(-7); petals 5 or absent; stamens 4-10; ovary usually 1-loculed with 2 parietal placentas, or proximally 2-loculed with axile placentation and distally 1-loculed with marginal placentation.",
      "Herbs perennial, rarely annual or biennial; inflorescence a cyme or flower solitary; flowers usually actinomorphic, rarely zygomorphic; receptacle cyathiform or saucer-shaped; fruit a capsule, rarely a follicle",
      "Herbs perennial; inflorescence a cyme; flowers actinomorphic; receptacle cyathiform; fruit a capsule.",
      "Leaves all basal, petiole short, broad, sheathing at base, leaf blade not peltate, margin entire or dentate; hypanthium scarcely adnate to ovary; petals white, red, or purple, margin entire; ovary subsuperior, proximally 2-loculed with axile placentation and distally 1-loculed with marginal placentation; seeds angular",
      "Leaves both basal and cauline, stipules membranous, leaf blade peltate, margin palmatilobed; hypanthium proximally adnate to ovary; petals yellowish, margin usually sparsely denticulate; ovary semi-inferior, 2-loculed with axile placentation; seeds tuberculate",
      "Leaves simple or trifoliolate; inflorescence terminal or axillary, racemose or paniculate; petals entire; stamens 10; fruit with 2 distinctly unequal carpels",
      "Leaves simple; inflorescence terminal, racemose; petals usually pinnatifid, rarely entire; stamens 5 or 10; fruit with 2 subequal carpels",
      "Cauline leaves alternate or opposite; inflorescence usually cymose; sepals 4(or 5); stamens 4-8(-10); ovary subsuperior or semi-inferior to subinferior",
      "Cauline leaves absent; inflorescence paniculate or racemose; sepals (4 or)5(-7); stamens 8-10; ovary subsuperior"
    ],
    "authors":"Jin-tang Pan, Cuizhi Gu, Shumei Huang, Chao-fen Wei, Shu-ying Jin, Lingdi Lu, Shinobu Akiyama, Crinan Alexander, Bruce Bartholomew, James Cullen, Richard J. Gornall, Ulla-Maj Hultgård, Hideaki Ohba & Douglas E. Soltis"
  },
  {
    "group_title":"Pittosporaceae through Connaraceae",
    "family":"Connaraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10214",
    "knowledge_content":[
      "Trees small, shrubs, or vines, erect or scandent, evergreen or deciduous. Leaves alternate, exstipulate, petiolate; leaf blade odd-pinnate, 3-foliolate, or 1-foliolate; leaflets subopposite or alternate, usually leathery, margin entire, rarely lobulate. Inflorescences terminal, pseudoterminal, or axillary, paniculate or racemose, bracteate. Flowers bisexual, rarely unisexual, actinomorphic, small. Sepals (4 or)5, free or united at very base only, imbricate or valvate, persistent and clasping base of fruit. Petals (4 or)5, free, rarely slightly connate at middle, imbricate or valvate, rarely circinate. Stamens 5–10, hypogynous or perigynous, in 2 whorls alternately longer and shorter, those opposite petals often shorter and abortive; filaments free or shortly connate at base; anthers didymous, dorsifixed in proximal 1\/2, introrse, short, dehiscing longitudinally. Disk thin or absent, surrounded by base of stamens. Carpels (1–) 5(–8), free, 1-celled, hirsute. Style subulate or filiform; stigma subcapitate, simple or 2-lobed. Ovules 2 in each carpel (1 sometimes sterile), collateral, erect. Fruit a usually solitary follicle, sessile or stipitate, dehiscing usually along adaxial suture, sometimes along abaxial one, very rarely circumscissile at base, sometimes indehiscent. Seed 1(or 2), erect, usually arillate, rarely exarillate; testa thick; aril colored, fleshy; endosperm present or absent; embryo straight; cotyledons thick and fleshy in exalbuminous seeds, thin in albuminous ones.\r",
      "Between 12 and 24 genera and 180–390 species: mainly in Africa and tropical Asia, some species in the subtropics, only a few species in the New World; six genera and nine species (one endemic) in China.",
      "Agelaea  Solander ex PlanchonCnestis  JussieuConnarus  LinnaeusEllipanthus  J. D. HookerRourea  AubletRoureopsis  Planchon"
    ],
    "authors":"Lingdi Lu & Nicholas J. Turland"
  },
  {
    "group_title":"Pittosporaceae through Connaraceae",
    "family":"Eucommiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10325",
    "knowledge_content":[
      "Trees deciduous, dioecious. Sapwood and bark containing latex. Buds ovoid; scales deciduous. Leaves alternate, spirally arranged, exstipulate, petiolate; leaf blade simple, usually elliptic, sometimes somewhat ovate, obovate, or oblong, containing latex (forming strands if blade is transversely broken and pulled apart), pinnately veined, base rounded or cuneate-rounded, margin densely serrate with gland-tipped teeth, apex abruptly narrowed into an acuminate tip. Flowers axillary, borne near base of current year’s branchlets, very shortly pedicellate, without perianth, wind pollinated. Male flowers clustered; stamens 5–12, linear; filaments very short; anthers basifixed, 4-locular, dehiscing by longitudinal slits; connective slightly prolonged. Female flowers solitary: ovary stipitate, composed of 2 connate carpels, 1-locular, elongate, compressed, glabrous, apex 2-lobed; stigmas 2, decurrent, reflexed-spreading; ovules 2, collateral, anatropous, 1 aborting. Fruit an indehiscent samara, long elliptic to narrowly oblong, compressed, winged around margin; wing gradually narrowed at base into stipe, shortly 2-lobed at apex with sinus stigmatic; pericarp thinly leathery. Seed 1, linear, compressed, rounded at both ends; testa membranous; endosperm copious; embryo erect, large; cotyledons compressed, fleshy.\r",
      "The taxonomic position of Eucommiaceae is controversial. It has been variously associated with Hamamelidales, Magnoliales, and Urticales, or placed in its own order, Eucommiales. Recent research suggests that it may belong to Garryales together with Garryaceae (including Aucubaceae) and, perhaps, Icacinaceae.",
      "Chang Hung-ta. 1979. Eucommiaceae. In: Chang Hung-ta, ed., Fl. Reipubl. Popularis Sin. 35(2): 116-118."
    ],
    "authors":"Zhi-Yun Zhang & Nicholas J. Turland"
  },
  {
    "group_title":"Pittosporaceae through Connaraceae",
    "family":"Hamamelidaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10396",
    "knowledge_content":[
      "Shrubs or trees, evergreen or deciduous, hermaphroditic, andromonoecious, or monoecious. Indumentum usually of stellate hairs or stellate or peltate scales. Buds perulate or naked. Leaves distichous or spiral, rarely subopposite or opposite, stipules minute to large, usually paired (solitary and enclosing bud in Mytilaria, and apparently absent in Rhodoleia); petiole usually well defined; leaf blade simple or palmately lobed, pinnately veined or palmately 3–5-veined. Inflorescences usually spikes or heads, rarely racemes or (condensed) thyrses or panicles, axillary or terminal. Flowers small to medium-sized, bracteate and often bracteolate, bisexual or unisexual, actinomorphic or rarely zygomorphic (Rhodoleia), hypogynous to epigynous, floral cup shallow to urn-shaped, sometimes absent; sepals 4 or 5(–10), sometimes absent, imbricate, usually persistent; petals absent or 4 or 5, yellow, white, greenish or red, often ribbonlike and circinate in bud, caducous; stamens 4, 5, or many, free, rarely arranged in 2 whorls with the inner whorl staminodal, development of polyandrous androecia centripetal or centrifugal; anthers basifixed, thecae mostly bisporangiate, each opening by two valves or a simple longitudinal slit, or monosporangiate and opening by a single valve (Exbucklandia, Hamamelis and the genera of the S hemisphere), connective protruding; disk scales sometimes present between stamens and carpels. Ovary 2-locular, carpels free at apex; ovules mostly 1 per carpel, less often many, but then most of them sterile, crassinucellar, bitegmic, anatropous, halfway between apotropous and epitropous, pendent from ovary top if solitary, along the carpellary margins if numerous; placentation axile. Styles and stigmas 2. Fruit a capsule, dehiscing septicidally, septifragally, or loculicidally and 4-valved; endocarp woody or leathery, usually loose from leathery exocarp. Seeds 1 to many per carpel; if solitary then seed coat thick, hard, smooth and shiny, black or brown; if numerous then sometimes winged and only a few viable. Endosperm thin; embryo straight; cotyledons leaflike, radicle short.\r",
      "About 30 genera and 140 species: E and S Africa (including Madagascar), E, W, and SE Asia, NE Australia, Central, North, and South America, Pacific Islands; 18 genera (four endemic) and 74 species (58 endemic) in China.",
      "Chang Hung-ta. 1979. Hamamelidaceae. In: Chang Hung-ta, ed., Fl. Reipubl. Popularis Sin. 35(2): 36–116.",
      "Ovules and seeds several to many per carpel; inflorescences capitate or spicate; leaves palmately veined, sometimes lobed (pinnately veined in Rhodoleia and Altingia).",
      "Ovules and seeds 1(–3) in each carpel (Corylopsis with 2 extra, abortive ovules in each carpel); inflorescences racemose, spicate or condensed thyrses or panicles; leaves pinnately veined, undivided.",
      "Stipules apparently absent; leaves pinnately veined, entire; petals spatulate to oblanceolate, red; inflorescence axillary, nodding, enclosed by conspicuous involucre of rounded bracts as long as flowers.",
      "Stipules present; leaves usually palmately veined, often acuminately lobed (pinnately veined and simple in Altingia); petals linear or absent; inflorescence terminal, not nodding, not enclosed by involucre.",
      "Stipules large, leaving each node with prominent annular scar; infructescences elongate or, if ± capitate, capsules clearly exserted.",
      "Stipules linear, leaving small discrete scars; infructescences globose, capsules not or only slightly exserted, or inflorescence 2-flowered.",
      "Leaf blade heteromorphic, undivided and basally 3-veined or palmately 3-lobed, base  cuneate; infructescence semiglobose with truncate base.",
      "Inflorescences capitate spikes, without terminal flowers, each flower with simple bract and without bracteoles, sepals present; capsules arranged spirally along main axis, sessile.",
      "Inflorescences condensed panicles or botryoids with terminal flowers, each flower with (often 3-parted)  bract and (none or)1 or 2 (3-parted or simple) bracteoles, sepals absent; capsules arranged mostly distichously along main axis, sometimes stalked.",
      "Anthers with 4 pollen sacs, dehiscing with 4 valves; flowers usually 4–5(–6)-merous; leaf  margin entire to sparsely serrulate.",
      "Flowers bisexual; petals well-developed, spatulate, staminodes often also present, floral  cup 1\/2 as long as capsule; capsules subsessile.",
      "Flowers mostly unisexual (bisexual flowers may also occur); petals scalelike or very reduced  to absent, staminodes absent in male flowers; floral cup obconical with ovary exserted or urceolate and enclosing ovary.",
      "Flowers pedicellate; petals scalelike, ovary semi-inferior; floral cup obconical, ovary exserted; fruit usually conspicuously lenticellate.",
      "Flowers sessile; petals lacking or present as tiny rudiments; ovary nearly superior;  floral cup urceolate, distinctly narrowed at mouth and concealing ovary; fruit not lenticellate."
    ],
    "authors":"Zhi-Yun Zhang, Hongda Zhang & Peter K. Endress"
  },
  {
    "group_title":"Pittosporaceae through Connaraceae",
    "family":"Pittosporaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10695",
    "knowledge_content":[
      "Trees or shrubs, evergreen, glabrous or pubescent, occasionally spiny. Leaves alternate, occasionally opposite, estipulate; leaf blade mostly leathery, margin entire, rarely dentate or lobed. Inflorescences umbellate, corymbose, paniculate, or a solitary flower, bracteate and bracteolate. Flowers usually bisexual, sometimes polygamous, actinomorphic, rarely zygomorphic, usually 5-merous (except ovary). Sepals usually free or slightly connate. Petals free or connate, white, yellow, blue, or red. Stamens opposite sepals; filament filiform; anther basifixed or dorsifixed, 2-loculed, dehiscing longitudinally or by pores. Ovary superior, of 2 or 3(–5) carpels, usually 1-loculed or incompletely 2–5-loculed; ovules numerous, anatropous; placentation parietal, axile, or basilar. Style short, simple or 2–5-lobed, persistent or deciduous. Fruit a capsule dehiscing by adaxial suture, or a berry. Seeds numerous; testa thin; endosperm well developed; embryo small.\r",
      "Nine genera and ca. 250 species: tropical and subtropical regions of Africa, Asia, Australia, and Pacific Islands, especially Australia; one genus and 46 species (33 endemic) in China.",
      "Chang Hung-ta & Yan Su-zhu. 1979. Pittosporaceae. In: Chang Hung-ta, ed., Fl. Reipubl. Popularis Sin. 35(2): 1–36."
    ],
    "authors":"Zhi-Yun Zhang & Nicholas J. Turland"
  },
  {
    "group_title":"Pittosporaceae through Connaraceae",
    "family":"Platanaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10703",
    "knowledge_content":[
      "Trees deciduous (rarely semi-evergreen), monoecious. Branches and leaves with branched or stellate tomentum; bark pale brown, gray, and\/or white, smooth, exfoliating in plates. Terminal buds absent; lateral buds ovoid, slightly acute at apex, enclosed by a separate scale at base of petiole. Leaves alternate; stipules basally surrounding stem, deciduous; petiole long, usually enclosing axillary bud at base; leaf blade simple, large, usually palmately lobed and subpalmately veined, margin coarsely dentate. Flowering branchlets leafy only at base, pendulous at least in fruit; inflorescences 1–5(–12), globose-capitate, male and female ones homomorphic, borne on separate branchlets. Male flowers: sepals 3–8, triangular, pubescent; petals as many as sepals, oblanceolate; stamens 3–8; filaments short; anther connective enlarging into a peltate scale. Female flowers: carpels 3–8, free; ovary long ovoid, 1-locular; ovules 1 or 2, anatropous; style elongate, persistent  and exserted from inflorescence. Infructescence a capitate or globose coenocarpium composed of numerous achenes. Achenes narrow and long obconical, 1-seeded, base usually with a tuft of villous hairs, apex with persistent style; style and hairs often exserted from infructescence. Seeds linear; endosperm thin; cotyledons heteromorphic.\r",
      "One genus and 8–11 species: Central and North America, SW Asia, SE Europe, one species in SE Asia (Laos and N Vietnam); widely cultivated elsewhere; three species (introduced) in China.",
      "Hoot et al. (Ann. Missouri Bot. Gard. 86: 1–32. 1999) treated Platanaceae and Proteaceae as well-supported sister taxa forming a less well supported clade with Nelumbonaceae.Chang Hung-ta. 1979. Platanaceae. In: Chang Hung-ta, ed., Fl. Reipubl. Popularis Sin. 35(2): 118–121."
    ],
    "authors":"Zhi-Yun Zhang & Nicholas J. Turland"
  },
  {
    "group_title":"Pittosporaceae through Connaraceae",
    "family":"Rosaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10776",
    "knowledge_content":[
      "Authors: Cuizhi Gu, Chaoluan Li, Lingdi Lu, Shunyuan Jiang, Crinan Alexander, Bruce Bartholomew, Anthony R. Brach, David E. Boufford, Hiroshi Ikeda, Hideaki Ohba, Kenneth R. Robertson & Steven A. Spongberg",
      "Trees, shrubs, or herbs, deciduous or evergreen. Stems erect, scandent, arching, prostrate, or creeping, armed or unarmed. Buds usually with several exposed scales, sometimes with only 2. Leaves alternate, rarely opposite, simple or compound; stipules paired, free or adnate to petiole, rarely absent, persistent or deciduous; petiole usually 2-glandular apically; leaf blade often serrate at margin, rarely entire. Inflorescences various, from single flowers to umbellate, corymbose, racemose or cymose-paniculate. Flowers usually actinomorphic, bisexual, rarely unisexual and then plants dioecious. Hypanthium (formed from basal parts of sepals, petals, and stamens) free from or adnate to ovary, short or elongate. Sepals usually 5, rarely fewer or more, imbricate; epicalyx segments sometimes also present. Petals as many as sepals, inserted below margin of disk, free, imbricate, sometimes absent. Disk lining hypanthium, usually entire, rarely lobed. Stamens usually numerous, rarely few, always in a complete ring at margin of or above disk; filaments usually free, very rarely connate; anthers small, didymous, rarely elongate, 2-locular. Carpels 1 to many, free, or ± connate and then adnate to inner surface of cupular receptacle; ovary inferior, semi-inferior, or superior; ovules usually 2 in each carpel, rarely 1 or several, anatropous, superposed. Styles as many as carpels, terminal, lateral, or basal, free or sometimes connate. Fruit a follicle, pome, achene, or drupe, rarely a capsule, naked or enclosed in persistent hypanthium and sometimes also by sepals. Seeds erect or pendulous, sometimes winged, usually exalbuminous, very rarely with thin endosperm; cotyledons mostly fleshy and convex abaxially, rarely folded or convolute.\r",
      "Between 95 and 125 genera and 2825-3500 species: cosmopolitan, mostly in N temperate zone; 55 genera (two endemic) and 950 species (546 endemic) in China.",
      "Many plants of this family are of economic importance and contribute to people’s livelihoods. The Rosaceae contain a great number of fruit trees of temperate regions. The fruits contain vitamins, acids, and sugars and can be used both raw and for making preserves, jam, jelly, candy, various drinks, wine, vinegar, etc. The dried fruits of the genera Amygdalus and Armeniaca are of high commercial value. Some plants in the genus Rosa containing essential oils or with a high vitamin content are used in industry. Rosaceae wood is used for making various articles, stems and roots are used for making tannin extract, and young leaves are used as a substitute for tea. Numerous species are used for medical purposes or are cultivated as ornamentals.Yü Te-tsun, Lu Ling-ti, Ku Tsue-chih, Li Chao-luan, Kuan Ke-chien & Chiang Wan-fu. 1974, 1985, 1986. Rosaceae. In: Yü Te-tsun, ed., Fl. Reipubl. Popularis Sin. 36: 1–443; 37: 1–516; 38: 1–133.\r",
      "The Rosaceae are very well represented in China, with great economic and scientific importance. The Co-chairs of the Editorial Committee (Wu\r",
      "and Raven) here note that the patterns of relationship are complex and the group is taxonomically difficult. We consider the following treatment to be\r",
      "relatively traditional, with some of the generic treatments arguably out of date. The same applies to the arrangement of the subfamilies, among which\r",
      "the Maloideae may be the most advanced and should therefore appear last. We regard this account, the first comprehensive, English-language treatment\r",
      "of the Rosaceae of China, as preliminary, but consider it a useful guide for the recognition of species. Significant revisions of various groups\r",
      "Ovary inferior or semi-inferior, rarely superior; carpels (1 or)2–5, ± adnate to inner side of cupular  receptacle; fruit a pome, sometimes berrylike, rarely small and drupaceous.",
      "Carpels usually numerous, rarely few; fruit an achene, rarely drupaceous; sepals persistent; leaves  compound, very rarely simple."
    ],
    "authors":"Cuizhi Gu, Chaoluan Li, Lingdi Lu, Shunyuan Jiang, Crinan Alexander, Bruce Bartholomew, Anthony R. Brach, David E. Boufford, Hiroshi Ikeda, Hideaki Ohba, Kenneth R. Robertson & Steven A. Spongberg"
  },
  {
    "group_title":"Fabaceae",
    "family":"Fabaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10335",
    "knowledge_content":[
      "Authors: Shugang Li, Langran Xu, Dezhao Chen, Xiangyun Zhu, Puhua Huang, Zhi Wei, Ren Sa, Prof. Dianxiang Zhang, Bojian Bao, Delin Wu, Hang Sun, Xinfen Gao, Supee S. Larsen, Ivan Nielsen, Dieter Podlech, Yingxin Liu, Hiroyoshi Ohashi, Zhaoyang Chang, Kai Larsen, Jianqiang Li, Stanley L. Welsh, Michael A. Vincent, Mingli Zhang, Michael G. Gilbert, Les Pedley, Brian D. Schrire, Gennady P. Yakovlev, Mats Thulin, Ivan C. Nielsen, Byoung-Hee Choi, Nicholas J. Turland, Roger M. Polhill, Supee Saksuwan Larsen, Ding Hou, Yu Iokawa, C. Melanie Wilmot-Dear, Gregory Kenicer, Tomoyuki Nemoto, J. Michael Lock, Alfonso Delgado Salinas, Tatiana E. Kramina, Anthony R. Brach, Bruce Bartholomew & Dmitry D. Sokoloff",
      "Trees, shrubs, or herbs, sometimes climbing or decumbent, very often bearing root-nodules that harbor nitrogen-fixing bacteria. Leaves alternate or rarely opposite, pinnate or bipinnate, less often palmately compound or 3-foliolate, seldom 1-foliolate or simple, or modified into narrow phyllodes; petiole present or absent; stipules and stipels present or absent, sometimes stipules developed into spines. Flowers bisexual, rarely unisexual, actinomorphic (Mimosoideae), ± zygomorphic (Caesalpinioideae) to very zygomorphic (Papilionoideae), mostly in racemes, corymbs, spikes, heads, or panicles. Sepals (3-)5(or 6), free or connate into a tube, sometimes bilabiate, rarely reduced or obsolete. Petals (0-)5(or 6), usually isomerous with sepals, seldom fewer or none, imbricate or valvate, distinct and often highly differentiated into papilionaceous corolla: upper petal (standard) outermost, 2 lateral petals (wings) ± parallel with each other, lower 2 innermost petals usually connate by their lower margins and forming a keel. Stamens mostly 10, sometimes fewer or more numerous, distinct or often connate by their filaments to form a closed or open sheath, monadelphous or diadelphous, anther 2-locular, opening lengthwise or by pores, uniform or dimorphic and then alternately basifixed and dorsifixed; pollen simple or compound. Gynoecium nearly always of a solitary carpel (rarely 2 or more distinct carpels); ovary superior, 1-locular or sometimes transversely, rarely longitudinally septate; ovules 1 to numerous, inserted on adaxial suture. Legumes dehiscent by one or both sutures, or indehiscent, sometimes winged, sometimes jointed and breaking up into 1-seeded segments. Seeds without or with very scanty endosperm, sometimes strophiolate.\r",
      "About 650 genera and ca. 18,000 species: distributed worldwide, woody genera mostly in the S Hemisphere and the tropics, herbaceous genera mostly in temperate regions, very numerous in Mediterranean-climate areas; 29 tribes (three or four introduced), 167 genera (one endemic, 32 or 33 introduced), and 1,673 species (690 endemic, 131-134 introduced) in China.",
      "Wu Te-lin, Chen Pang-yu, Wei Chao-fen, Chen Te-chao, Hu Chia-chi, Cheng Hsi-chang & Li Lin-chu. 1988. Leguminosae (1). In: Chen Te-chao, ed., Fl. Reipubl. Popularis Sin. 39: 1-233; Chen Techao, Chen Pangyu, Fang Yunyi, Zheng Chaozong, Chang Rohwei, Ding Chensen, Li Jiaolan, Ma Chiyun & Wei Zhi. 1994. Leguminosae (2). In: Wei Zhi, ed., Fl. Reipubl. Popularis Sin. 40: 1-362; Yang Yenchin, Huang Puhua, Fu Peiyun, Li Jiyun, Chen Youan, Lee Shukang, Chang Benneng, Wei Yuetsung, Huang Deai, Wei Chaofen, Wu Telin & Wei Siqi. 1995. Leguminosae (3). In: Lee Shukang, ed., Fl. Reipubl. Popularis Sin. 41: 1-405; Fu Kuntsun, Chang Chenwan, He Shanbow, Ho Yechi, Ding Chensen, Liou Yingxen & Li Peichun. 1993. Leguminosae (4). In: Fu Kuntsun, ed., Fl. Reipubl. Popularis Sin. 42(1): 1-384; Zhang Zhenwan, Xu Langran, Wei Zhi, Wei Siqi, Huang Yizhi, Xia Zhendai, Cui Hongbin, Li Peiqiong, Li Jiaolan, Yang Chunyu, Wen Hequn & Huang Deai. 1998. Leguminosae (5). In: Cui Hongbin, ed., Fl. Reipubl. Popularis Sin. 42(2): 1-467.",
      "Flowers actinomorphic, petals valvate in bud, free or united; anthers sometimes with a deciduous gland at apex (subfam. Mimosoideae)",
      "Flowers slightly zygomorphic; corolla not papilionaceous, uppermost petal overlapped on each side by adjacent lateral petals (when these present); stamens with usually free filaments (subfam. Caesalpinioideae)",
      "Flowers strongly zygomorphic (very rarely actinomorphic); corolla papilionaceous, standard outside wings, keel basally connate; stamens diadelphous (9+1) or monadelphous, rarely free (subfam. Papilionoideae [Faboideae])",
      "Filaments partly or almost wholly united to one another, either monadelphous in a closed tube, or diadelphous, in latter case vexillary (adaxial) filament often free or partly free from remainder, anthers uniform or dimorphic",
      "Leaves imparipinnate (simple leaf only in Bowringia callicarpa and Ormosia simplicifolia); stipules small or absent, stipels present or absent; calyx usually subequally 5-dentate; trees, shrubs, or vines, rarely herbs.",
      "Leaves palmately 3-foliolate (rarely 1-foliolate in Ammopiptanthus mongolicus); stipules usually united with petioles or amplexicaul, stipels absent; calyx usually deeply 5-lobed; shrubs or herbs.",
      "Anthers dimorphic, alternately dorsifixed and basifixed, either all equal or alternately longer and shorter",
      "Anthers uniform in size and shape or nearly so, or 5 sterile (Teramnus), not alternately basifixed and dorsifixed, also not alternately longer and shorter",
      "Legumes transversely septate and breaking up into 1-seeded joints (sometimes fruit reduced to 1 joint or maturing underground, subtorulose, but not jointed).",
      "Keel petals often obliquely truncate at apex; wings short or very small, rarely equaling keel petals.",
      "Stamens monadelphous and filaments partly connate into a single ± closed tube, sometimes adaxial filament free at base but connate higher up with remainder",
      "Stamens diadelphous, mostly vexillary filament free or partly adnate to remainder, or if monadelphous then free at upper part or top",
      "Leaves pinnately or digitately 3-foliolate, sometimes 1-foliolate (Tadehagi, Alysicarpus) or primitively simple (Indigofera)",
      "Stamens 10; flowers solitary, fasciculate or racemose in leaf axils; claw of standard free from staminal sheath."
    ],
    "authors":"Shugang Li, Langran Xu, Dezhao Chen, Xiangyun Zhu, Puhua Huang, Zhi Wei, Ren Sa, Prof. Dianxiang Zhang, Bojian Bao, Delin Wu, Hang Sun, Xinfen Gao, Supee S. Larsen, Ivan Nielsen, Dieter Podlech, Yingxin Liu, Hiroyoshi Ohashi, Zhaoyang Chang, Kai Larsen, Jianqiang Li, Stanley L. Welsh, Michael A. Vincent, Mingli Zhang, Michael G. Gilbert, Les Pedley, Brian D. Schrire, Gennady P. Yakovlev, Mats Thulin, Ivan C. Nielsen, Byoung-Hee Choi, Nicholas J. Turland, Roger M. Polhill, Supee Saksuwan Larsen, Ding Hou, Yu Iokawa, C. Melanie Wilmot-Dear, Gregory Kenicer, Tomoyuki Nemoto, J. Michael Lock, Alfonso Delgado Salinas, Tatiana E. Kramina, Anthony R. Brach, Bruce Bartholomew & Dmitry D. Sokoloff"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Aceraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10005",
    "knowledge_content":[
      "Trees, sometimes shrubs, deciduous or evergreen, andromonoecious, androdioecious, or dioecious (correct from a morphological view; flowers are functionally male or female). Winter buds imbricate or valvate. Leaves opposite, mostly simple and palmately lobed, sometimes leaves pinnately veined and entire or pinnately (7-)11-21-foliolate (Dipteronia), usually estipulate. Inflorescence a corymb, umbel, raceme, or panicle, terminal or lateral. Flowers bisexual (but functionally female) or unisexual, actinomorphic. Sepals (4 or)5, rarely 6, distinct or seldom connate below. Petals (4 or)5, rarely 6, imbricate, distinct, often as sepals, rarely absent. Stamens usually 8, sometimes 4-6 or 10-12; disk extrastaminal, amphistaminal, intrastaminal, or absent. Ovary superior, compressed, usually 2-loculed, with 2 ovules per locule; style usually bifurcate, forming 2 stigmas. Fruit a winged schizocarp, usually a double samara, usually 1-seeded, endosperm absent. Germination epigeous, rarely hypogeous. x = 9 or 13.\r",
      "Two genera and ca. 131 species: the genus Acer is widespread in N temperate and some tropical regions; the genus Dipteronia is endemic to China; two genera (one endemic) and 101 species (63 endemic, three introduced) in China.",
      "The Aceraceae are well represented in E Asia, especially in China. They are sometimes treated within the Sapindaceae; see the discussion under that family (Fl. China 12: 5. 2007).Fang Wen-pei. 1981. Aceraceae. In: Fang Wen-pei, ed., Fl. Reipubl. Popularis Sin. 46: 66-273.",
      "Samara with an elongated wing only on one side; leaves simple or if pinnate not more than 7 leaflets."
    ],
    "authors":"Tingzhi Xu, Yousheng Chen, Piet C. de Jong, Herman John Oterdoom & Chin-Sung Chang"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Anacardiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10038",
    "knowledge_content":[
      "Trees or shrubs, also woody climbers or perennial herbs, resiniferous secretory ducts in bark and foliage, plants turpentine-smelling, blackening when wounded, hermaphroditic, polygamo-dioecious or dioecious. Leaves often clustered distally, alternate, exstipulate, simple, trifoliolate or imparipinnate. Inflorescences terminal or axillary thyrsoids or panicles; floral subtending bracts small, or sometimes large, membranous and fused to pedicel (Dobinea). Flowers small, actinomorphic, 3-5-merous, bisexual to unisexual; receptacle sometimes elongate and barrel-shaped (Mangifera). Perianth usually double (single in Pistacia or lacking in female flowers in Dobinea); sepals fused basally and lobed (bractlike in Pistacia), imbricate or valvate in bud, caducous or persistent. Petals free or adnate basally to extended receptacle, imbricate or valvate, deciduous to persistent. Stamens in 1 or 2 whorls, 1 (Anacardium, Mangifera), several, or all fertile; filaments slender, sometimes connate basally (Anacardium); anthers ovoid or oblong, introrse, dorsi- or basifixed, longitudinally dehiscent, 2-celled with 4 pollen sacs. Disk usually distinct, intrastaminal to extrastaminal, fleshy, crenulate, stipe-shaped or 5-10-notched, round, flattened or subcupular. Ovary superior, sometimes half inferior or inferior (Pegia and Semecarpus), either (a) 1-carpellate and 1-locular, (b) syncarpous and 2-5-locular (rarely more), (c) 4-6-carpellate and apocarpous (Buchanania), or (d) 5-carpellate and incompletely connate (Dracontomelon); stigmas 1-5 (rarely more), ± distinct, each locule with one apotropous ovule, usually with one carpel developing to maturity. Fruit drupaceous or dry and indehiscent (Dobinea), sometimes borne on enlarged fleshy hypocarp formed by pedicel and receptacle (Anacardium and Semecarpus) or fused to membranous accrescent floral subtending bract (Dobinea), composed of 1-5, rarely more, cells, each containing 1 seed; epicarp thin; mesocarp usually fleshy, fibrous and resinous; endocarp crustaceous to bony.\r",
      "About 77 genera and 600 species: mainly in tropical, subtropical, and temperate areas, with the center of diversity in the Malesian region; 17 genera (one introduced) and 55 species (18 endemic, two introduced) in China.",
      "Both of the families Pistaciaceae and Podoaceae (with Dobinea) have been included here in the Anacardiaceae based on the molecular studies conducted by Pell (Molecular Systematics of the Cashew Family [Anacardiaceae]. Ph.D. Dissertation, Dept. of Biological Sciences, Louisiana State University. 2004). The two families are separated mainly based on their aberrant reductions in the perianth. The molecular trees clearly show that they are both nested within the Anacardiaceae. In accordance with figs. 3-10 (pp. 66-75) in Pells’s dissertation (loc. cit.) and current taxonomy, we have included Pistacia in the Rhoeae and Dobinea in a tribe of its own, the Dobineeae.Some species of Dobinea, Pistacia, Rhus, and Toxicodendron reach altitudes above 2000 m in Guangxi, Guizhou, and Yunnan.Several representatives for the family are economically important, delivering products such as fruits and nuts, timber, lacquers, and tannins. In China, the resinous sap of Toxicodendron vernicifluum and T. succedaneum is called Chinese lacquer. Rhus chinensis is the host plant of the aphid Melaphis chinensis that produces the \"Chinese gall,\" which in turn is a rich source of gallic acid. Anacardium occidentale and Mangifera indica are widely cultivated as fruit trees, and Pistacia chinensis yields a natural yellow dye. Several plants have ornamental value, such as Cotinus coggygria var. cinerea, which produces spectacular red leaves in the autumn.The resinous sap of Anacardiaceae hardens and turns black when exposed to the air. Some species in the family, especially of Toxicodendron and Semecarpus, can cause severe dermatitis after contact, especially in persons who have been sensitized by long-term exposure to the plants.Ming Tien lu. 1980. Anacardiaceae. In: Cheng Mien & Ming Tien lu, eds., Fl. Reipubl. Popularis Sin. 45(1): 66-135.",
      "Flower unisexual; female flower subtended by large foliose, membranous bract to which pedicel is adnate, without perianth and stamens (Dobinea)",
      "Flower bisexual or polygamous; female flower not subtended by foliose bract, with perianth and stamens",
      "Carpels free, 4-6 or usually only 1 developed; leaves simple, entire (Anacardium, Buchanania, Mangifera)",
      "Carpels 4 or 5, ovary (1 or)4- or 5-locular (Choerospondias, Dracontomelon, Haplospondias, Lannea, Pegia, Spondias)",
      "Leaves pinnately compound, trifoliolate or simple; ovary superior; receptacle not inflated at maturity (Cotinus, Pistacia, Rhus, Terminthia, Toxicodendron)",
      "Leaves simple; ovary semi-inferior or inferior; fruit buried in inflated receptacle at maturity (Drimycarpus, Semecarpus)"
    ],
    "authors":"Tianlu Min & Anders Barfod"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Aquifoliaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10055",
    "knowledge_content":[
      "Trees or shrubs, evergreen or deciduous. Leaves alternate, rarely opposite; leaf blade leathery, papery, or membranous, margin entire, serrate, or spinose; stipules minute, persistent or caducous, scar callose; petiole present, rarely absent. Inflorescence a cyme usually of order 1, 2, or 3(-5), respectively composed of a maximum of 1, 3, or 7(-31) developed flowers, axillary, solitary on current year’s branchlets or fasciculate on second year’s branchlets. Plants dioecious. Flowers hypogynous, regular, small, unisexual, by stamens or ovary abortive, 4-6(-23)-merous; calyx persistent; corolla often white or cream, rarely green, yellow, pink, or red; petals imbricate, mostly connate at base up to half of their length. Male flowers: calyx 4-8-lobed; petals 4-8; stamens isomerous, alternating with petals, epipetalous; anthers oblong-ovoid, introrse, longitudinally dehiscent; rudimentary ovary subglobose or pulvinate, rostrate. Female flowers: calyx 4-8-lobed; petals 4-8; staminodes sagittate or cordate, isomerous, alternating with petals, epipetalous; ovary superior, ovoid, 4-8(-10)-loculed, rarely pubescent; style rarely developed; stigma capitate, discoid, or columnar. Fruit a drupe, red, brown, or black (or green in Ilex chapaensis), usually globose; exocarp membranous or papery; mesocarp fleshy. Pyrenes (1-)4-6(-23); endocarp smooth, leathery, woody, or stony, striate, striate-sulcate, or rugose, and\/or pitted.\r",
      "One genus and 500-600 species: tropical and subtropical to temperate regions of both the N and S Hemispheres, mainly in the tropical regions of Central and South America and Asia; 204 species (149 endemic) in China, distributed in regions south of the Chang Jiang and Qinling Mountains, mainly in S and SW China.",
      "Chen Shukun & Feng Yuxing. 1999. Aquifoliaceae. In: Chen Shukun, ed., Fl. Reipubl. Popularis Sin. 45(2): ii-ix, 1-296.Ilex emarginata Thunberg (in Murray, Syst. Veg., ed. 14, 168. 1784) is the basionym of Eurya emarginata (Thunberg) Makino in the Theaceae (see Fl. China 12: 460. 2007).Ilex kingiana Cockerell (Torreya 11: 264. 1911) is a synonym of I. insignis J. D. Hooker (1875), not Heer (1869), but the occurrence of this species in China (Yunnan, 1933, Comber) requires confirmation.Ilex leiboensis Z. M. Tan (Bull. Bot. Res., Harbin 8(1): 117. 1988) and I. serrata Thunberg subsp. cathayensis T. R. Dudley (Holly Soc. J. 9(4): 5. 1991) are synonyms of Celastrus hirsutus H. F. Comber in the Celastraceae (see p. 472).Ilex nokoensis Hayata (J. Coll. Sci. Imp. Univ. Tokyo 30(1): 56. 1911) is the basionym of Symplocos nokoensis (Hayata) Kanehira in the Symplocaceae (see Fl. China 15: 244. 1996).Ilex racemosa Oliver is the basionym of Perrottetia racemosa (Oliver) Loesener in the Dipentodontaceae (see p. 495).Ilex rarasanensis Sasaki (Trans. Nat. Hist. Soc. Formosa 21: 154. 1931), described from Taiwan, could not be treated here because we did not see the type material."
    ],
    "authors":"Shu-kun Chen, Haiying Ma, Yuxing Feng, Gabrielle Barriera & Pierre-André Loizeau"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Biebersteiniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20048",
    "knowledge_content":[
      "Perennial herbs with woody, occasionally tuberous rhizomes. Stems erect or plants nearly stemless, suffruticose. Indumentum of simple or stipitate glandular capitate trichomes. Leaves cauline or all nearly basal, alternate, stipulate; leaf blade 1-3-pinnatisect. Flowers bisexual, 5-merous, actinomorphic, 2-bracteolate in paniculate, spicate, or pseudocapitate inflorescences. Sepals free, persistent, occasionally accrescent in fruit. Petals free, alternating with 5 extrastaminal nectary glands, yellow to reddish yellow, rarely white, often denticulate at apex. Stamens 10; filaments connate at base; anthers tetrasporangiate, introrse. Gynoecium of 5 carpels; ovary superior, deeply lobed with 5 free gynobasic stylodia connected above into a capitate stigma; ovules pendulous, anacampylotropous, unitegmic, crassinucellate. Fruit a schizocarp, consisting of 5 indehiscent 1-seeded dry mericarps. Seeds large with rounded raphe; embryo slightly curved, with scanty endosperm.\r",
      "One genus and four species: montane, semiarid, or occasionally forested regions from Greece to central China; two species (one endemic) in China.",
      "Biebersteinia had traditionally been placed in the Geraniaceae, but there is now ample, mainly molecular, evidence that it comprises a separate family in the Sapindales. Muellner et al. (Pl. Syst. Evol. 266: 233-252. 2007) also traced the ancestral origin of this family to China.Xu Langran & Huang Chengchiu. 1998. Biebersteinia. In: Xu Langran & Huang Chengchiu, eds., Fl. Reipubl. Popularis Sin. 43(1): 86-89."
    ],
    "authors":"Langran Xu & Dionyssios D. Vassiliades"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Burseraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10134",
    "knowledge_content":[
      "Trees or shrubs, resiniferous. Leaves alternate or rarely opposite, odd-pinnate, 3-foliolate (or rarely 1-foliolate), stipulate or exstipulate. Inflorescence racemose or paniculate. Flowers regular, small, unisexual or bisexual, often polygamous. Calyx 3-6-lobed, imbricate or valvate. Petals 3-6, free or rarely connate, imbricate or valvate. Disk annular or cupular, usually conspicuous. Stamens as many as or 2 × as many as petals, inserted at base or margin of disk, equal or unequal; filaments free, rarely connate at base; anthers dorsifixed or rarely adnate, 2-thecate, dehiscing longitudinally. Ovary superior, usually 2-5-celled; ovules 2 or rarely 1 in each cell, usually anatropous, axile, pendulous or rarely ascending, micropyle superior, raphe adaxial; style simple; stigma undivided or 2-5-lobed. Fruit drupaceous, indehiscent, containing 2-5 pyrenes, or rarely pseudocapsular and dehiscent. Seeds solitary, exalbuminous; testa membranous; cotyledons usually membranous, contortuplicate, rarely fleshy and planoconvex; radicle superior.\r",
      "About 16 genera and 550 species: tropical regions of both hemispheres; three genera and 13 species (two endemic) in China.",
      "Trees evergreen; flowers 3-merous; fruit with only 1 pyrene; leaflets with margin entire or almost so; branchlet pith usually with vascular strands.",
      "Trees often deciduous; flowers 4- or 5-merous; fruit with 1 or more pyrenes; leaflets with margin usually serrate; branchlet pith without vascular strands",
      "Stipules and stipels absent; flowers usually unisexual; disk usually annular; sepals, petals, and stamens inserted outside of disk.",
      "Stipules and stipels usually present; flowers usually bisexual; disk cupular; sepals, petals, and stamens inserted at edge of disk."
    ],
    "authors":"Hua Peng & Mats Thulin"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Buxaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10136",
    "knowledge_content":[
      "Shrubs, small trees, rarely subshrubs or perennial herbs, evergreen, monoecious or rarely dioecious. Leaves simple, alternate or opposite, exstipulate, margin entire or dentate, venation pinnate or triplinerved. Inflorescences axillary or terminal, racemose or densely spicate, bracteate. Flowers small, regular, unisexual. Male flowers: tepals 4-6 or rarely absent; stamens 4, 6-8, or numerous; central pistillode present or lacking. Female flowers: tepals 5 or 6 or several; carpels 2 or 3; ovary superior, 2- or 3-locular; styles 2 or 3, free, persistent; stigma broadly recurved; interstylar nectaries present or lacking; ovules 2 per locule, pendent, anatropous, bitegmic, crassinucellar; micropyle formed by inner integument or by both integuments. Fruit a loculicidal dry capsule or a fleshy berry. Seeds black, shining; endosperm fleshy; embryo erect; cotyledons thin or plump.\r",
      "Four or five genera and ca. 70 species: Africa, America, Asia, Europe; three genera and 28 species (21 endemic) in China.",
      "Based on recent molecular data, the South American genus Styloceras Kunth ex A. Jussieu is included within the Buxaceae, and the African Notobuxus Oliver is included within Buxus.Cheng Mien. 1980. Buxaceae. In: Cheng Mien & Ming Tien lu, eds., Fl. Reipubl. Popularis Sin. 45(1): 16-60.",
      "Leaves opposite, margin entire, venation pinnate; female flower solitary, apical on inflorescence; fruit a loculicidal capsule.",
      "Leaves alternate, usually triplinerved; female flower in basal part of inflorescence; fruit a berry, ± fleshy"
    ],
    "authors":"Tianlu Min & Paul Brückner"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Callitrichaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10143",
    "knowledge_content":[
      "Submersed, amphibious, or terrestrial herbs, rooted at nodes when terrestrial or at plant base when aquatic; stem slender. Leaves opposite, decussate, exstipulate, linear or spatulate, notched at apex, entire or very rarely toothed, somewhat congested toward apex of stems reaching water surface, to form a rosette; leaf bases often joined by a ridge of tissue extending across node, always with a midvein, often with a series of secondary veins anastomosing or looped and interconnected; scales (often described as glandular) on stems, leaves, and in leaf axils, with a short stalk and those on stem and leaves with a disk of radiating cells, those in leaf axils fan-shaped. Plants monoecious, or rarely dioecious. Flowers imperfect, minute, axillary, carpellate and staminate sometimes in same axil in various combinations; perianth absent; a subtending pair of bracts present in some species; carpellate flowers bicarpellate, often abaxial to staminate flower, stigmas 2, erect or reflexed, papillate; staminate flowers solitary, filament short or long, anther dehiscing laterally by longitudinal slits; pollen spheroidal, angular, or elongate, with 1 or more leptomata, exine intectate [or absent], sculpturing of pointed or rounded microgemmae or these absent. Fruits schizocarps, separating into 4 nutlets; nutlets dry, winged or not, wings from inner fruit layer.\r",
      "Ming Tien lu. 1980. Callitrichaceae. In: Cheng Mien & Ming Tien lu, eds., Fl. Reipubl. Popularis Sin. 45(1): 11-14."
    ],
    "authors":"Tianlu Min & Richard V. Lansdown"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Cardiopteridaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10160",
    "knowledge_content":[
      "Herbs climbing, with abundant milky juice. Leaves spirally arranged, estipulate. Cymes axillary, branched, ± scorpioid, ebracteate. Flowers very small. Sepals (4 or)5, coherent at base. Petals (4 or)5, coherent at base. Stamens (4 or)5, epipetalous. Disk absent. Ovary superior, 1-loculed, apically with 2 pendulous ovules; styles 2, dissimilar, 1 longer and thicker, cylindric or subclavate, persistent on fruit, other style shorter and thinner, with capitate stigma. Fruit a 2-winged samara, indehiscent, flat, 2-seeded; embryo minute, in fleshy endosperm.\r"
    ],
    "authors":"Hua Peng & Richard A. Howard"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Celastraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10170",
    "knowledge_content":[
      "Trees, erect or scandent shrubs, lianas, evergreen or deciduous; stems sometimes producing rootlets (Euonymus spp.), sometimes thorny (Maytenus spp.), rarely with buttressed trunks. Leaves simple, alternate or opposite, petiolate; leaf blade laminar, venation pinnate, secondary veins reticulate, margins entire, crenate, serrate, or dentate; stipules small and caducous, or estipulate. Inflorescences axillary or terminal, few to many flowered, cymose, thyrsoid, racemose, fasciculate, or flowers solitary, rarely paniculate. Flowers actinomorphic, bisexual or unisexual; perianth (3 or)4- or 5-merous; sepals and petals free. Disk intrastaminal, stamens on disk, or extrastaminal, annular, margins upturned, pulvinate, or cupular, conspicuous, rarely obscure (Microtropis spp.), entire, lobed, or angular. Stamens 3-5, alternate with petals; anther (1 or)2-celled, basifixed to dorsifixed, dehiscing longitudinally or obliquely, introrse, extrorse, or latrorse. Ovaries 3-5, superior to half-inferior, often partially immersed in disk, completely or incompletely 2-5-locular, placentation axile, ovules erect, axile, or pendulous, ovules (1 or)2(or 3 or more) per locule; style terminal, simple, short to absent; stigma simple or lobed. Fruit a loculicidally dehiscent capsule, schizocarp of 2-5 indehiscent mericarps, drupe, berry, or samara with a single surrounding wing, rarely an indehiscent capsule or nut with lateral style, pericarp bony, leathery, chartaceous, or fleshy, capsules smooth, angular, deeply lobed, transversely flattened and lobed to base, or connate, rarely prickly, laterally winged. Seeds 1-12, smooth or occasionally furrowed, albuminous or exalbuminous, sometimes winged, wing membranous, basal, exarillate or aril basal to completely enveloping seed, aril membranous, fleshy, rarely mucilaginous; cotyledons flat, foliaceous or thick, connate, germination epigeous. 2n = 8, 12, 14.\r",
      "About 97 genera and 1194 species: mainly in the tropics and subtropics, some in temperate regions; 14 genera (one endemic, one introduced) and 192 species (120 endemic, two introduced) in China.",
      "Some species are used as ornamentals (Celastrus, Euonymus, and Tripterygium) and\/or medicines, including traditional Chinese medicines (Celastrus, Euonymus, Maytenus, and Tripterygium).Plagiopteron Griffith is treated in this volume as a separate family, the Plagiopteraceae; see the comments under that family (p. 493). Dipentodon Dunn and Perrottetia Kunth are also treated in this volume (pp. 494-495) as comprising a separate family, the Dipentodontaceae, following Zhang and Simmons (Syst. Bot. 31: 122-137. 2006). On the other hand, Bhesa is included here in the Celastraceae, although Zhang and Simmons (loc. cit.) found that it belongs in the Malpighiales, where it comprises a separate lineage sister to the W African Centroplacus. Hippocrateaceae (Loeseneriella, Pristimera, and Salacia) are included here in the Celastraceae following Simmons et al. (Amer. J. Bot. 88: 313-325. 2001).Pao Shih-ying. 1981. Hippocrateaceae. In: Fang Wen-pei, ed., Fl. Reipubl. Popularis Sin. 46: 1-14; Cheng Chingyung, Ma Jinshuang, Huang Puhua, Kao Tsoching, Ma Qisheng. 1999. Celastraceae (excluding Dipentodon and Perrottetia). In: Cheng Chingyung & Huang Puhua, eds., Fl. Reipubl. Popularis Sin. 45(3): ii-x, 1-218.",
      "Disk extrastaminal; flowers bisexual; fruit baccate with seeds surrounded by mucilaginous arils or capsules transversely flattened, 1-3-fascicled",
      "Disk intrastaminal or stamens on disk; flowers unisexual or bisexual; fruit capsular, drupaceous, samaroid, or baccate",
      "Sepals and petals 4- or 5-merous, ovaries only 2- or 3-merous; disk lobed or nearly nonexistent; seeds typically arillate, sometimes aril absent",
      "Leaves alternate, stipulate; stipules long and fimbriate, persistent after blooming; petals persistent during fruiting, enlarging into 4 wings.",
      "Flowers and fruit 4- or 5-merous; disk flat, not circling ovary; ovules 2-12 per locule; fruit axis splitting with valves when fruit dehisces; seeds 2 or more per cell, attached to top or base at inner angle; raphe not branched.",
      "Flowers and fruit 4-merous only; disk lobes suberect, circling ovary; ovule 1 per locule; fruit axis splitting or not, free from valves when fruit dehisces; seeds only 1 per cell, hanging from top of persistent axis; raphe branch usually at base of seed, bands ascending on other side toward hilum.",
      "Leaf blade veins irregular in sparse nets, petiole erect, not enlarged; aril fleshy, reddish, yellow, or white",
      "Typically scandent shrubs; carpels usually 3 in separate locules; stigma 3, each dividing, similar to 6 lobes; aril completely covering seeds.",
      "Typically erect small trees or shrubs; carpels 2 or 3 in 2 or 3 locules; stigma 2 or 3, slightly lobed; seeds only basally or lower half covered by arils",
      "Plants usually thorny; twigs thornlike, bearing leaves and flowers, or twigs with needlelike thorns; leaf blade small, usually shorter than 7 cm.",
      "Twigs usually unarmed or few thorned, old branches often with sturdy thorns; leaf blade large, usually 7-25 cm."
    ],
    "authors":"Jin-shuang Ma, Zhixiang Zhang, Quanru Liu, Hua Peng & Michele Funston"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Cneoraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10205",
    "knowledge_content":[
      "Shrubs (sometimes scrambling or rarely somewhat climbing) or rarely small trees, monoclinous or andromonoecious, armed or unarmed, apparently without oil glands. Stipules absent. Leaves alternate, simple, odd-pinnate, or digitately trifoliolate; blades of simple leaves entire at margin, those of compound leaves crenulate, crenate, lobulate, or rarely entire at margin. Flowers solitary and axillary or in terminal and\/or axillary cymes, racemes, or rarely thyrses, actinomorphic, hypogynous, 3-5(or 6)-merous. Sepals distinct or connate to ± half their length. Petals distinct, imbricate or narrowly so in bud. Stamens equal to or 2 × as many as petals, inserted in lateral pits on disk or at base of disk; filaments distinct, linear, with or without adaxial ligulate appendage at base; anthers longitudinally dehiscent. Disk within androecium, nectariferous, columnar to barrel-shaped or pulvinate to cup-shaped. Gynoecium 3-5(or 6)-carpelled and -loculed; ovaries axially or ± completely connate; placentation apical-axile; ovules pendulous, solitary or collateral in each locule; style terminal, stylar elements coherent or rarely distinct at base; stigma 3- or 4-branched or capitate (often slightly lobed). Fruit drupaceous, of separating mericarps or ± completely syncarpous, drying brown to black or rarely pale gray-brown when ripe; abortive carpels, if any, persistent; outer pericarp (exocarp and mesocarp) ± fleshy; endocarp bony next to locule(s), otherwise woody, in mericarps developed from 2-ovuled carpels forming a median longitudinal partial partition within locule. Seeds pyriform or rarely irregular in shape; seed coat membranous or thin and brittle; endosperm copious or ± scant, fleshy; embryo relatively large, bent double or rarely broadly horseshoe-shaped; cotyledons plano-convex and linear or ± flattened and elliptic-oblong; hypocotyl superior.\r",
      "Two genera and six species: tropical Africa, S and SE Asia, N Australia, Canary Islands, NW Mediterranean region, Cuba; one species in China.",
      "This electronic version, published online on 26 August 2008, supersedes the printed treatment in Fl. China (11: 98–99. 2008). As here circumscribed, the Cneoraceae consist of two genera: Cneorum Linnaeus and Harrisonia. Cneorum comprises three species: C. tricoccon Linnaeus, native of the NW Mediterranean region; C. pulverulentum Ventenat, of the Canary Islands; and C. trimerum (Urban) Chodat, of Cuba.\r",
      "In the study of five collections each of Cneorum pulverulentum and C. tricoccon, and two of C. trimerum, the second author has observed glandlike structures in some of the leaf blades of each species, but in being opaque, very irregular in distribution on the blade, and irregular in shape (mostly ± isodiametric but some considerably longer than wide) they are quite unlike those seen in Rutaceae (see discussion paragraph following the description of Rutaceae in this volume) and are probably not oil glands.\r"
    ],
    "authors":"Hua Peng & Thomas G. Hartley"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Coriariaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10218",
    "knowledge_content":[
      "Shrubs decumbent or subshrubby herbs; branchlets ribbed. Leaves opposite or verticillate, entire; stipules caducous, minute. Flowers small, bisexual or unisexual, solitary or arranged in a raceme. Sepals 5, imbricate. Petals 5, valvate, smaller than sepals, fleshy, keeled within, enlarged and enclosing carpels after anthesis and forming a pseudodrupe. Stamens 10 in 2 series, free and opposite to petals; anthers exserted, large, 2-celled, longitudinally dehiscent. Carpels 5-10, free; ovary superior; ovule 1 per locule, pendulous, anatropous; styles 5, free, linear; stigma recurved. Pseudodrupe (capsule) oblate, red to black when mature; endosperm thin or absent, embryo erect.\r",
      "One genus and ca. 15 species: China and Himalayan region to Japan, Philippines, and Pacific islands (New Zealand); Central and South America (Mexico to Chile), Mediterranean region; three species in China.",
      "Ming Tien lu. 1980. Coriariaceae. In: Cheng Mien & Ming Tien lu, eds., Fl. Reipubl. Popularis Sin. 45(1): 62-66."
    ],
    "authors":"Tianlu Min & Anthony R. Brach"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Daphniphyllaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10254",
    "knowledge_content":[
      "Dioecious trees or shrubs; branchlets with leaf scars and lenticels. Leaves alternate, usually conferted at apex of branchlets, simple, entire, long petiolate, exstipulate. Inflorescence racemose, axillary, solitary, bracteate at base. Flowers unisexual, sometimes sterile. Calyx 3-6-parted, persistent or deciduous. Petals absent. Male flowers: stamens 5-12(-18), 1-whorled, radially arranged; filaments shorter than anthers; anthers luniform with lateral-longitudinal dehiscence, connective ± exserted. Female flowers: staminodes absent or 5-10; ovary ovoid or ellipsoidal, 2-locular; ovules 2 per locule, anatropous, pendulous; style very short; style branches 2, recurved or circinate, persistent, adaxially with decurrent stigmas. Drupe ovoid or ellipsoidal, tuberculate or indistinctly tuberculate-rugose on surface, often glaucous; mesocarp fleshy. Stone hard; testa membranous; endosperm fleshy; embryo small; cotyledons semiterete; radicle terete.\r",
      "One genus and 25-30 species: India and Sri Lanka to Australia, but centered in E and SE Asia; ten species (three endemic) in China.",
      "Ming Tien lu. 1980. Daphniphyllaceae. In: Cheng Mien & Ming Tien lu, eds., Fl. Reipubl. Popularis Sin. 45(1): 1-11."
    ],
    "authors":"Tianlu Min & Klaus Kubitzki"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Dichapetalaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10267",
    "knowledge_content":[
      "Small trees or shrubs, sometimes scandent shrubs. Leaves simple, alternate; stipules small, deciduous. Inflorescences axillary corymbose cymes, sometimes glomerate capitula; peduncles sometimes adnate with petioles. Flowers small, bisexual, rarely unisexual, actinomorphic or slightly zygomorphic. Sepals 5, free or partly connate, imbricate. Petals 5, free and equal or connate, unequal, apex 2-lobed or subentire. Stamens 5, alternate with petals, free or connate; anthers 2-loculed, dehiscence longitudinal, thickened on back of connective. Disk lobed, with 5 glands or disk annular, margin undulate, glands opposite to petals, free. Ovary superior or inferior, 2- or 3-locular; ovules 2, inverted in each locule; styles ± connate or free. Drupe dry or slightly fleshy; exocarp thin, easily burst. Seeds lacking endosperm; cotyledons fleshy.\r",
      "Four genera and ca. 130 species: primarily in tropical and subtropical regions; one genus and two species in China.",
      "Chen Pangyu. 1997. Dichapetalaceae. In: Chen Shukun, ed., Fl. Reipubl. Popularis Sin. 43(3): 204-207."
    ],
    "authors":"Shu-kun Chen & Sir Ghillean (Iain) T. Prance"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Dipentodontaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20095",
    "knowledge_content":[
      "Trees or shrubs, with bisexual flowers or dioecious, semievergreen or deciduous. Stipules small, distinct, caducous. Leaves alternate, simple, petiolate. Inflorescences axillary, on current year’s growth, abbreviated cymes in a pedunculate umbel or thyrses in a raceme or panicle. Flowers (4 or)5(-7)-merous, actinomorphic, 1-4 mm in diam. Sepals and petals ± undifferentiated, distinct. Stamens inserted at or in margin of a disk; anthers introrsed, longitudinally dehiscent. Ovary superior. Fruit a drupaceous tardily dehiscent capsule with 1 seed or a berry with 2-4 seeds. Seeds with or without an aril; endosperm present but thin.\r",
      "Two genera and about 16 species: tropical Asia, America, Australia, and Pacific islands, extending into warm temperate E Asia; two genera and three species (two endemic) in China.",
      "Both Dipentodon and Perrottetia have often been treated in the Celastraceae. However, both morphological and molecular evidence indicate that they are better treated in the family Dipentodontaceae (Zhang & Simmons, Syst. Bot. 31: 122-137. 2006).Cheng Chingyung. 1999. Dipentodon. In: Cheng Chingyung & Huang Puhua, eds., Fl. Reipubl. Popularis Sin. 45(3): 175-177; Cheng Chingyung. 1999. Perrottetia. In: Cheng Chingyung & Huang Puhua, eds., Fl. Reipubl. Popularis Sin. 45(3): 184-186.",
      "Plants with perfect flowers; inflorescences abbreviated cymes in a pedunculate umbel; fruit a drupaceous tardily dehiscent capsule, ellipsoid-ovoid, 1-seeded, apex beaked.",
      "Plants dioecious; inflorescences thyrses in a raceme or panicle; fruit a dry berry, subglobose or depressed globose, 2-4-seeded, apex with a persistent style but not beaked."
    ],
    "authors":"Jin-shuang Ma & Bruce Bartholomew"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Erythroxylaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10322",
    "knowledge_content":[
      "Shrubs or trees. Stipules intrapetiolar. Leaves alternate or rarely opposite, simple; leaf blade margin entire. Flowers usually bisexual, in axillary fascicles or cymes, regular, 5-merous, often heterostylous. Sepals 5, basally connate, with imbricate or valvate lobes, persistent. Petals 5, distinct, imbricate, usually with a scale on inner face at base. Stamens 5, 10, or 20, 1- or 2-verticillate; filament bases usually connate into a tube; anthers elliptic, 2-celled, with longitudinal slits. Ovary superior, connected with 3-5 carpels, 3-5-locular, with 1(or 2) axile; ovules pendulous, anatropous to hemitropous, placentation axile; styles 1-3 or 5, distinct or somewhat connate; stigmas oblique. Fruit a capsule or a 1-seeded drupe. Seeds with straight embryo and copious (rarely absent) endosperm.\r",
      "Ten genera and ca. 300 species: widely distributed in the tropical and subtropical zone, especially South America; two genera and three species (one introduced) in China.",
      "Huang Chengchiu, Huang Baoxian & Xu Langran. 1998. Erythroxylaceae. In: Xu Langran & Huang Chengchiu, eds., Fl. Reipubl. Popularis Sin. 43(1): 109-115.",
      "Flowers often heterostylous; ovary 3-locuar but only 1 locule fertile; styles 3, distinct or somewhat connate; fruit a drupe."
    ],
    "authors":"Quanru Liu & Bruce Bartholomew"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Euphorbiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10327",
    "knowledge_content":[
      "Authors: Bingtao Li, Huaxing Qiu, Jin-shuang Ma, Hua Zhu, Michael G. Gilbert, Hans-Joachim (Hajo) Esser, Stefan Dressler, Petra Hoffmann, Lynn J. Gillespie, Maria Vorontsova & Gordon D. McPherson",
      "Trees, shrubs, or herbs, rarely woody or herbaceous lianas, monoecious or dioecious, indumentum of simple, branched, stellate, or gland-tipped hairs, peltate or glandular scales or stinging hairs, latex often present, clear, white, or colored; roots woody, rarely roots tuberous and stems succulent, sometimes spiny. Leaves alternate or opposite, rarely whorled; stipules usually present, often free, sometimes modified into spines or glands, deciduous or persistent; petioles long to short, sometimes with glands at apex or base; leaf blade simple, sometimes palmately lobed, rarely compound, or reduced to scales, margins entire or toothed, sometimes with distinct glands along margin and\/or on surface, venation pinnate or palmate. Inflorescences axillary or terminal, flowers in cymes or fascicles, these often arranged along an elongated axis, branched or unbranched, forming a thyrse, in congested heads, or in a flowerlike cyathium with very reduced flowers enclosed within a ± cupular involucre; bracts sometimes petaloid. Flowers unisexual, within same inflorescence or in separate inflorescences, actinomorphic. Sepals (1-)3-6(-8), free or connate into calyx tube, valvate or imbricate, rarely absent (Euphorbia). Petals free, often reduced or absent. Disk present or absent. Male flowers with disk intrastaminal or extrastaminal, entire to dissected. Stamens one to very many, hypogynous; filaments free or connate; anthers 2(-4)-locular, mostly dehiscing longitudinally, rarely transversely or by pores, introrse or extrorse; rudimentary ovary sometimes present. Female flowers rarely with staminodes; ovary superior, (1-)2-5(-20)-locular; placentation axile; ovules 1 or 2 per locule, anatropous or hemitropous; styles free or connate, entire or lobed, or multifid, lobes erect, horizontal or curved; stigma capitate, linear, fimbriate, fan-shaped or pinnatilobate. Fruit typically a capsule elastically dehiscent into 2-valved cocci from a persistent columella, sometimes a berry or drupe. Seeds 1 or 2 per locule; seed coat thin to indurate, sometimes fleshy to form a sarcotesta; caruncle sometimes present; aril sometimes present; endosperm present or absent; embryo straight to curved or folded; cotyledons usually broader than radical. x = 6-14.Trees, shrubs, or herbs, usually without latex (present in Bischofia); indumentum of simple hairs (branched in Phyllanthus reticulatus), often absent. Leaves alternate, often distichous, sometimes scalelike on main stems; petiole usually short, usually without glands (present in Aporosa); leaf blade simple, margin entire or minutely serrulate (long petioles, 3(-5)-foliolate with toothed margins in Bischofia); venation pinnate, rarely obscurely 3-veined from base. Inflorescences mostly axillary, without visible axis (present in Antidesma, Aporosa, Baccaurea, Bischofia, Richeriella). Male flowers with 2-8 stamens, anthers longitudinally dehiscent (variable in Phyllanthus); female flowers with 2 ovules per locule. Seeds without caruncle, sometimes with fleshy aril or fleshy testa.Trees to shrubs. Leaf blade leathery, grayish when dry, base often asymmetrical. Ovules 1 per locule; stigmas dilated, peltate or reniform. Fruit a relatively large 1-seeded drupe, usually crowned by persistent flaplike stigmas. Seeds without caruncle.Plants with or without latex; indumentum of simple, stellate, scalelike, stinging, or glandular hairs, sometimes absent. Leaves alternate or opposite; leaf blade simple or compound, sometimes deeply divided, margin entire or variously toothed, often with sessile glands near junction with petiole and\/or along margins; venation pinnate or palmate. Inflorescences basically thyrsoid, very variable, often with well-defined main axis and\/or distinct cymes, rarely a sessile axillary fascicle. Ovules 1 per locule of ovary. Seed sometimes carunculate, sometimes arillate.\r",
      "About 322 genera and 8910 species: widespread throughout the world, primarily in the tropics and subtropics, more poorly represented in temperate regions; 75 genera (one endemic, nine introduced) and 406 species (99 endemic, 27 introduced) in China, nearly 95% of which are found in the S and SW parts of the country.Fifty-nine genera and over 1700 species: mostly tropical, the greatest diversity in SE Asia; 16 genera and 138 species (41 endemic, four introduced) in China.Four genera and ca. 210 species: throughout the tropics; two genera and 13 species (three endemic) in China.Two hundred and eighteen genera and over 5700 species: widespread throughout the world, primarily in the tropics and subtropics, more poorly represented in temperate regions; 54 genera (one endemic, nine introduced) and 255 species (55 endemic, 23 introduced) in China.",
      "The Euphorbiaceae as treated here include the following families that have been proposed for segregation: Androstachydaceae, Antidesmataceae, Bischofiaceae, Hymenocardiaceae, Phyllanthaceae, Pedilanthaceae, Picrodendraceae, Porantheraceae, Putranjivaceae, Ricinocarpaceae, Scepaceae, Stilaginaceae, Trewiaceae, and Uapacaceae. The Pandaceae and Buxaceae, formerly included here, are now well established as separate families.Molecular data has shown that the traditional concept of Euphorbiaceae includes three major lineages that are relatively distantly related to each other: the Phyllanthoids (genera 1-16 in this account), the Putranjivoids (genera 17 and 18), and the Euphorbioids (genera 19-75).Many species of Euphorbiaceae are of economic importance, probably most importantly as the main source of rubber (Hevea) but also as sources of medicine; foods, both as a staple starch source (Manihot) and fruits (e.g., Phyllanthus emblica); seed oils (Ricinus, Vernicia); and insecticides.Li Pingt’ao. 1994. Euphorbiaceae. In: Li Pingt’ao, ed., Fl. Reipubl. Popularis Sin. 44(1): ii-viii, 1-217; Kiu Huashing, Hwang Shumei & Chang Yongtian. 1996. Euphorbiaceae (2). In: Kiu Huashing, ed., Fl. Reipubl. Popularis Sin. 44(2): ii-ix, 1-212; Ma Jinshuang & Tseng Yungchien. 1997. Euphorbiaceae (3). In: Ma Jinshuang, ed., Fl. Reipubl. Popularis Sin. 44(3): ii-vi, 1-150.The Putranjivoid genera resemble phyllanthoids by their 2-ranked leaves, frequently rather small fasciculate flowers, and ovules 2 per locule. They can be distinguished by their leaf blades, stigmas, and fruit. Also, the leaves contain mustard oils and so frequently taste peppery when fresh, although the taste may take a little time to develop.",
      "Ovules 1 per locule; indumentum of simple, stellate, scalelike, glandular, or stinging hairs; latex present or absent; leaves mostly spiral, less often distichous, blade sometimes lobed (palmately compound in Hevea), margin entire or variously toothed, often with glands\/extra-floral nectaries on petiole apex\/leaf base and\/or margins; inflorescence axillary or terminal, often thyrsoid or cymose, sometimes pseudanthial, rarely sessile clusters; seeds sometimes carunculate. ..... Key 3. Euphorbioid genera",
      "Ovules 2 per locule; indumentum of simple, very rarely branched, hairs; latex absent; leaves often strongly distichous, blade never lobed, margin entire or finely serrulate (3-foliolate and toothed in Bischofia), usually without glands (present in Aporosa); inflorescence mostly axillary, often without visible axis; seeds not carunculate, sometimes arillate",
      "Stigmas usually bifid, not dilated; fruit a capsule or berry or if a drupe then relatively small and\/or with 2 or more seeds and without persistent flaplike stigmas; base of leaf blade symmetrical. ..... Key 1. Phyllanthoid genera",
      "Stigmas dilated, peltate or reniform; fruit a relatively large 1-seeded drupe, usually crowned by persistent flaplike stigmas; base of leaf blade often asymmetrical. ..... Key 2. Putranjivoid genera"
    ],
    "authors":"Bingtao Li, Huaxing Qiu, Jin-shuang Ma, Hua Zhu, Michael G. Gilbert, Hans-Joachim (Hajo) Esser, Stefan Dressler, Petra Hoffmann, Lynn J. Gillespie, Maria Vorontsova & Gordon D. McPherson"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Geraniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10367",
    "knowledge_content":[
      "Herbs, annual or perennial [rarely shrublets or shrubs]. Stipules present. Leaves alternate or opposite, palmately or pinnately divided, petiolate. Flowers in cymes, pseudoumbels, rarely flowers solitary, usually bisexual, actinomorphic, or ± zygomorphic. Sepals 5, usually distinct, imbricate. Petals usually 5, distinct. Fertile stamens 5 or 10, usually in 2 whorls, sometimes a whorl reduced to staminodes; filaments basally connate or distinct; anthers 2-locular, longitudinally dehiscent. Ovary superior; carpels 5, connate; ovules 1 or 2 per locule, pendulous, anatropous. Fruit a schizocarp with 5 1-seeded awned mericarps which separate elastically from a central beak. Seeds usually with little or no endosperm; embryo folded.\r",
      "Six genera and ca. 780 species: widely distributed in temperate, subtropic, and tropical mountains; two genera and 54 species (18 endemic, three introduced) in China.",
      "Pelargonium, including P. ×domesticum Bailey, P. ×graveolens L’Héritier, P. ×hortorum Bailey, P. peltatum (Linnaeus) L’Héritier, P. radens H. E. Moore (P. radula (Cavanilles) L’Héritier), and P. zonale (Linnaeus) L’Héritier, treated in FRPS (43(1): 83-86. 1998), are only cultivated as garden and potted plants in China and so are not treated here.Xu Langran, Huang Chengchiu & Huang Baoxian. 1998. Geraniaceae (excluding Biebersteinia). In: Xu Langran & Huang Chengchiu, eds., Fl. Reipubl. Popularis Sin. 43(1): 18-89."
    ],
    "authors":"Langran Xu & Carlos Aedo"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Icacinaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10447",
    "knowledge_content":[
      "Trees, shrubs, or lianas, occasionally with tendrils. Leaves alternate, rarely opposite, estipulate, veins mostly pinnate, sometimes palmate, margin usually entire, rarely lobed or denticulate. Inflorescences spikes, racemes, panicles, or cymes, axillary or terminal, rarely opposite leaves, with small bracts or not. Flowers regular, bisexual, sometimes polygamous or unisexual, (3 or)4- or 5(or 6)-merous. Calyx generally articulate to pedicel, usually persistent, small; lobes imbricate, rarely valvate. Petals present, rarely absent, free or connate at base, imbricate, rarely valvate, apices mostly inflexed or incurved. Stamens as many as petals; filaments free or on corolla tube, alternate with corolla lobes, often pilose at apex; anthers 2-celled, introrse. Disk rarely developed, cupular or divided. Ovary superior, 2-carpellate, coherent, 1-loculed, rarely 3-5-loculed; ovules 2, rarely 1 per locule, pendulous from apex, anatropous with abaxial raphe and micropyle facing upward; funicle usually thickened above micropyle; style rarely developed, simple; stigmas 2(or 3-5), or coherent to capitate or peltate. Fruit 1-loculed, 1-seeded, rarely 2-seeded, usually a drupe, rarely samaroid. Seeds pendulous, with a thin testa; endosperm usually present, embryo small, straight or curved; cotyledons usually ovate.\r",
      "About 57 genera and 400 species: mainly in tropical or subtropical regions, especially in the S Hemisphere; 12 genera and 24 species (eight endemic) in China.",
      "Chuang Hsuan. 1981. Icacinaceae (excluding Peripterygium). In: Fang Wen-pei, ed., Fl. Reipubl. Popularis Sin. 46: 37-65.The Icacinaceae were treated in a broad sense in FRPS, i.e., including Cardiopteris (Peripterygium), which is here recognized as a distinct monogeneric family.",
      "Large trees; young branches, young leaves, and inflorescences with appressed stellate scales; filaments shorter than anthers.",
      "Shrubs or small trees; branches, leaves, and inflorescences without stellate scales; filaments ca. 2 × or more longer than anthers",
      "Cymes di- or trichotomous, axillary, terminal, or opposite leaves; drupe usually with persistent stigma; calyx gamosepalous, cupular; filaments free from corolla tube, often pilose.",
      "Spikes or racemes axillary; drupe without persistent stigma; calyx chorisepalous at least apically; filaments inserted on corolla tube, glabrous.",
      "Petals spatulate, free at base, inside glabrous; connective protruding; disk complete, connate with ovary; fruit with a thin mesocarp; leaf margin sinuate.",
      "Petals loriform, connate at base, hairy; connective not protruding; disk divided into 5 leaflike lobes; fruit with a fleshy mesocarp; leaf margin entire.",
      "Petals hairy, coherent, campanulate-funnelform, fleshy; filaments slender, upward gradually dilated into a connective.",
      "Calyx 5-lobed; corolla choripetalous; leaf blade sparsely serrulate, palmately veined; flowers in extra-axillary racemes.",
      "Calyx 4-lobed; corolla gamopetalous, tubular; leaf margin sinuate; flowers in several axillary fascicled racemes."
    ],
    "authors":"Hua Peng & Richard A. Howard"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Linaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10510",
    "knowledge_content":[
      "Herbs or shrubs. Stipules small or absent. Leaves alternate or rarely opposite, simple; leaf blade margin entire. Inflorescences cymes or racemes. Flowers bisexual, regular. Sepals (4 or)5, distinct or basally connate, imbricate, persistent. Petals as many as and alternate with sepals, distinct or basally connate, convolute, basally often clawed, with 2-5 extrastaminal nectary glands or a disk. Stamens (4 or)5 or 10(or 15), in 1 whorl, alternate or opposite sepals, often some reduced to staminodes; filament bases connate into a tube. Ovary superior, with 2-5 carpels or seemingly 4-10-loculed by intrusion of a false septum, with 1 or 2 ovules per locule, placentation axile; styles as many as carpels, filiform, distinct or basally connate; stigmas subcapitate. Fruit usually a septicidal capsule or a drupe. Seeds with straight oily embryo and thin endosperm.\r",
      "Fourteen genera and ca. 250 species: worldwide but mostly in temperate regions; four genera and 14 species (one introduced) in China.",
      "Huang Chengchiu, Huang Baoxian & Xu Langran. 1998. Linaceae. In: Xu Langran & Huang Chengchiu, eds., Fl. Reipubl. Popularis Sin. 43(1): 93-108.",
      "Petals yellow; ovary 6(-8)-loculed by intrusion of a false septa; styles 3(or 4); capsule splitting into 6(-8) mericarps.",
      "Leaves sessile; leaf blade linear to lanceolate, 1- or 3-veined from base; petals usually blue, rarely white or yellow; styles 5; capsule with 10 1-seeded mericarps.",
      "Leaves petiolate; leaf blade elliptic, ovate, or elliptic-lanceolate, pinnately veined; petals pink or rarely white; styles 3; capsule 1-seeded."
    ],
    "authors":"Quanru Liu & Lihua Zhou"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Malpighiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10533",
    "knowledge_content":[
      "Shrubs, small trees, or woody lianas, pubescence a mix of medifixed (T-shaped) and simple hairs, monoecious or andro-dioecious. Leaves usually opposite, rarely alternate or 3-whorled, petiolate, simple, entire, glands often present either on petiole or on lower surface of leaves; stipules free and deciduous, or connate and ± persistent, sometimes reduced or absent. Inflorescences terminal or axillary, racemose, corymbose or umbellate, solitary or in panicles; pedicels articulate, 2-bracteolate at point of attachment. Flowers bisexual or staminate (in Ryssopterys), actinomorphic or zygomorphic. Sepals 5, polysepalous or gamosepalous, imbricate, rarely valvate, one or more large glandular at bases of outside members, rarely eglandular. Petals 5, typically clawed, margin ciliate, dentate or fimbriate. Disk inconspicuous. Stamens 10, obdiplostemonous, sometimes diadelphous with one stamen distinctly larger than others; filaments usually connate at base; anthers introrse, longitudinally dehiscent. Ovary superior, 3-locular, placenta axile, 1-ovuled, pendulous and semianatropous in each locule; styles 3, or connate into 1, persistent. Fruit a schizocarp, carpels 3 or fewer, 1 seed per carpel; schizocarp splitting into winged samaras, indehiscent. Seed embryo large, erect or rarely curved; endosperm lacking.\r",
      "About 65 genera and ca. 1280 species: tropical and subtropical regions, mainly American; four genera and 21 species (12 endemic) in China.",
      "Two cultivated species were described in FRPS (43(3): 129. 1997): Malpighia coccigera Linnaeus, grown in Guangdong and Hainan, and Thyrallis gracilis Kuntze, grown in Guangdong and Yunnan (Xishuangbanna).Chen Shukun & Chen Pangyu. 1997. Malpighiaceae. In: Chen Shukun, ed., Fl. Reipubl. Popularis Sin. 43(3): 105-131.",
      "Plants androdioecious; flowers bisexual or staminate; petals weakly clawed; only abaxial wing of fruit developing.",
      "Plants monoecious; flowers bisexual; petals clawed or not clawed; lateral and abaxial wings of fruit well developed, rarely abaxial wing underdeveloped as protrusions",
      "Stipules free, inserted on twig between petioles, sometimes reduced or absent; samaras not stellately winged, wings 1-3",
      "Flowers zygomorphic; petals clawed; style 1; samaras with 1 long abaxial wing and 2 shorter lateral wings.",
      "Flowers actinomorphic; petals not clawed; styles 3; samaras with lateral wings connate forming a disklike wing, abaxial wing developing or not.",
      "Aspidopterys  A. Jussieu ex EndlicherHiptage  GaertnerRyssopterys  Blume ex A. JussieuTristellateia  Du Petit-Thouars"
    ],
    "authors":"Shu-kun Chen & Michele Funston"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Meliaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10555",
    "knowledge_content":[
      "Trees, shrubs, or sometimes shrublets, monopodial or sympodial, usually dioecious, less often monoecious or polygamo- dioecious. Stipules absent. Leaves in spirals, very rarely opposite, usually pinnate; leaflets opposite, subopposite, or alternate; leaflet blades with base somewhat oblique, margin usually entire or rarely lobed or serrate. Flowers usually in axillary thyrses, rarely racemose or spicate. Calyx small, 3-6-lobed or with distinct sepals, usually cup-shaped or tubular, imbricate or valvate in bud. Corolla contorted or imbricate, sometimes quincuncial. Petals (3 or)4 or 5(or 6), rarely more, distinct or connate, sometimes adnate to staminal tube and then valvate. Stamens 3-10 or more, hypogynous, mostly with a staminal tube (distinct stamens in Cedrela and Toona); anthers usually sessile on stamen tube, erect, included or exserted, 2-celled, longitudinally dehiscing. Disk tubular, annular, obsolete, or absent, free or adnate to ovary. Ovary usually free, 2-5(or more)-locular, with 1 to many collateral or superposed ovules per locule; style single or rarely absent; stigma disciform or capitate. Fruit a berry (dry but indehiscent with arillate seeds in some Aglaia sect. Aglaia), capsule, or rarely a drupe. Seeds winged or with a fleshy aril or sarcotesta wholly or partly covering seed; endosperm fleshy or usually absent.\r",
      "About 50 genera and 650 species: tropical, subtropical, and occasionally warm temperate regions of both hemispheres; 17 genera (three introduced) and 40 species (two endemic, three introduced) in China.",
      "Fruit a drupe or berry or with fibrous indehiscent pericarp and arillate seed or seeds, sometimes a capsule but seeds not winged",
      "Disk annular or obsolete, ca. 1 mm high, surrounding only base of ovary; trees or shrubs more than 1 m tall.",
      "Filaments connate for ± basal half into a staminal tube; ovary 2- or 3-locular; fruit a berry, capsule, or drupe",
      "Flowers in thyrses; young leaves usually covered with stellate trichomes or peltate scalelike trichomes.",
      "Male flowers in thyrses, female flowers or bisexual flowers in spikes; young leaves not covered with trichomes."
    ],
    "authors":"Hua Peng, David J. Mabberley, Caroline M. Pannell, Jennifer M. Edmonds & Bruce Bartholomew"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Nitrariaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20209",
    "knowledge_content":[
      "Shrubs, 0.5-2 m tall, prostrate or ascending, succulent, sometimes spiny. Branches often spiny at end. Stipules intrapetiolar, distinct, caducous or persistent. Leaves alternate, spiral, or fasciculate, simple, fleshy or succulent, petiolate or subsessile, deciduous; leaf blade 1-veined or palmately veined, margin entire or 2- or 3-dentate at apex. Flowers solitary or aggregated in cymes, small, bracteate. Sepals 5, fleshy, imbricate, persistent. Petals 5, white or yellowish green. Stamens (10-)15, both alternate and opposite petals; anthers dorsifixed. Ovary inferior, sessile, 2-6-locular; styles 1; stigma ovoid. Fruit a drupe, purple, red, or yellow, fleshy, 1-seeded; mesocarp fleshy to succulent; endocarp forming a bony stone.\r",
      "One genus and ca. 11 species: arid and semiarid regions of N Africa, C, N, and W Asia, Australia, and SE Europe; five species (one endemic) in China.",
      "This family was included in Zygophyllaceae in FRPS. However, it differs from the Zygophyllaceae in many morphological characters. Molecular evidence also supports its recognition as a separate family.Liou Yingxin. 1998. Nitraria. In: Xu Langran & Huang Chengchiu, eds., Fl. Reipubl. Popularis Sin. 43(1): 117-123."
    ],
    "authors":"Yingxin Liu & Lihua Zhou"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Oxalidaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10644",
    "knowledge_content":[
      "Herbs, annual or perennial, sometimes shrubs or trees. Stipules absent or small. Leaves alternate or whorled, basal or cauline, pinnate or palmate; leaflets often folded together at night, margin always entire. Inflorescences umbellate, cymose, or racemose, or flowers solitary. Flowers bisexual, regular, 5-merous, usually heteromorphic, heterostylous. Sepals 5, distinct or basally connate, imbricate, rarely valvate. Petals 5, sometimes basally slightly connate, convolute. Stamens 10, in 2 whorls of 5; outer whorl usually with shorter filaments, opposite petals; filaments connate near base; anthers 2-celled, with longitudinal slits. Ovary superior; carpels 5 and fused; placentation axile, each locule with (1 or)2 to several ovules; styles 5, distinct; stigmas capitate or shortly 2-cleft. Fruit a loculicidal capsule or a berry. Seeds often with basal aril involved in explosive ejection of seed from capsule; endosperm fleshy.\r",
      "Six to eight genera and ca. 780 species: mostly in tropics and subtropics of both hemispheres but extending into temperate regions; three genera (one introduced) and 13 species (four introduced) in China.",
      "Huang Chengchiu, Huang Baoxian & Xu Langran. 1998. Oxalidaceae. In: Xu Langran & Huang Chengchiu, eds., Fl. Reipubl. Popularis Sin. 43(1): 3-17."
    ],
    "authors":"Quanru Liu & Mark Watson"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Pandaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10648",
    "knowledge_content":[
      "Trees or shrubs, dioecious. Axillary buds prominent. Stipules small. Leaves alternate, distichous, petiolate, simple, penninerved, margin serrulate or entire. Flowers unisexual, solitary or fascicled, or in axillary cymes, or terminal or cauliflorous racemelike thyrses. Sepals 5, imbricate, or open. Petals 5, imbricate or valvate. Disk small or absent, rarely larger. Stamens 5-15, 1- or 2-seriate, sometimes unequal, outer stamens alternating with petals, inner ones sometimes absent or reduced to staminodes; filaments free; anthers introrse, thecae longitudinally dehiscent, connective elevated. Ovary superior, 2-5-loculed; ovules 1 or 2 per locule, apical, pendent, orthotropal or anatropal, without obturator; styles 2-5(-10)-lobed. Fruit a drupe, sometimes flattened, more rarely a capsule; endocarp slightly bony or pitted or ridged, sometimes dehiscent by valves. Seeds usually flattened concave, more rarely ovoid, caruncle absent; endosperm present; cotyledons broad and flattened. 2n = 30.\r",
      "Li Pingtao & Zhang Yongtian. 1998. Pandaceae. In: Xu Langran & Huang Chengchiu, eds., Fl. Reipubl. Popularis Sin. 43(1): 1-2."
    ],
    "authors":"Bingtao Li & Michael G. Gilbert"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Peganaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20222",
    "knowledge_content":[
      "Herbs, perennial, branched, with neither basal nor terminal aggregations of leaves. Stipules when present intrapetiolar, distinct, setaceous, caducous. Leaves alternate, spiral, sessile, nonsheathing, simple; leaf blade pinnately veined, margin dissected or entire and when dissected ± irregularly pinnatifid. Flowers solitary [or aggregated in inflorescences], 4- or 5-merous, hypogynous, disk present. Sepals 4 or 5, 1-whorled, persistent, valvate. Petals 4 or 5, white, 1-whorled, imbricate. Stamens 12 or 15, distinct, 3-whorled, alternating with and opposite petals; pollen grains aperturate. Ovary 2- or 3-locular, subsessile; style 1. Fruit a capsule or berry, fleshy or not fleshy. Seeds 10-100.\r",
      "Two genera and ca. seven species: arid and semiarid regions of N Africa, Asia, S Europe, and North America; one genus and three species (one endemic) in China.",
      "This family was included in Zygophyllaceae in FRPS. However, it differs from the Zygophyllaceae in many morphological characters. Molecular evidence also supports its recognition as a separate family.A dye (\"Turkey red\"), produced from the seeds, is used for dyeing hats (tarbooshes).Liou Yingxin. 1998. Peganum. In: Xu Langran & Huang Chengchiu, eds., Fl. Reipubl. Popularis Sin. 43(1): 123-125."
    ],
    "authors":"Yingxin Liu & Lihua Zhou"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Plagiopteraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20242",
    "knowledge_content":[
      "Lianas climbing, woody, laticiferous. Branches and branchlets densely stellate hairy. Leaves opposite, simple, pinnately veined; stipules 2, free, minute. Inflorescence axillary, paniculate, multi-flowered, densely stellate hairy. Flowers bisexual, small. Calyx (2-)4(or 5)-partite, segments unequal in length. Petals 3, rarely 4, sepal-like, reflexed. Stamens numerous; filaments free; anthers 4-celled but becoming 2-celled at dehiscence. Ovary 3-loculed, sessile, superior, densely tomentose; ovules 2 per locule; style 1, subulate; stigma minutely 3-lobed. Fruit a capsule, not fleshy, dehiscent but finally septicidal with 3 apical spatulate wings. Seeds unknown.\r",
      "Baas et al. (Grana 18: 69-89. 1979) provided two interpretations of the perianth, one similar to the above (although with petals (3 or)4(or 5)) and another in which the inner whorl is regarded as a calyx, the outer whorl as bracteoles or an epicalyx, and the corolla consequently absent.In their detailed review, Baas et al. (loc. cit.) were unable to place Plagiopteron with any confidence and concluded that the genus deserved family rank, following Airy Shaw’s earlier concept (Kew Bull. 18: 249-273. 1965). The molecular evidence presented in abstract by Simmons et al. (Amer. J. Bot. 87(6, Abstracts): 156-157. 2000) placed Plagiopteron clearly in the Celastraceae, close to the Hippocrateoid genera. Savolainen et al. (Kew Bull. 55: 257-306. 2000) and Soltis et al. (Bot. J. Linn. Soc. 133: 381-461. 2000) similarly placed the genus. The general appearance of the plant, a woody climber with fairly large opposite leaves, small flowers in many-flowered terminal cymes, and fruit with Acer-like wings supports this affinity. Further similarities were found in the elastic material of the leaf midrib vascular cylinder. The pollen of Plagiopteron is apparently unusual for Celastraceae (Baas et al., loc. cit.).Chang Hung-ta. 1989. Plagiopteron. In: Chang Hung-ta, ed., Fl. Reipubl. Popularis Sin. 49(1): 48-50."
    ],
    "authors":"Ya Tang & Sue Zmarzty"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Polygalaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10716",
    "knowledge_content":[
      "Perennial or annual herbs or shrubs or trees, rarely small herbs (the latter sometimes saprophytic). Leaves simple, alternate, opposite, or whorled, petiolate or sessile, papery or leathery, with pinnate veins, margin entire, leaves rarely reduced and scalelike; stipules absent, sometimes spiniform or scalelike appendages present. Flowers bisexual, zygomorphic, white, yellow, or purple-red, pedicellate or sessile, in axillary or terminal racemes, panicles, or spikes, with bracts and usually also with bracteoles. Calyx persistent or caducous; sepals 5, free or connate at base, outer 3 small, inner 2 (alae) large, petal-like, or all 5 nearly equal. Petals 3 or 5, basally often connate, lower (median) one (\"keel\") usually inflexed, carinate, sometimes with fimbriate or lamellate or papilionaceous apical appendages. Stamens 8, 7, 5, or 4; filaments free, or variously united and forming a sheath open on upper side and troughlike; anthers basifixed, usually dehiscing by a single apical pore. Disk usually absent, if present annular or glandular. Ovary superior, 1- or 2-loculed; ovule 1 per locule, anatropous, pendulous, rarely ovules numerous and placentas parietal; style 1, erect or curved; stigmas 1 or 2, capitate. Fruit a 2-loculed capsule, dehiscing by valves, or a 1-loculed samara or a berrylike drupe, dehiscing or not. Seeds 2, or 1 with 1 sterile locule, yellow-brown, dark castaneous, or black, ovoid, globose, or ellipsoidal, glabrous or piliferous, strophiolate or not, with or without endosperm, sometimes with an appendage at end opposite to strophiole.\r",
      "Thirteen to 17 genera and about 1000 species: widespread worldwide, especially in tropical and subtropical regions of both hemispheres; five genera and 53 species (24 endemic) in China.",
      "Chinese genera of economic importance include Polygala (medicinal), Salomonia (medicinal), Securidaca (medicinal), and Xanthophyllum (fine wood).Chen Shukun. 1997. Polygalaceae. In: Chen Shukun, ed., Fl. Reipubl. Popularis Sin. 43(3): 132-203.",
      "Trees or erect shrubs; petals 5; stamens 8, free, or 2-5 adnate at base of ovary or petals; fruit globose.",
      "Erect herbs, scandent shrubs, or trees; petals 3 (but often with 2 enlarged petal-like sepals); stamens 4-8, filaments connate; fruit flattened",
      "Saprophytes lacking chlorophyll; leaves yellow-brown, scalelike, shorter than 3 mm; capsule indehiscent, without a dentate margin.",
      "Plants autotrophic, green; leaves green, largest leaf at least 4 mm; capsule dehiscent, with a dentate margin.",
      "Erect shrubs, small trees, or herbs, rarely scandent shrubs (Polygala tricholopha); fruit not winged, 2-seeded.",
      "Epirixanthes  BlumeHeterosamara  KuntzePolygala  LinnaeusSalomonia  LoureiroSecuridaca  LinnaeusXanthophyllum  Roxburgh"
    ],
    "authors":"Shu-kun Chen, Haiying Ma & John A. N. Parnell"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Rutaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10781",
    "knowledge_content":[
      "Shrubs, trees, or sometimes herbs, sometimes scrambling or scandent, sometimes armed, with aromatic volatile oils contained in glands visible at surface of at least leaves, young branchlets, inflorescences, flower parts, fruit, or cotyledons in seed. Stipules absent [or stipular excrescences rarely present]. Leaves alternate, opposite [or whorled], simple (petiole neither apically swollen nor articulate with leaf blade), 1-foliolate (in individual specimens at least some 1-foliolate leaves with petiole apically swollen and\/or articulate with leaf blade), or variously compound. Flowers bisexual or unisexual, usually 3-5-merous, actinomorphic or rarely zygomorphic, hypogynous [or rarely perigynous]. Perianth in 2 series, with clearly differentiated calyx and corolla or sometimes in 2 irregular series or 1 series, with ± undifferentiated tepals. Sepals distinct or connate to their full length. Petals distinct [or rarely coherent or connate for part of their length]. Stamens usually as many as or 2 × as many as petals or sometimes more numerous; filaments distinct or sometimes coherent or connate for at least part of their length; anthers introrse or sometimes latrorse, longitudinally dehiscent. Disk [rarely lacking] within androecium, nectariferous, flattened, annular, cup-shaped, pulvinate, or sometimes columnar, bell-shaped, conic, or hourglass-shaped. Gynoecium of 1-5 distinct 1-loculed carpels or 2 to many partially to completely connate carpels; placentation axile [very rarely becoming parietal]; ovules 1 to many per locule. Fruit of 2-5 follicles [drupes or samaras] or a single follicle, capsule, or berry [or samara]. Seeds with relatively large embryo; endosperm present and fleshy or lacking.\r",
      "About 155 genera and ca. 1600 species: nearly cosmopolitan but mainly tropical and subtropical; 22 genera (one endemic, one introduced) and 126 species and hybrid species (49 endemic, at least two introduced) in China.",
      "Oil glands of Rutaceae, when viewed from the surface of plant parts they occupy, are usually pellucid. They also appear to be ± isodiametric and to have ± definite patterns of distribution. In blades of leaves, for example, where they are most commonly observed, they are usually ± evenly scattered throughout, or sometimes they are restricted to the margins. Rarely they are alleged to occur only along the secondary veins of the blades.In a cladistic analysis of selected genera of Rutaceae and related families based on rbcL and atpB molecular data (but only on rbcL data for Harrisonia), M. W. Chase, C. M. Morton, and J. A. Kallunki (Amer. J. Bot. 86: 1191-1199. 1999) recommended the placement of Harrisonia (traditionally Simaroubaceae) in Rutaceae. We do not agree with this classification, particularly because Harrisonia appears to lack oil glands, and suggest that the genus is most correctly placed in Cneoraceae, in which it is treated herein.Several taxa of cultivated Rutaceae treated by C. C. Huang (Fl. Reipubl. Popularis Sin. 43(3). 1997) are not treated here: Casimiroa edulis La Llave, which is native to Mexico, has been introduced as a cultivated plant to the Xishuangbanna Botanical Garden in Yunnan; Limonia acidissima Linnaeus (Feronia limonia (Linnaeus) Swingle), which is native to India and Sri Lanka, has been reported as cultivated in Taiwan by C. C. Huang (Fl. Reipubl. Popularis Sin. 44(3): 212. 1997) but was not reported as a cultivated plant by T. C. Huang in A Checklist of the Vascular Plants of Taiwan (Fl. Taiwan 6: 81-83. 1979); Flindersia amboinensis Poiret, which is native to Indonesia and New Guinea, is cultivated in S China; Ptelea trifoliata Linnaeus, which is native to North America, is cultivated in Beijing and Liaoning; and Ruta graveolens Linnaeus, which is native to the Mediterranean region, is widely cultivated in China.Huang Chengchiu. 1997. Rutaceae. In: Huang Chengchiu, ed., Fl. Reipubl. Popularis Sin. 43(2): ii-viii, 1-250.",
      "Leaves digitately 3-foliolate or 1-foliolate; inflorescences axillary or basal to leaves; plants usually monoclinous or dioecious",
      "Axillary buds exposed; ovary in female flowers with carpels connate at base, otherwise contiguous; fruit of 1-5 follicles.",
      "Axillary buds concealed in excavated base of petioles; ovary in female flowers syncarpous; fruit a drupaceous berry.",
      "Leaves digitately 3-foliolate or 1-foliolate; ovary in bisexual and female flowers with carpels connate at base, otherwise contiguous; fruit of 1-4 basally connate follicles.",
      "Leaves 1-foliolate; ovary in bisexual and female flowers syncarpous or rarely (Acronychia) separated apically by septicidal fissures; fruit a drupaceous berry",
      "Flowers male or female; stamens glabrous, similar in male and female flowers but lacking pollen in latter; gynoecium rudimentary and minute in male flowers, ± as long as petals in female flowers; seed coat with thick inner layer of dense black sclerenchyma and spongy outer layer bounded externally by a shiny black pellicle.",
      "Flowers bisexual; staminal filaments with an indumentum; gynoecium ± half as long as petals; seed coat with thick inner layer of dense black sclerenchyma and an outer layer of compact dull to ± shiny parenchymatous tissue.",
      "Fruit follicular or drupaceous; endocarp cartilaginous or leathery; seeds with endosperm; flowers male, female, or sometimes bisexual; functional stamens as many as petals except in plants of Zanthoxylum with undifferentiated perianth which have 5-9 tepals and 3-8(-10) functional stamens; functional gynoecium 1-7-loculed, syncarpous or with distinct or only basally connate carpels",
      "Fruit baccate; endocarp membranous or fleshy; seeds without endosperm; flowers bisexual or bisexual and male; stamens at least 2 × as many as petals or rarely fewer; functional gynoecium 2- to many loculed, syncarpous",
      "Leaves odd-pinnately 3- to many foliolate or sometimes digitately 3-foliolate (occasional leaves even-pinnate, 2-foliolate, or 1-foliolate); functional gynoecium 1-5-loculed, with distinct carpels or carpels basally connate; fruit of 1-5 distinct or basally connate follicles.",
      "Leaves digitately 3-foliolate (occasional leaves 1- or 2-foliolate); functional gynoecium 4-7-loculed, syncarpous; fruit a 4-7-loculed drupaceous berry.",
      "Inflorescences axillary, between leaves, or basal to leaves; flowers male or female; functional gynoecium 4-loculed; ovaries basally connate; fruit of 1-4 basally connate follicles.",
      "Inflorescences terminal; flowers male, female, or sometimes bisexual; functional gynoecium 2-5-loculed, syncarpous; fruit drupaceous berry, with 1-5 1-seeded leathery pyrenes.",
      "Flowers bisexual or bisexual and male; stamens more than 2 × as many as petals; gynoecium 2- to many loculed; ovules 2 to many per locule; fruit with stalked or rarely sessile pulp vesicles; leaves odd-pinnately 3(or 5)-foliolate, digitately 3-foliolate, 1-foliolate, or simple",
      "Flowers bisexual; stamens 2 × as many as petals or rarely fewer; gynoecium 2-5-loculed; ovules 1 or 2 per locule; fruit either without pulp vesicles or with sessile pulp vesicles; leaves odd-pinnately 3- to many foliolate, digitately 3-foliolate, 1-foliolate, or simple (occasional leaves 2-foliolate)",
      "Plants evergreen, rarely deciduous (Citrus trifoliata); fruit with leathery (or rarely soft) exocarp and spongy mesocarp; seeds embedded in pulp vesicles; leaves 1-foliolate, simple, or rarely digitately 3-foliolate.",
      "Plants deciduous; fruit with thin, parenchymatous exocarp and woody mesocarp; seeds embedded in a clear glutinous substance; leaves odd-pinnately 3(or 5)-foliolate.",
      "Radial walls of locules in gynoecium becoming curved after anthesis; cotyledons in seed thin and flat, convolute, and\/or folded.",
      "Radial walls of locules in gynoecium straight; cotyledons in seed plano-convex, neither convolute nor folded",
      "Terminal and axillary buds and usually young inflorescences with a rust-colored villosulous indumentum (sometimes partly bleached); style persistent in fruit.",
      "Terminal and axillary buds and young inflorescences without a rust-colored villosulous indumentum; style or at least its distal portion usually deciduous in fruit",
      "Fruit without pulp vesicles; stamens distinct; flowers axillary, solitary or in few-flowered fascicles; petiole 0.4-2.5 cm, usually bent and\/or twisted and ± apically swollen; erect or scrambling shrubs or woody climbers, usually armed.",
      "Fruit usually with pulp vesicles; stamens distinct or with filaments variously connate or coherent; flowers in terminal and\/or axillary inflorescences, in fascicles, racemes, or panicles; petiole 0.2-1.3 cm, usually not bent, twisted, or swollen; shrubs or trees, armed or unarmed.",
      "Flower buds globose, pyriform, or rarely ovoid; staminal filaments ± abruptly dilated toward base, ± straight or geniculate; style 0.5-2.5 × as long as ovary; disk columnar, conic, bell-shaped, or ± hourglass-shaped; seeds glabrous.",
      "Flower buds ellipsoid to obovoid or narrowly so or subcylindric; staminal filaments linear or sublinear, ± straight; style 3-7 × as long as ovary; disk annular, pulvinate, or columnar; seeds glabrous or villous."
    ],
    "authors":"Prof. Dianxiang Zhang, Thomas G. Hartley & David J. Mabberley"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Salvadoraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10788",
    "knowledge_content":[
      "Small trees or shrubs, sometimes scandent, glabrous or white tomentose, unarmed or with axillary spines (Azima). Stipules minute or absent. Leaves opposite, simple, entire, usually thickly leathery or almost succulent. Inflorescences axillary or terminal, paniculate or fasciculate. Flowers small, bisexual or unisexual, actinomorphic. Calyx campanulate or ovoid, 3- or 4-toothed or 4-fid. Petals 4, imbricate in bud, free or shortly united at base [Salvadora]. Stamens 4, inserted on corolla tube or at base, alternate with petals; filaments filiform or base dilated, free or basally united or adnate to corolla base; anthers ovoid, dorsifixed, 2-locular, back-to-back; connectives often in an apical mucro, dehiscing longitudinally. Disk absent or represented by 4 separate scale-shaped glands alternate with filaments. Ovary superior, 1- or 2-locular or imperfectly 4-locular; ovules 1 or 2 per locule, erect, anatropous; style short; stigma 2-fid or obtuse and undivided. Fruit an indehiscent berry or drupe; endocarp membranous or papery. Seeds commonly solitary, erect, globose or compressed, with a thin or cartilaginous testa, endosperm absent; cotyledons thick, base cordate; radicle straight.\r",
      "Three genera and nine species: tropical Africa and Asia, often growing in somewhat saline soils; one species in China."
    ],
    "authors":"Hua Peng & Michael G. Gilbert"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Simaroubaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10824",
    "knowledge_content":[
      "Trees or shrubs usually with bitter bark. Leaves alternate, sometimes opposite, pinnate to unifoliolate or rarely simple; stipules present or absent. Inflorescences axillary, racemose, paniculate, cymose, rarely spicate. Flowers generally small, bisexual or unisexual (andromonoecious, functionally dioecious, or distinctly dioecious), often with rudiments of opposite sex, actinomorphic. Calyx of 4 or 5(-8) sepals, imbricate or valvate. Petals usually 4 or 5(-8), free, imbricate or valvate. Stamens same number as petals and alternate with them, or 2 × as many as petals (or more); filaments free, base often with an appendage; anthers oblong, versatile, bicelled, with a longitudinal slit. Disk usually present, sometimes a gynophore or androgynophore. Gynoecium weakly united at base, or virtually free, usually 2-5-carpellate; ovary superior, with axile placentation; ovules 1 or 2 per locule, apical or basal; style connate or free; stigmas 2-5. Fruit a \"drupe\" or \"samara,\" actually 1-5 fruitlike monocarps produced per flower, each a druparium or a samarium; endosperm present or absent; embryo straight or curved, with thick cotyledons.\r",
      "Twenty genera and ca. 95 species: mainly in tropical and subtropical regions, some species in temperate regions; three genera and ten species (six endemic) in China.",
      "Harrisonia R. Brown ex A. Jussieu and Suriana Linnaeus, treated in the Simaroubaceae in FRPS (43(3): 13-15. 1997), are treated in the Cneoraceae and the Surianaceae, respectively, in this volume.Chen Pangyu. 1997. Simaroubaceae (excluding Harrisonia and Suriana). In: Chen Shukun, ed., Fl. Reipubl. Popularis Sin. 43(3): 1-16.",
      "Druparium with persistent calyx; leaflets glabrous on both surfaces or pubescent on midvein or lateral veins when young."
    ],
    "authors":"Hua Peng & Wm. Wayt Thomas"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Staphyleaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10848",
    "knowledge_content":[
      "Trees or shrubs, deciduous or evergreen. Leaves opposite, odd-pinnately compound, or trifoliolate, rarely simple, stipulate or exstipulate; leaflets with petiolules, less commonly subsessile, pinnately veined. Flowers bisexual to rarely unisexual, pinkish to white, pendent or erect, actinomorphic and hypogynous, arranged in panicles or racemes. Sepals 5, often petaloid, caducous or persistent, imbricate. Petals 5, free or connate at base, imbricate, rarely valvate, as equal as sepals. Stamens 5; filaments free or inserted on corolla tube, alternating with corolla lobes; anthers dehiscing by longitudinal slits. Disk annular to barely discernible. Gynoecium superior; carpels 2 or 3(or 4), free or weakly united, lobed ovary with as many locules as carpels; style free or slightly united; ovules 1 to several and arranged in 2 rows. Fruits inflated capsules or follicles or berrylike drupes. Seeds globose to ovoid; arillode present or absent.\r",
      "Three genera and 40-50 species: mainly in tropical or subtropical regions, especially in the N Hemisphere; three genera and 20 species (ten endemic) in China.",
      "Tapiscia Oliver, treated in the Staphyleaceae in FRPS (46: 17-20. 1981), is treated in the Tapisciaceae in this volume.Hsu Ting-zhi. 1981. Staphyleaceae (excluding Tapiscia). In: Fang Wen-pei, ed., Fl. Reipubl. Popularis Sin. 46: 16-37.",
      "Sepals usually persistent; flower small, not pendent; disk prominent; fruit a follicle; seeds enclosed in a thin fleshy aril.",
      "Sepals caducous; flower pendent; disk slightly developed; fruit an inflated capsule; seeds without an aril."
    ],
    "authors":"De-Zhu Li, Jie Cai & Jun Wen"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Surianaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20299",
    "knowledge_content":[
      "Trees or shrubs. Leaves alternate, simple or pinnately compound; stipules small or absent. Inflorescences cymose or paniculate, terminal or axillary, or solitary and axillary, rarely cauliflorous. Flowers bisexual or sometimes unisexual, hypogynous, actinomorphic. Sepals 5(-7), distinct, imbricate or quincuncial, often persistent, sometimes accrescent. Petals 5 or rarely deciduous or lacking, imbricate, free. [Gynophore present in Recchia.] Stamens 10, obdiplostemonous, inner cycle sometimes rudimentary; anthers oblong, basifixed, opening by a longitudinal slit. Gynoecium superior, of 1-5 distinct carpels with adaxial-basal style; ovary with (1 or)2(-5) ovules; ovule basal-marginal or marginal; style gynobasic; stigma clavate to capitate. Fruit 1-5 drupelike or nutlike monocarps produced per flower (drupetum or achenetum). Endosperm present; embryo curved or folded, with incumbent cotyledons.\r"
    ],
    "authors":"Hua Peng & Wm. Wayt Thomas"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Tapisciaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20304",
    "knowledge_content":[
      "Trees, deciduous, androdioecious. Leaves alternate, petiolate, odd-pinnate with 5-9 leaflets, glands or stipels at point of articulation, blade serrate to crenate, stipules caducous. Inflorescence paniculate, axillary. Flower small, male or hermaphrodite, actinomorphic, white or yellow. Calyx tubular, 5-lobed. Petals 5. Stamens 5, often exserted. Floral disk small or absent. Ovary superior, 1-locular with 1 ovule. Fruits indehiscent, drupaceous or baccate, fruit wall fleshy or leathery.\r",
      "Two genera and six species: China (Tapiscia), West Indies and N South America (Huertea Ruiz & Pavon); one genus (endemic) and two species in China."
    ],
    "authors":"De-Zhu Li, Jie Cai & Jun Wen"
  }
]