[
  {
    "group_title":"Gentianaceae through Boraginaceae",
    "family":"Polemoniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10715",
    "knowledge_content":[
      "Herbs annual or perennial, rarely subshrubs or vines. Leaves alternate or opposite, sessile to petiolate, simple, pinnatifid to palmately lobed, or compound. Inflorescences determinate, corymbose, paniculate, or capitate, or flowers solitary. Flowers (4- or)5-merous. Calyx gamosepalous, cylindric to campanulate; tube herbaceous throughout and papery in fruit or with herbaceous midveins separated by translucent membranes distended or ruptured in fruit; lobes often scarious margined. Corolla gamopetalous, actinomorphic or zygomorphic, rotate to funnelform or salverform; lobes overlapping in bud. Stamens inserted at same or different levels on corolla at base, alternate with corolla lobes, exserted to included; filaments equal to unequal, filiform. Ovary superior, (2- or)3-locular, placentation axile; ovules 1 to many per locule. Style 1; stigma lobes (2 or)3. Fruit a capsule. Seeds globose, ovoid, or fusiform, sometimes winged, often sticky when wet.",
      "Nineteen genera and 320-350 species: North and South America, a few species native to temperate Asia and Europe; one genus, Polemonium, and three species in China. Cobraea scandens Cavanilles (a perennial vine with violet campanulate corollas ca. 5 cm) and three species of Phlox, P. drummondii Hooker, P. paniculata Linnaeus, and P. subulata Linnaeus (herbs with white to red, salverform corollas and unequally inserted stamens), are cultivated in China.\r",
      "Fang Rhui-cheng & Huang Shu-hua in Wu Cheng-yih, ed. 1979. Polemoniaceae. Fl. Reipubl. Popularis Sin. 64(1): 155-160."
    ],
    "authors":"Ruizheng Fang & Dieter H. Wilkins"
  },
  {
    "group_title":"Verbenaceae through Solanaceae",
    "family":"Lamiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10476",
    "knowledge_content":[
      "Herbs, sometimes subshrubs or shrubs, annual or perennial, usually aromatic. Stems and branches usually 4-angled. Leaves opposite, rarely whorled or alternate, simple to pinnately dissected or compound, without stipules. Inflorescences generally compound, sometimes flowers solitary and axillary; verticillasters 2- to many flowered, subtended by leaves or bracts. Flowers bisexual, zygomorphic, rarely subactinomorphic, bracteolate or not. Calyx persistent, 5-toothed, 2-lipped; upper lip 3-toothed or entire (deciduous in Scutellaria); lower lip 2- or 4-toothed; tube sometimes hairy annulate inside. Corolla limb usually 2-lipped; upper lip 2-lobed and lower 3-lobed, rarely upper lip entire and lower 4-lobed, also rarely limb (4- or) 5-lobed; tube hairy annulate inside. Stamens epipetalous, 4 or 2, free, rarely filaments connate, sometimes one staminodial; anther 1- or 2-celled, usually dehiscing longitudinally; disc persistent. Ovary superior, 2-celled and each cell 2-ovuled and style subterminal, or ovary 4-parted and each lobe 1-ovuled and style gynobasic (from bases of ovary lobes) with 2-cleft apex. Fruit usually 4 dry nutlets. Seeds with or without endosperm.",
      "Approximately 3500 species in 220 genera, distributed worldwide, but mostly in the Mediterranean region and SW Asia. China has 807 species in 96 genera.\r",
      "Cantino (Taxon 40: 441. 1991) suggests that Cardioteucris cordifolia C. Y. Wu, originally placed in the Lamiaceae, is identical with Caryopteris siccanea W. Smith (Verbenaceae, q.v.). Although the original author agrees with the identity of Cardioteucris cordifolia and Cardiopteris siccaneae, he believes that the generic placement of Cardioteucris is in the Lamiaceae because of its 2-lipped calyx and deeply 4-divided ovary. The last feature is aberrant in Caryopteris and all other Verbenaceae.\r",
      "Style arising above base of ovary; nutlets with a large and obvious areole more than half nutlet axis length; corolla 1-lipped (i.e., all lobes of corolla forming a single lower lip) or ± so (i.e., upper lip of corolla poorly developed), rarely 2-lipped or flowers subactinomorphic.",
      "Leaves alternate; calyx 19-veined; nutlets flattened dorsi-adaxially, tuberculate; flowers spirally arranged in racemes",
      "Leaves opposite; calyx generally 10- or fewer veined; nutlets ± corrugate; flowers in cymes or verticillasters",
      "Fruiting calyx 2-lipped, upper lip generally with a scutellum, deciduous, lower lip generally persistent; ovary stipitate; seeds ± transverse; embryo with a curved radicle",
      "Fruiting calyx other than above; ovary generally not stipitate; seeds erect; embryo with a short, straight radicle."
    ],
    "authors":"Xi-wen Li & Ian C. Hedge"
  },
  {
    "group_title":"Verbenaceae through Solanaceae",
    "family":"Solanaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10828",
    "knowledge_content":[
      "Herbs, shrubs, small trees, or climbers. Stems sometimes prickly, rarely thorny; hairs simple, branched, or stellate, sometimes glandular. Leaves alternate, solitary or paired, simple or pinnately compound, without stipules; leaf blade entire, dentate, lobed, or divided. Inflorescences terminal, overtopped by continuing axes, appearing axillary, extra-axillary, or leaf opposed, often apparently umbellate, racemose, paniculate, clustered, or solitary flowers, rarely true cymes, sometimes bracteate. Flowers mostly bisexual, usually regular, 5-merous, rarely 4- or 6-9-merous. Calyx mostly lobed. Petals united. Stamens as many as corolla lobes and alternate with them, inserted within corolla, all alike or 1 or more reduced; anthers dehiscing longitudinally or by apical pores. Ovary 2-5-locular; placentation mostly axile; ovules usually numerous. Style 1. Fruiting calyx often becoming enlarged, mostly persistent. Fruit a berry or capsule. Seeds with copious endosperm; embryo mostly curved.",
      "About 95 genera with 2300 species: best represented in western tropical America, widespread in temperate and tropical regions; 20 genera (ten introduced) and 101 species in China.\r",
      "Some species of Solanaceae are known in China only by plants cultivated in ornamental or specialty gardens: Atropa belladonna Linnaeus, Cyphomandra betacea (Cavanilles) Sendtner, Brugmansia suaveolens (Willdenow) Berchtold & Presl, Nicotiana alata Link & Otto, and Solanum jasminoides Paxton.",
      "Corolla tube much longer than lobes and limb; seeds not compressed, usually ovoid to ellipsoid; calyx not or hardly becoming enlarged.",
      "Corolla tube much shorter than lobes and limb; seeds mostly compressed, discoid, reniform, or lenticular; calyx often becoming enlarged.",
      "Fruit a few-seeded berry; flowers regular; plants puberulent or glabrescent; calyx less than 6 mm, shallowly lobed",
      "Fruit a many-seeded capsule; flowers somewhat zygomorphic; plants mostly viscid glandular pubescent; calyx more than 6 mm, deeply lobed",
      "Corolla yellow; anthers dehiscing longitudinally, with a slender, sterile apex; seeds pilose; flowers 5-9-merous",
      "Corolla usually white, blue, or violet (if yellow then zygomorphic); anthers dehiscing by terminal pores, lacking a terminal appendage; seeds glabrous; flowers 4- or 5-merous",
      "Fruit a dry dehiscent capsule; flowering calyx more than 1.5 cm, lobed or divided halfway; corolla more than 2.5 cm.",
      "Fruit a juicy or dry indehiscent berry; flowering calyx mostly less than 1.5 cm (if more than 1.5 cm then corolla more than 2 cm), deeply parted; corolla less than 2 cm.",
      "Stems mostly underground; normal leaves forming a rosette at stem apex, scaly leaves distributed along new stems; flowers mostly included within rosette",
      "Stems aboveground; normal leaves borne along stems, scaly leaves absent; flowers arising along stem or apically in leaf axils.",
      "Leaves mostly subsessile, petiole if present winged; pedicel less than 5 mm; calyx lobes sharp pointed, with noticeable marginal veins",
      "Leaves petiolate, petiole wingless; pedicel more than 5 mm; calyx lobes blunt, lacking marginal veins.",
      "Corolla regular, campanulate; stamens subequal; calyx lobes differing in size and\/or shape; fruiting pedicel thickened",
      "Corolla blue and white; fruiting calyx lobes free more than halfway down, each with 2 basal auricles; fruit a dry brown berry",
      "Corolla yellow or white; fruiting calyx lobes united to near apex, lacking basal auricles; fruit a juicy, green, yellow, or orange berry.",
      "Fruiting calyx with thickened angles (ribs), bristly soft emergences that appear deltate on drying, or with both",
      "Calyx 5-lobed, circumscissile; fruit prickly or papillate, 4-valved or irregularly dehiscent; plants erect, mostly more than 60 cm tall; seeds discoid; corolla lobes pointed",
      "Calyx 5-parted, persistent; fruit unarmed, lacking papillae, 2-valved, dehiscent; plants sprawling, if erect then less than 50 cm tall; seeds ovoid or oblong; corolla mostly with rounded lobes",
      "Corolla funnelform; stamens mostly exserted; shrubs, often thorny; leaves usually fasciculate on short shoots",
      "Corolla campanulate, rotate, or stellate; stamens included; unarmed herbs or shrubs; leaves arising along stem or forming a basal rosette.",
      "Calyx subtruncate, sometimes with 10 subapical teeth or umbos arising near base of apical rim;  fruit red, sometimes yellow, purple, or pink in cultivation.",
      "Calyx becoming enlarged, wide flaring in fruit; leaves subsessile, usually forming a basal rosette; anthers dehiscing longitudinally",
      "Anthers dehiscing by apical pores; corolla rotate; plants sometimes pubescent with simple or branched hairs; calyx often with 10 subapical teeth",
      "Anthers dehiscing longitudinally; corolla campanulate; plants glabrescent with sparse simple hairs; calyx 5-toothed or toothless."
    ],
    "authors":"Zhi-Yun Zhang, Anmin Lu & William G. D'Arcy"
  },
  {
    "group_title":"Verbenaceae through Solanaceae",
    "family":"Verbenaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10941",
    "knowledge_content":[
      "Shrubs or trees, sometimes climbing shrubs, rarely herbs. Indumentum of simple, stellate, and\/or other complex hairs. Leaves opposite or rarely whorled, without stipules, simple or 3-foliolate, less often palmately [or pinnately] compound. Inflorescences terminal or axillary, racemose, cymose, spicate, or thyrses. Flowers bisexual or polygamous by abortion, zygomorphic or rarely actinomorphic. Calyx persistent. Corolla 4- or 5- or more lobed; lobes usually spreading, aestivation overlapping. Fertile stamens inserted on corolla tube, alternate with lobes; filaments free; anthers dorsifixed, 1- or 2-locular, dehiscing by longitudinal slits or sometimes a circular pore. Ovary entire or 4-grooved, 2-8-locular; ovules 1 or 2 per locule, erect or pendulous. Style terminal, simple, entire or 2-cleft. Fruit a drupe or indehiscent capsule, sometimes breaking up into nutlets. Seeds (1 or)2-4, endosperm usually absent, seed coat thin; embryo straight, as long as seed; radicle short, inferior.",
      "Some 91 genera and ca. 2000 species: primarily tropical and subtropical, 20 genera and 182 species in China.\r",
      "Chinese genera of economic importance include Tectona (timber), Vitex (gum, oil, tannin, timber), Premna and Gmelina (fine wood), Callicarpa and Clerodendrum (ornamental), Callicarpa, Clerodendrum, Caryopteris, Premna, etc. (medicinal). Some species are only known in China as introduced ornamentals. Among these are Vitex agnuscastus Linnaeus and Holmskioldia sanguinea Retzius. According to H. Keng (pers. comm.), Teijsmanniodendron coriaceum (C. B. Clarke) Kostermans, a species characterized by indehiscent 1-seeded dry fruits, was collected near the Guangxi-Vietnam border and is expected to be found in China. The classification of Verbenaceae is in a state of flux, especially regarding its relationship to Lamiaceae. There is evidence to suggest a significant division between members of subfamily Verbenoideae, genera 1-5 in this account, and the remaining genera, including genera 6-20, which for convenience are here referred to as subfamily Viticoideae s.l. The latter are more closely allied to each other and to genera traditionally kept within Lamiaceae (including genera 1-8 in this Flora). Avicennia is often placed in a family of its own, but its affinities are clearly with Viticoideae, especially genera 17-19 in this account which have traditionally been placed in a separate subfamily, Symphorematoideae. P'ei Chien & Chen Shou-liang, eds. 1982. Verbenaceae. Fl. Reipubl. Popularis Sin. 65(1): 1-229.",
      "Inflorescences centripetal (lowermost flower or flower farthest from axis opening first), usually clearly racemose or spicate, sometimes condensed into capitula, always terminal; 1 or 2 stigma lobes prominently expanded (subfam. Verbenoideae).",
      "Inflorescences centrifugal (uppermost flower or flower closest to axis opening first), usually clearly cymose, sometimes grouped into elongated thyrses or reduced to axillary flowers or clusters of flowers; stigma lobes usually linear to tongue-shaped (capitate in Callicarpa) (subfam. Viticoideae).",
      "Inflorescences capitate, with conspicuous oblanceolate to spatulate involucral bracts; ovules apical, orthotropous.",
      "Inflorescences mostly lax, rarely capitate, always without clearly defined involucral bracts; ovules basal, anatropous.",
      "Stems strongly 4-winged; leaves soon falling, leaf blade much shorter than internodes; calyx divided to near base",
      "Stems terete or 4-angled, not winged; leaves persistent, leaf blade at least as long as most internodes; calyx tube as long as or longer than lobes.",
      "Flower bud not swollen at tip; stamens as many as corolla lobes; leaf hairs often branched or stellate, rarely all simple.",
      "Flower bud conspicuously swollen at tip; drupes with 4 1-seeded pyrenes, sometimes separating into 4 1-locular nutlets",
      "Flower buds not swollen at tip; drupes with 1 pyrene, normally 4-locular, 4-seeded or (by abortion) 3- or 2-seeded.",
      "Leaf blade abaxially gray mealy, often with large gland patches especially near base; corolla 2-5 cm, ventricose or funnelform; stigma lobes very unequal",
      "Leaf blade abaxially green or if gray or white then with dense simple hairs, without gland patches; corolla to 1 cm, tubular; stigma lobes (where known) equal.",
      "Inflorescences terminal cymes, panicles, or thyrses, sometimes racemelike or spikelike; calyx usually not 2-lipped but if 2-lipped then upper lip usually emarginate or dentate and if lower lip entire then upper lip also entire",
      "Inflorescences axillary, few flowered lax cymes; calyx obscurely 2-lipped with lower lip 2-lobed, upper lip entire"
    ],
    "authors":"Shou-liang Chen & Michael G. Gilbert"
  },
  {
    "group_title":"Scrophulariaceae through Gesneriaceae",
    "family":"Bignoniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10102",
    "knowledge_content":[
      "Trees, shrubs, or vines, climbers rarely herbs. Leaves opposite, alternate, or whorled, simple or pinnately compound, rarely palmately compound, without stipules, climbers usually with tendrils modified sometimes into hooks or suckers. Inflorescences cymose, paniculate, or racemose, terminal or axillary, rarely flowers borne on old stems; bracts and bractlets present, sometimes deciduous. Flowers bisexual, zygomorphic, usually large. Calyx campanulate or tubular, truncate, 2-5-dentate, or glandular subulate-dentate. Corolla campanulate or funnelform, usually bilabiate; lobes 5, imbricate or valvate. Fertile stamens 4 (didynamous) and staminode 1, or 2 and staminodes 3, rarely all 5 stamens fertile. Disc fleshy. Ovary superior, 2-locular, rarely 1- or 4-locular; placentation axile or parietal; ovules numerous. Style filiform; stigma 2-lobed. Capsule dehiscing loculicidally or septicidally, rarely fruit fleshy and indehiscent. Seeds numerous, usually winged or with tufts of hairs at both ends; endosperm absent.",
      "About 116-120 genera and 650-750 species: mostly in tropical and subtropical regions; 12 genera and 35 species (21 endemic) in China.\r",
      "Plants of the Bignoniaceae usually produce large flowers, and many species are widely cultivated in China as ornamentals. These include Arrabidaea magnifica Sprague ex Steenis, Campsis radicans (Linnaeus) Seemann, Catalpa speciosa (Warder ex Barney) Engelmann, Clytostoma callistegioides (Chamisso) Bureau & Schumann, Crescentia alata Kunth, C. cujete Linnaeus, Jacaranda cuspidifolia Martius, J. mimosifolia D. Don, Kigelia africana (Lamarck) Bentham, Macfadyena unguis-cati (Linnaeus) A. H. Gentry, Pandorea jasminoides (Linnaeus) Schumann, Parmetiera cerifera Seemann, Podranea ricasoliana (Tanfani) Sprague, Pyrostegia venusta (Ker-Gawler) Miers, Spathodea campanulata Beauvois, Stenolobium stans (Linnaeus) Seemann, Tabebuia chrysantha (Jacquin) G. Nicholson, T. rosea (Bertoloni) de Candolle, and Tecomaria capensis (Thunberg) Spach. Dolichandrone spathacea (L. f.) Schumann has recently been reported from Hainan (Yaichou, Wanning, Wenchan) and maritime Guangdong (see A Checklist of Flowering Plants of Isl. and Reefs of Hainan and Guangdong Province, 1994), but we have not examined Chinese material of the species. Tao Deding & Yin Wenqing. 1990. Bignoniaceae. In: Wang Wentsai, ed., Fl. Reipubl. Popularis Sin. 69: 1-62.",
      "Leaves pinnately or palmately compound; fertile stamens 4, didynamous or equal; seeds membranous winged.",
      "Leaves 1-pinnately compound; inflorescences racemose, terminal; stamens didynamous; capsule  long cylindric, floccose or villous",
      "Leaves 2-pinnately compound; inflorescences short racemose, borne on old stems; stamens  almost equal; capsule linear, glabrous",
      "Herbs perennial, biennial, or annual, with or without stems; capsule long horn-shaped; flowers  red or yellow"
    ],
    "authors":"Zhi-Yun Zhang & Thawatchai Santisuk"
  },
  {
    "group_title":"Scrophulariaceae through Gesneriaceae",
    "family":"Gesneriaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10368",
    "knowledge_content":[
      "Herbs, shrubs, or rarely trees. Leaves opposite or rarely alternate, whorled or basal, rosette forming; exstipulate; usually simple, rarely shallowly to deeply lobed, pinnately or rarely palmately veined. Inflorescences usually cymes, rarely racemes, axillary, often near apex and appearing terminal; usually pedunculate. Flowers perfect, zygomorphic, seldom actinomorphic. Calyx actinomorphic, rarely zygomorphic; usually (4 or)5-divided. Corolla gamopetalous, zygomorphic, rarely actinomorphic; usually 2-lipped. Fertile stamens 2 or 4, then often didynamous, rarely 5, epipetalous; anthers free or coherent, thecae 2, parallel, divergent, or divaricate; staminodes 1-3 or absent. Disc ringlike to cupular, rarely absent. Ovary superior in all Old World taxa [half inferior, or inferior], 1-loculed; gynophore seldom present; placentas (1 or)2, parietal, rarely 2-loculed, placenta 1 per locule and axile; ovules numerous, anatropous. Style 1; stigmas 1 or 2. Fruit usually capsular, loculicidal, septicidal, or circumscissile, rarely a berry, indehiscent. Seeds numerous, fusiform to ellipsoid or ovoid, minute, sometimes with appendages at 1 or both ends, with or without endosperm; embryo straight, cotyledons equal or unequal after germination.",
      "About 133 genera and 3000 species: Africa, Central and South America, E and S Asia, S Europe, Oceania; 56 genera (25 endemic) and 442 species (354 endemic) in China.\r",
      "A few foreign well-known ornamental species are cultivated in China, including the florist's gloxinia, Sinningia speciosa (Loddiges) Hiern, and African violet, Saintpaulia ionantha Wendland. The two ovary carpels may each produce a stigma; these stigmas are fused into a single structure. Some students of Gesneriaceae have considered the stigma to be single and either simple (capitate) or 2-lobed, whereas others consider each of the two stigmas as units. We have maintained the latter usage, but a family-wide investigation of stigma development is needed. The distinction can be blurred, however, because the stigmas may be completely fused into one with a capitate apex (as in Didymocarpus) or one of the two carpels or stigmas may be aborted resulting in a single stigma that may or may not be 2-lobed. Certain characters used in this treatment require some explanation. Disc shape is frequently described as \"ringlike,\" \"cupular,\" or rarely \"tubular\"; ringlike describes a disc that is shorter than or equalling its diameter, and cupular describes one that is longer than its diameter. Tubular describes a disc which is at least twice as long as wide. The corolla tube diameter measurement is for the widest part, usually the mouth. Wang Wentsai, Pan Kaiyu, & Li Zhenyu. 1990. Gesneriaceae. In: Wang Wentsai, ed., Fl. Reipubl. Popularis Sin. 69: 125-581.",
      "Inflorescences racemose; seeds with scalelike appendages at both ends; flowers sometimes replaced by propagules",
      "Flowers solitary or inflorescences cymose (including umbel-like or paniculate cymes), sometimes racemelike and 1-sided; seeds either not appendiculate or with subulate or hairlike appendages at 1 or both ends (unknown in Calcareoboea. Dayaoshania, Gyrogyne. Lagarosolen. Paraisometrum,and Thamnocharis); flowers never replaced by propagules.",
      "Corolla actinomorphic, 4- or 5-lobed; stamens 4 or 5, staminodes absent; seeds unappendaged (unknown in Thamnocharis).",
      "Corolla zygomorphic, usually distinctly 2-lipped or rarely actinomorphic; fertile stamens (1 or)2 or 4, staminodes absent or 1-3; seeds appendaged or unappendaged.",
      "Corolla suburceolate, tube longer than limb; stamens included, anther thecae divergent, confluent apically; capsule 4-valved",
      "Corolla rotate or campanulate, tube 1\/3-1 X limb; stamens equalling corolla or exserted, anther thecae parallel, not confluent; capsule 2-valved.",
      "Anthers connate into a tube surrounding style, connectives with long apical projections; disc absent; inflorescences umbel-like cymes; leaves 1 to few",
      "Anthers free, connectives without projections; disc ringlike; inflorescences cymes; leaves few to many.",
      "Bracts 2, opposite; corolla purple to blue, deeply 4- or 5-lobed, tube rotate; stamens adnate to corolla near base, anthers basifixed; stigma 1, nearly truncate or punctiform; leaf blade base cuneate",
      "Bracts 6-9 to numerous, crowded, involucrate; corolla white, 4- or 5-lobed, tube campanulate; stamens adnate to corolla tube near or above middle, anthers dorsifixed; stigmas 2, equal, oblate to 2-lipped; leaf blade base truncate to cordate",
      "Calyx plicate between lobes; corolla tube campanulate, spurred or saccate at base; stamens 4; ovary depressed globose or subglobose.",
      "Calyx not plicate; corolla tube funnelform to tubular, cylindric, salverform, urceolate, or campanulate, base usually not swollen, rarely saccate, sometimes gibbous abaxially; stamens (1 or)2 or 4; ovary linear to oblong or ovoid, rarely subglobose or globose.",
      "Leaves slightly unequal in a pair; adaxial corolla lip ca. 1\/2 as long as abaxial lip; anthers free, thecae not confluent",
      "Leaves strongly unequal in a pair, smaller much reduced; adaxial corolla lip as long as abaxial lip; anthers coherent laterally to form a shallow cone, thecae confluent at apex",
      "Capsule ovoid to depressed globose, shorter than calyx; ovary ovoid to depressed globose; inflorescences cymose, sympodial, or scorpioid, racemose; bract apparently absent or 1; stem leaves 1 to few.",
      "Capsule linear to ovoid, much surpassing calyx, rarely shorter than calyx, then leaves all basal (fruit unknown in Paraisometrum); ovary usually linear to oblong, rarely ellipsoid, linear-lanceolate, conical, or ovoid; flowers solitary or inflorescences cymose including paniculate or umbel-like cymes; bracts 2, rarely apparently absent, 1, or 3; leaves basal or on stem, few to many.",
      "Leaves opposite, strongly unequal in a pair, smaller much reduced and sessile; inflorescences apparently without bracts; calyx with many longitudinal secretory canals; staminode 1; ovary 2-loculed; placenta 1, axile",
      "Leaves alternate, or lowest stem leaf only unpaired, adaxial ones usually opposite and equal or nearly so in a pair; bract 1; calyx without secretory canals; staminodes 2, 3, or absent; ovary 1-loculed; placentas 2, parietal.",
      "Leaves few, all alternate; inflorescences lax racemes appearing scorpioid; stamens 2 and abaxial, or 4; capsule loculicidal",
      "Leaves 1 to few, lowest leaf unpaired, those near apex usually opposite; inflorescences scorpioid cymes, dense; stamens 2, adaxial; capsule circumscissile",
      "Calyx zygomorphic, 2-lipped, adaxial lip undivided, abaxial lip 4-lobed; disc tubular; capsule narrowly ellipsoid",
      "Calyx actinomorphic, 5-lobed to 5-sect from base; disc ringlike, rarely cupular or inconspicuous; capsule oblong to linear, rarely conical to ovoid.",
      "Adaxial corolla lip 2-lobed, equalling or much shorter than abaxial lip, abaxial lip 3-lobed or 3-sect.",
      "Abaxial corolla lip densely bearded inside; bracts apparently absent; corolla tube tubular; anthers coherent in pairs, thecae divaricate",
      "Corolla glabrous to puberulent inside; bracts 2, rarely absent or several; corolla tube campanulate to broadly tubular, sometimes oblique, sometimes saccate at base, throat some- times constricted; anthers free or all 4 coherent together, thecae parallel or subparallel.",
      "Anthers of all 4 stamens coherent together; capsule oblique in relation to pedicel; adaxial corolla lip distinctly shorter than abaxial",
      "Anthers free; capsule straight in relation to pedicel; adaxial corolla lip slightly shorter than to as long as abaxial.",
      "Ovary oblong; anther thecae parallel, not confluent, seldom horseshoe-shaped, then thecae divaricate and confluent at apex; corolla tube 1-4 X longer than limb; leaf blade base cuneate to subcordate",
      "Ovary ovoid or conical; anther thecae subparallel, confluent at apex; corolla tube slightly shorter than limb; leaf blade base cuneate to attenuate",
      "Corolla tube subcampanulate to funnelform-tubular, not swollen; stamens adnate to corolla near base, all or only abaxial ones exserted, anthers free, thecae confluent at apex",
      "Corolla tube narrowly funnelform to cylindric, slightly gibbous abaxially; stamens adnate to corolla tube above or rarely below middle, usually included, rarely exserted, anthers coherent in pairs, thecae not confluent",
      "Ovary 2-loculed, only adaxial locule fertile; placenta 1, axile; capsule oblique in relation to pedicel; cymes 1-3-flowered",
      "Ovary 1-loculed; placentas 2, parietal; capsule straight in relation to pedicel; cymes 1- to many flowered.",
      "Corolla tube narrowly campanulate, gibbous abaxially, (0.7-)1-2(-2.6) cm in diam., abaxial lip 3-lobed",
      "Corolla tube cylindric to funnelform, broadly tubular, campanulate, urceolate, or salverform, not swollen, slightly gibbous abaxially, or slightly ampliate basally, 0.2-1(-1.2) cm in diam., abaxial lip 3-sect, rarely 3-lobed.",
      "Anthers dehiscing longitudinally from arcuate slits; corolla zygomorphic, rarely actinomorphic, tube campanulate, cylindric, or rarely urceolate or salverform, not swollen",
      "Anthers dehiscing longitudinally, rarely transversely; corolla zygomorphic, tube campanulate-cylindric to broadly tubular, sometimes ampliate basally, throat sometimes constricted or narrowly funnelform to cylindric, slightly gibbous abaxially.",
      "Corolla purple to blue or white or yellow to red, tube campanulate-cylindric to broadly tubular, sometimes ampliate basally, throat sometimes constricted, adaxial lip 2-lobed; anthers free; calyx 5-sect from base",
      "Corolla orange to yellow or white, rarely pink, tube narrowly funnelform to cylindric, slightly gibbous abaxially, adaxial lip 2-lobed, emarginate, or rarely undivided; anthers coherent in pairs; calyx 5-sect from base to 5-lobed from above middle",
      "Ovary 2-loculed, only adaxial locule fertile; placenta 1, axile; capsule oblique in relation to pedicel; corolla tube tubular-funnelform; cymes 1-3-flowered",
      "Ovary 1-loculed; placentas 2, parietal; corolla tube cylindric to broadly tubular or narrowly campanulate, sometimes ampliate above; capsule straight in relation to pedicel; cymes 1- to many flowered.",
      "Calyx zygomorphic, 2-lipped, adaxial lip undivided, abaxial lip 4-lobed; disc tubular; capsule splitting along 1 suture",
      "Calyx actinomorphic, 5-sect from base or 5-lobed, segments equal or unequal; disc ringlike, inconspicuous or absent; capsule 2(or 4)-valved.",
      "Leaves 1(or 2), apical on stem; leaf blade base cordate to auriculate; anthers dehiscing from fissures or cracks; capsule slightly longer than calyx",
      "Leaves few to many, opposite, rarely whorled, spread along stem or crowded near stem apex; leaf blade base cuneate to attenuate or rounded, rarely cordate; anthers dehiscing longitudinally, poricidally, or transversely; capsule much longer than calyx.",
      "Seeds with 1 subulate or hairlike appendage at each end, or with up to 50 appendages at hilar end; corolla tube narrowly tubular to funnelform-tubular or subtubular, longer or much longer than limb, 4-17 mm in diam.; ovary linear; stamens adnate to corolla tube near or above middle, anthers usually coherent in pairs.",
      "Seeds unappendaged; corolla tube campanulate, shorter than to slightly longer than limb, 3-9 mm in diam.; ovary ovoid, ellipsoid, or conical; stamens adnate to corolla near or slightly above base, anthers free or all 4 coherent together.",
      "Corolla white to yellowish, tube subtubular, gibbous abaxially near limb, with 2 arcuate projections abaxially inside; stamens included, thecae confluent at apex; seeds with 1 subulate appendage at each end",
      "Corolla red to orange, seldom greenish, yellow, or white, tube narrowly tubular to funnelform-tubular, often curved, not swollen, inside sparsely puberulent, sparsely glandular puberulent, glabrous, or with a hair ring; stamens usually exserted, thecae not confluent; seeds with 1 hairlike appendage at each end or up to 50 appendages at hilar end",
      "All anthers coherent together; capsule oblique in relation to pedicel; leaf blade base cordate to cuneate",
      "Corolla yellowish, tube slightly longer than limb; anther thecae not confluent; ovary ellipsoid; cymes 3-5-flowered",
      "Corolla white to pink or blue to purple, tube slightly shorter than limb; anther thecae confluent at apex; ovary ovoid or conical; cymes 1- to many flowered",
      "Flowers solitary; capsule valves spirally twisted; corolla tube campanulate-tubular, adaxial lip slightly shorter than abaxial",
      "Inflorescences cymes, sometime spikelike or racemelike, 2-10-flowered; capsule valves straight, not twisted; corolla tube slender funnelform, funnelform, or funnelform-tubular, adaxial lip much shorter than abaxial.",
      "Bracts forming a globose involucre; corolla tube much longer than limb; leaf blade base attenuate to broadly cuneate; stamens adnate to corolla tube below middle, anthers coherent by adaxial surfaces, thecae divaricate, confluent",
      "Bracts not forming an involucre; corolla tube longer than limb; leaf blade base cuneate to rounded or cordate; stamens adnate to corolla tube near middle, anthers coherent at apex, thecae parallel, not confluent at apex.",
      "Stigmas equal, oblate or semiorbicular, undivided; calyx 5-sect from base; stamens adnate to corolla tube near mouth, slightly exserted",
      "Stigmas unequal, smaller 1 truncate or triangular, undivided, larger 1 narrowly obtrapeziform, emarginate; calyx 5-lobed; stamens adnate to corolla tube near middle, included.",
      "Subshrubs or rarely lianas, usually epiphytic, less frequently epipetric or terrestrial; seeds with 1 appendage at each end",
      "Herbs, rarely subshrubs (rarely shrubs outside China), always terrestrial or epipetric; seeds unappendaged.",
      "Anthers basifixed, thecae parallel, not confluent at apex; bracts 2, forming a globose to ovoid involucre.",
      "Anthers dorsifixed, thecae divaricate, confluent at apex; bracts 2, not forming an involucre, rarely up to 7 and whorled, 1, or absent.",
      "Ovary 1-loculed; placenta parietal; capsule dehiscing on both sides; corolla inside glabrous; tube somewhat gibbous abaxially, adaxial lip inconspicuous, much shorter than abaxial lip",
      "Ovary 2-loculed, only adaxial locule fertile; placenta axile; capsule dehiscing only adaxially; corolla inside usually with a ring of hairs; tube not swollen, adaxial lip shorter than to nearly as long as abaxial",
      "Stamens adnate to abaxial side of corolla tube near or above middle; capsule valves straight, not twisted.",
      "Stamens adnate to abaxial side of corolla tube near base; capsule valves usually at least slightly twisted.",
      "Anthers dehiscing longitudinally from straight or arcuate slits; disc inconspicuous or ringlike; stigma capitate, seldom subligulate; calyx actinomorphic, rarely slightly zygomorphic.",
      "Leaf blade adaxially woolly to glabrous, abaxially woolly, pannose, or velutinous, hairs interwoven, usually branched; corolla inside glabrous to glandular puberulent; tube longer than to occasionally nearly equalling limb",
      "Inflorescences dense umbel-like cymes; corolla tube 4-5 X longer than limb, adaxial lip longer than abaxial; stamens adnate to corolla tube above middle",
      "Inflorescences lax cymes; corolla tube shorter than limb, adaxial lip slightly shorter than abaxial; stamens adnate to corolla tube near base",
      "Anthers dehiscing longitudinally; stigmas 1 or 2, if 1 then usually capitate, globose, disclike, truncate, lamelliform, oblate, or obtrapeziform, rarely linear or subligulate; capsule valves straight or twisted.",
      "Corolla tube tubular to funnelform-tubular, longer than limb; stamens exserted, anthers basifixed, free or coherent at apex, thecae parallel, not confluent; leaf blade base broadly cuneate to subrounded",
      "Corolla tube broadly tubular, nearly equalling limb; stamens included, anthers dorsifixed, coherent by adaxial surfaces, thecae divaricate, confluent at apex; leaf blade base cordate",
      "Anthers dorsifixed, stamens slightly exserted; placentas undivided; inflorescences monochasial cymes, 1- or 2-flowered",
      "Anthers basifixed, stamens included; placentas projecting inward, 2-cleft; inflorescences cymes, sometimes umbel-like, 1- to many flowered.",
      "Corolla tube 1.5-4 X longer than limb, 3.5-17 mm in diam.; stamens adnate to adaxial side of corolla tube near middle, rarely near base; ovary and capsule linear",
      "Corolla tube shorter than limb, 2-5 mm in diam.; stamens adnate to abaxial side of corolla tube near base; ovary conical to broadly ovoid; capsule narrowly ellipsoid to oblong to ovoid",
      "Anthers coherent, thecae confluent at apex; capsule linear to narrowly ovoid, ellipsoid, or oblong; leaf blade base attenuate to cordate, rarely auriculate or auriculate-peltate.",
      "Capsule valves spirally twisted or seldom straight, if straight leaf blade abaxially woolly, pannose, or velutinous, hairs dense, interwoven, usually branched.",
      "Capsule valves straight, not twisted; leaf blade abaxially strigose or puberulent to villous, velutinous, or woolly.",
      "Capsule valves 4; leaf blade abaxially woolly, pannose, or velutinous, hairs very dense, interwoven, usually branched",
      "Corolla tube suburceolate-tubular, 1-2.5 mm in diam., limb indistinctly 2-lipped, adaxial lip slightly shorter than abaxial; lobe apex acute; stamens adnate to abaxial side of corolla tube slightly above base",
      "Corolla tube funnelform-tubular to campanulate or cylindric, 2-20 mm in diam., limb 2-lipped; adaxial lip slightly to 1.5-3.5 X shorter than abaxial; lobe apex rounded, rarely obtuse to acute; stamens adnate to abaxial side of corolla tube near or above middle."
    ],
    "authors":"Wencai Wang, Kai-yu Pan, Zhen-yu Li, Anna L. Weitzman & Laurence E. Skog"
  },
  {
    "group_title":"Scrophulariaceae through Gesneriaceae",
    "family":"Martyniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10540",
    "knowledge_content":[
      "Herbs annual or perennial, sometimes with tuberous roots, usually viscid pubescent with uniseriate glandular hairs. Leaves opposite, alternate on upper parts of stem, simple, without stipules. Inflorescences terminal racemes; bracts small, deciduous; bractlets 1 or 2. Flowers bisexual, zygomorphic. Calyx of 5 free or partly connate sepals. Corolla tubular, campanulate, or funnelform, laterally enlarged, bilabiate; lobes 5, imbricate. Stamens 2 or 4, inserted at base of corolla tube, adherent; anthers spreading. Disc annular. Ovary superior, 1-locular; parietal placentas T-shaped in section, false septa usually present; ovules few to numerous. Fruit with a fleshy exocarp soon disintegrating and exposing woody endocarp, with woody appendages including apical horns partly derived from style. Seeds black, rugose.",
      "Three or four genera and 17-20 species: tropical and subtropical parts of America; one species naturalized in China.\r"
    ],
    "authors":"Zhi-Yun Zhang & Heidrun E. K. Hartmann"
  },
  {
    "group_title":"Scrophulariaceae through Gesneriaceae",
    "family":"Orobanchaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10639",
    "knowledge_content":[
      "Herbs annual, biennial, or perennial parasites, without chlorophyll. Stems unbranched or sometimes branched. Leaves scalelike, spirally or subimbricately arranged. Inflorescences racemose, spicate, or subcapitate, rarely 1-flowered; bract 1, usually similar to leaves; bractlets 2, adnate to base of calyx or pedicel. Flowers bisexual, subsessile or pedicelled. Calyx tubular, cupular, or campanulate, (3 or)4-6-lobed, 2-6-parted, 6-toothed, or spathelike, sometimes absent or of 3 free sepals. Corolla bilabiate, usually curved, sometimes tubular-campanulate or funnelform with 5 subequal lobes; upper lip entire, emarginate, or 2-lobed; lower lip 3-lobed. Stamens 4, didynamous, inserted at base of corolla tube; filaments slender; anthers 2-celled, dehiscing longitudinally, sometimes 1 cell fertile and another sterile or reduced to spur. Pistil 2- or 3-carpellate; ovary superior; placentas 2-4 or 6(-10), parietal or sometimes axile at ovary base; ovules 2-4 or numerous, anatropous. Style long; stigma inflated, discoid, peltate, or 2-4-lobed. Capsule usually dehiscing loculicidally by 2 or 3(or 4) valves. Seeds minute, testa pitted or reticulate.",
      "About 15 genera and 150 species: North Temperate regions, less represented in Africa, America, Asia, and Australia; nine genera and 42 species (nine endemic) in China.\r",
      "Genera 1-4 are assigned to the tribe Orobancheae (inflorescences racemose or spicate, rarely branched or flowers solitary, borne well above soil surface; mechanical tissue in 1 or 2 rings), whereas genera 5-8 are placed in the tribe Gleadovieae Popov (inflorescences subcapitate or subcorymbose, borne near soil surface; mechanical tissue absent). Although Lathraea has traditionally been placed in the Orobanchaceae (see Beck in Engler, Pflanzenr. IV. 261(Heft 96): 1-348. 1930), more recent authors (e.g.,Tzvelev, Fl. URSS 23: 19-117. 1958; Webb, Fl. Europ. 3: 281. 1972; Teryokhin et al., Determinator of broomrapes of the USSR Flora. 1993; Yamazaki, Fl. Japan 3a: 373. 1993) exclude the genus from the Orobanchaceae and place it in the Scrophulariaceae. In fact, one of us, N. N. Tzvelev, believes that Lathraea should be placed near Tozzia Linnaeus of the Scrophulariaceae. The genus is tentatively placed here as a link with the Scrophulariaceae. Zhang Zhiyun. 1990. Orobanchaceae. In: Wang Wentsai, ed., Fl. Reipubl. Popularis Sin. 69: 69-124.",
      "Calyx not spathelike, cupular, campanulate, tubular, or of 2 or 3 deciduous sepals, rarely absent; flowers in distinct  inflorescences, sessile or on pedicels to 2 cm.",
      "Inflorescences spicate or racemose, rarely branched, borne well above soil surface; stems aboveground, with  1 or 2 rings of mechanical tissue.",
      "Inflorescences subcapitate or subcorymbose, borne near soil surface; stems usually underground, without a  mechanical tissue.",
      "Stamens exserted from corolla; calyx cupular, irregularly and obtusely 2-5-lobed or toothed, lobes or  teeth deciduous",
      "Placentas 4; calyx cupular or rarely campanulate, 4- or 5-toothed, often divided into 2 lateral,  entire or divided segments",
      "Aeginetia  LinnaeusBoschniakia  C. A. MeyerChristisonia  GardnerCistanche  Hoffmannsegg & LinkGleadovia  Gamble & PrainLathraea  LinnaeusMannagettaea  Harry SmithOrobanche  LinnaeusPhacellanthus  Siebold & Zuccarini"
    ],
    "authors":"Zhi-Yun Zhang & Nikolai N. Tzvelev"
  },
  {
    "group_title":"Scrophulariaceae through Gesneriaceae",
    "family":"Pedaliaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10658",
    "knowledge_content":[
      "Herbs annual or perennial, rarely shrubs or trees, sometimes with swollen stems. Leaves opposite, sometimes alternate on upper part of stem, densely covered with 4-merous mucilaginous glands; stipules absent. Flowers zygomorphic, solitary, axillary, rarely in few-flowered cymes. Pedicel with extrafloral nectaries. Calyx (4 or)5-parted. Corolla bilabiate or obscurely so; lobes 5, imbricate. Stamens 4 and didynamous, sometime 2; staminodes usually 1; anthers 2-locular, dehiscing longitudinally. Disc fleshy. Ovary superior or rarely inferior, 2- or 4-locular; placentation axile; ovules 2 to numerous, anatropous. Style filiform; stigma 2-lobed. Fruit dehiscent or indehiscent, winged or usually with horns or hooks. Seeds 1 to many in each locule.",
      "About 13 or 14 genera and 62-85 species: primarily tropical and subtropical parts of the Old World, especially Africa; two genera and two species in China.\r"
    ],
    "authors":"Zhi-Yun Zhang & Heidrun E. K. Hartmann"
  },
  {
    "group_title":"Scrophulariaceae through Gesneriaceae",
    "family":"Scrophulariaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10811",
    "knowledge_content":[
      "Herbs, sometimes shrubs, rarely trees; mostly autotrophic, less often hemiparasitic or parasitic. Stipules absent. Leaves alternate, opposite, whorled, or basally opposite and apically alternate, simple or sometimes pinnately dissected. Inflorescences racemes, spikes, or thyrsoid panicles, determinate or indeterminate, or flowers solitary. Flowers perfect, usually zygomorphic, rarely actinomorphic. Calyx often persistent, (2-)4- or 5-lobed or -parted, variously connate. Corolla sympetalous; limb (3 or)4- or 5-lobed, often 2-lipped. Stamens mostly 4, didynamous, sometimes 1 or 2 staminodes present, less often 2 or 5 stamens; anther locules 1 or 2, equal or subequal, free or confluent. Nectary often present at base of ovary, ringlike, cupular, or reduced to a gland. Ovary superior, 2-loculed, rarely apically 1-loculed; ovules numerous, rarely 2 per locule, on axile placentas, anatropous or hemitropous. Style simple; stigma capitate, 2-lobed, or 2-lamellate. Fruit a capsule, septicidal, loculicidal, or septifragal, sometimes opening by pores or irregularly dehiscent, rarely a berry. Seeds minute or rarely conspicuous, sometimes winged; testa often reticulate; hilum lateral or ventral; endosperm fleshy or absent; embryo straight or curved.",
      "About 220 genera and 4500 species: cosmopolitan; 61 genera (seven endemic) and 681 species (415 endemic) throughout China but with a greater concentration in SW China.\r",
      "Tsoong Puchiu & Yang Hanbi, eds. 1979. Scrophulariaceae (1). Fl. Reipubl. Popularis Sin. 67(2): 1-431. Tsoong Puchiu, ed. 1963. Scrophulariaceae (2). Fl. Reipulb. Popularis Sin. 68: 1-449.",
      "Herbs, sometimes woody at base; calyx herbaceous or membranous; stems and leaves without stellate hairs.",
      "Corolla base spurred, lower lip convex and dilated toward upper lip in center, almost sealing throat, making corolla personate",
      "Plants aquatic or terrestrial, never floating; stems creeping and also erect; leaves and flowers never in a basal tuft.",
      "Outermost sepals not cordate; anther locules parallel; stigma dilated, capitate, or 2-lobed; capsule loculicidal or 4-valved",
      "Staminode 1, in center of corolla upper lip; anther locules confluent, reniform and transverse; filaments apically dilated.",
      "Staminodes 2 if present, anterior; anthers not transverse (except in some Gratiola and Verbascum); filaments not dilated.",
      "Plants more than 10 cm tall; flowers in cymes, rarely axillary, never fascicled; pedicel conspicuous; corolla tube short and thick",
      "Plants less than 10 cm tall; flowers solitary or fascicled in axils; pedicel inconspicuous; corolla tube elongated.",
      "Flowers solitary; corolla obscurely 2-lipped, subactinomorphic; petiole ca. 2 X as long as leaf blade",
      "Stamens 2, staminodes absent; corolla (3 or)4-lobed, actinomorphic or slightly zygomorphic, if 2-lipped, then lower lip often 1- or 2-lobed.",
      "Stamens 4 or if 2, then 2 staminodes present abaxially; corolla conspicuously 2-lipped, lower lip 3-lobed, upper 2-lobed or entire, or 5-lobed and subactinomorphic (corolla 4-lobed in Neopicrorhiza but then basal leaves rosulate).",
      "Calyx parted to base on lower side, spathelike or sometimes also 2-lobed adaxially; leaves mostly basal; fruit drupaceous, indehiscent",
      "Calyx lobes 4 or if 5 then upper one much smaller than other lobes; stamens included in corolla; stigma capitate or clavate.",
      "Corolla limb conspicuously 2-lipped with strongly reflexed lower lip, tube conspicuous; leaves alternate",
      "Corolla limb weakly 2-lipped, often subrotate, tube usually weakly developed; leaves opposite, whorled, or alternate.",
      "Racemes terminal, long and densely spicate; bracts small and narrow; capsule subglobose, slightly compressed; corolla with conspicuous tube and slightly 2-lipped limb; stems mostly more than 30 cm tall",
      "Racemes axillary or terminal, usually short and lax, if raceme terminal then lower bracts similar to leaves; capsule usually strongly compressed; corolla mostly with short tube and subrotate limb; stems mostly less than 25 cm tall",
      "Leaves on stems and also basal (Triaenophora scapose but leaves very large); rhizomes slender if present; inflorescences mostly racemose.",
      "Upper corolla lip straight or revolute, never galeate; anther locules rarely mucronate, base often obtuse.",
      "Leaves alternate; upper corolla lip rostrate, conspicuously longer than lower lip; anther locules unequal in length or free, or anthers 1-loculed.",
      "Leaves opposite; upper corolla lip galeate, as long as lower lip; anther locules equal in length, connivent.",
      "Anther locules 2, unequal in length; calyx unequally 4-lobed, parted to middle medianly, more shallowly laterally; corolla lower lip lobes patent",
      "Calyx upper side parted to middle, lower side and laterally shallowly parted, strongly inflated and utriculate in fruit; seeds compressed, often winged; branches and leaves subappressed to main stem",
      "Calyx equally parted or more deeply parted medianly, not inflated in fruit; seeds not compressed; branches and leaves spreading.",
      "Capsule 1-4-seeded; seeds large and smooth; bracts dentate to setose dentate, rarely entire; upper corolla lip densely bearded at margin",
      "Capsule with numerous seeds; seeds small and sculptured; bracts often entire; upper corolla lip not bearded at margin.",
      "Capsule regularly loculicidally dehiscent; sinuses between calyx lobes often 1-3-toothed; corolla yellow, more than 2.5 cm",
      "Capsule loculicidally dehiscent on 1 side (only 1 locule dehiscent); sinuses between calyx lobes toothless; corolla pale purple or white, less than 2 cm",
      "Leaves palmatisect; capsule emarginate; upper corolla lip slightly arching forward, obscurely galeate, parted to middle",
      "Leaves pinnatisect, pinnatifid, or serrate; capsule apex tapered; upper corolla lip conspicuously galeate, entire or shallowly 2-lobed.",
      "Calyx 2-5-lobed; corolla upper lip galeate and often extending into a narrow beak; leaves pinnatifid to pinnatisect",
      "Corolla tube straight; inflorescences spicate, flowers crowded; lower leaves broad and dentate, upper narrow and entire; hemiparasitic",
      "Corolla tube apically curved; inflorescences laxly spicate; all leaves narrow, entire, rarely dentate, sometimes reduced to scales; parasitic",
      "Calyx covering corolla tube, inflated after flowering; corolla subcampanulate; at least lower leaves opposite, 3-veined",
      "Calyx neither winged nor conspicuously angular, parted into 5 conspicuous lobes, lobes sometimes secondarily lobed.",
      "Calyx inflated, bladderlike in fruit, mouth truncate or obliquely truncate; filaments not appendiculate.",
      "Fertile stamens 4; terrestrial herbs (some species of Mimulicalyx and Lindernia aquatic or marsh herbs).",
      "Calyx parted to slightly beyond middle; stems succulent; filaments straight at apex; anthers glabrous",
      "Stems scaly near base, much branched and broomlike; leaves few, sessile, linear or scalelike, alternate apically on stem; xerophytic",
      "Stems terete (quadrangular in Mazus lanceifolius); upper corolla lip outer in bud, enveloping lower one.",
      "Calyx parted almost to base, sometimes less so; capsule often elongated; filaments often appendiculate",
      "Stems and leaves glandular hairy; stem leaves opposite; anther locules separated by a stalked connective",
      "Stems and leaves glabrous or eglandular villous; basal leaves usually well developed, sometimes rosulate, upper stem leaves often alternate; anther locules apically connivent"
    ],
    "authors":"Deyuan Hong, Hanbi Yang, Cun-li Jin, Manfred A. Fischer, Noel H. Holmgren & Robert R. Mill"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Acanthaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10002",
    "knowledge_content":[
      "Prostrate, erect, or rarely climbing herbs (annual or perennial), subshrubs, shrubs, or rarely small trees, usually with cystoliths (except in following Chinese genera: Acanthus, Blepharis, Nelsonia, Ophiorrhiziphyllon, Staurogyne, and Thunbergia), isophyllous (leaf pairs of equal size at each node) or anisophyllous (leaf pairs of unequal size at each node). Branches decussate, terete to angular in cross-section, nodes often swollen, sometimes spinose with spines derived from reduced leaves, bracts, and\/or bracteoles. Stipules absent. Leaves opposite [rarely alternate or whorled]; leaf blade margin entire, sinuate, crenate, dentate, or rarely pinnatifid. Inflorescences terminal or axillary spikes, racemes, panicles, or dense clusters, rarely of solitary flowers; bracts 1 per flower or dichasial cluster, large and brightly colored or minute and green, sometimes becoming spinose; bracteoles present or rarely absent, usually 2 per flower. Flowers sessile or pedicellate, bisexual, zygomorphic to subactinomorphic. Calyx synsepalous (at least basally), usually 4- or 5-lobed, rarely (Thunbergia) reduced to an entire cupular ring or 10-20-lobed. Corolla sympetalous, sometimes resupinate 180º by twisting of corolla tube; tube cylindric or funnelform; limb subactinomorphic (i.e., subequally 5-lobed) or zygomorphic (either 2-lipped with upper lip subentire to 2-lobed and lower lip 3-lobed, or rarely 1-lipped with 3 lobes); lobes ascending or descending cochlear, quincuncial, contorted, or open in bud. Stamens epipetalous, included in or exserted from corolla tube, 2 or 4 and didynamous; filaments distinct, connate in pairs, or monadelphous basally via a sheath (Strobilanthes); anthers with 1 or 2 thecae; thecae parallel to perpendicular, equally inserted to superposed, spherical to linear, base muticous or spurred, usually longitudinally dehiscent; staminodes 0-3, consisting of minute projections or sterile filaments. Disk annular and nectar-producing at base of ovary. Ovary superior, 2-locular, placentation axile, with 2 to many ovules per locule; style filiform, simple; stigma funnel-shaped or 2-lobed (one lobe sometimes suppressed), one or both lobes sometimes recurved or recoiled. Fruit a loculicidal, stipitate or not, 2-valved, explosively dehiscent capsule [rarely drupaceous], 2- to many seeded, apex with or without a beak; septa remaining attached to or separating from inner wall of mature capsule. Seeds usually borne on hooklike retinacula (attached to septa of capsule), or retinacula lacking (Nelsonia, Ophiorrhiziphyllon, Staurogyne, Thunbergia), surface smooth or roughened, pubescent or lacking trichomes, sometimes with hygroscopic trichomes that expand when moistened.\r",
      "About 220 genera and ca. 4,000 species: pantropical and subtropical, with a few species in temperate regions; 35 genera (one endemic) and 304 species (134 endemic, eight introduced) in China.",
      "Pollen characters have traditionally been important in delimiting genera and higher taxa in the family; they are used sparingly in the key below.Avicennia Linnaeus, usually placed in either Verbenaceae (and treated as such in Fl. China 17: 49. 1994) or Avicenniaceae, is now included in Acanthaceae on the basis of molecular phylogenetic studies (e.g., A. E. Schwarzbach & L. A. McDade, Syst. Bot. 27: 84-98. 2002).The major economic importance of the family is horticultural. Species of Acanthus, Aphelandra R. Brown, Barleria, Crossandra Salisbury, Eranthemum, Fittonia Coemans, Justicia, Odontonema Nees, Pachystachys Nees, Ruellia, Sanchezia Ruiz & Pavon, Thunbergia, and numerous other genera are widely cultivated as ornamentals. Many species are cultivated in China but not treated in the present account. These include: Aphelandra squarrosa Nees, Barleria lupulina Lindley, Crossandra infundibuliformis (Linnaeus) Nees, Eranthemum pulchellum Andrews, Fittonia albivenis (Veitch) Brummitt, Justicia betonica Linnaeus, J. brandegeeana Wasshausen & L. B. Smith, J. carnea Lindley, Pachystachys lutea Nees, Ruellia elegans Poiret, R. simplex C. Wright, Sanchezia parvibracteata Sprague & Hutchinson, Thunbergia erecta (Bentham) T. Anderson, and T. laurifolia Lindley.Hu Chiachi & Tsui Hongpin. 2002. Acanthaceae. In: Hu Chiachi, ed., Fl. Reipubl. Popularis Sin. 70: 1-309.",
      "Vines; calyx cupular with 10-20 lobes or reduced to an entire ring; capsule with a prominent apical sterile beak; seeds not borne on hooklike retinacula.",
      "Prostrate or erect herbs, shrubs, or rarely small trees; calyx 4- or 5-lobed; capsule lacking a prominent apical sterile beak; seeds borne on hooklike retinacula or not",
      "Seeds laterally compressed, borne on hooklike retinacula; corolla 1-lipped (upper lip absent), lobes not with descending cochlear aestivation; anthers 1-thecous",
      "Seeds subspherical or blocky, not borne on hooklike retinacula; corolla 2-lipped, lobes with descending cochlear aestivation; anthers 2-thecous",
      "Leaves opposite; flowers not subtended by up to 5 pairs of bracts; seeds lacking hygroscopic trichomes; lower filaments without an apical appendage.",
      "Leaves usually in pseudo-whorl of 4; flowers subtended by up to 5 pairs of bracts; seeds with hygroscopic trichomes; lower filaments with an apical appendage.",
      "Stamens 4, included or slightly exserted from mouth of corolla; anther thecae of a pair parallel; staminodes 0 or 1.",
      "Calyx lobes heteromorphic, posterior lobe usually largest, anterior lobes connate to a greater degree than other lobes, lateral lobes smallest and innermost; corolla lobe aestivation quincuncial",
      "Calyx lobes homomorphic (or nearly so; sometimes partially fused to form a bipartite or tripartite calyx in Strobilanthes), not as described above; corolla lobe aestivation not quincuncial",
      "Style held in place by trichomes on one side of corolla tube; stamens monadelphous (by a sheath) at base.",
      "Inflorescence secund strobilate spikes with orbicular to reniform bracts; ovules 2 per locule; seeds to 4 per capsule; corolla ca. 0.6 cm; septa with attached retinacula separating from inner wall of mature capsule.",
      "Inflorescence not as described above; ovules 4 to many per locule; seeds 4 or more per capsule; corolla 0.6-5.5 cm; septa with attached retinacula not separating from inner wall of mature capsule (except in Ruellia blechum)",
      "Corolla limb distinctly 2-lipped, lobes usually not equal; calyx tube often rupturing in weak hyaline regions between lobes; pollen 4-colporate, interapertural regions multistriate with pseudocolpi.",
      "Corolla limb nearly regular, lobes equal to subequal; mature calyx tube not rupturing in weak hyaline regions between lobes; pollen otherwise",
      "Stems short; leaves in a basal rosette; anther thecae usually widely separated by a broad connective.",
      "Ovules 3 to many per locule; seeds 6 to many per capsule; pollen with apertural margins conspicuously thickened",
      "Capsule linear and 4-angled, not compressed perpendicular to septum; seeds strongly compressed, glabrous or pubescent",
      "Flowers subtended by a single pair of bracteoles; corolla not resupinate 180° by a twisting of corolla tube (i.e., upper lip entire to 2-lobed and lower lip 3-lobed), or if position of lips reversed then this by geniculation (without twisting) of corolla tube.",
      "Flowers subtended by an involucre of 2 or more pairs of floral bracteoles; corolla resupinate 180° by twisting of corolla tube (i.e., lip in upper position 3-lobed and lip in lower position entire to 2-lobed).",
      "Flowers subtended by involucre of 2 or more pairs of floral bracteoles; corolla resupinate 180° (i.e., lip in upper position 3-lobed and lip in lower position entire to 2-lobed)",
      "Flowers subtended by a single pair of bracteoles (or bracteoles rarely lacking); corolla not resupinate 180° (i.e., upper lip entire to 2-lobed and lower lip 3-lobed)",
      "Corolla ± salverform (i.e., tube slender and cylindric, limb spreading and inconspicuously 2-lipped), tube conspicuously longer than limb, not or only slightly widened distally.",
      "Corolla ± campanulate to strongly 2-lipped (not salverform), tube not longer than limb, gradually widened distally",
      "Upper lip of corolla lacking a stylar furrow on internal surface; anther thecae lacking basal appendages",
      "Upper lip of corolla rugulate (i.e., with a furrow on inner surface of lip in which style resides); anther thecae (at least lower theca) usually with a basal appendage",
      "Septa with attached retinacula separating from inner wall of mature capsule; inflorescence often dense with imbricate bracts 2- or 4-ranked (but only 2 ranks fertile).",
      "Septa with attached retinacula remaining attached to inner wall of mature capsule; inflorescence not as above"
    ],
    "authors":"Yunfei Deng, Jia-qi Hu, Thomas F. Daniel, John Wood & John R. I. Wood"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Annonaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10047",
    "knowledge_content":[
      "Trees, shrubs, or climbers, wood and leaves often aromatic; indument of simple or less often (Uvaria, Annona) stellate hairs. Leaves alternate, normally distichous. Stipules absent. Petiole usually short; leaf blade simple, venation pinnate, margin entire. Inflorescences terminal, axillary, leaf-opposed, or extra-axillary [rarely on often underground suckerlike shoots]. Flowers usually bisexual, less often unisexual, solitary, in fascicles, glomerules, panicles, or cymes, sometimes on older wood, usually bracteate and\/or bracteolate. Sepals hypogynous, [2 or]3, imbricate or valvate, persistent or deciduous, rarely enlarging and enclosing fruit, free or basally connate. Petals hypogynous, 3-6(-12), most often in 2 whorls of 3 or in 1 whorl of 3 or 4[or 6], imbricate or valvate, sometimes outer whorl valvate and inner slightly imbricate. Stamens hypogynous, usually many, rarely few, spirally imbricate, in several series; filaments very short and thick; anther locules 2, contiguous or separate, rarely transversely locular, adnate to connective, extrorse or lateral, very rarely introrse, opening by a longitudinal slit; connectives often apically enlarged, usually ± truncate, often overtopping anther locules, rarely elongated or not produced. Carpels few to many, rarely solitary, free or less often connate into a 1-locular ovary with parietal placentas; ovules 1 or 2 inserted at base of carpel or 1 to several in 1 or 2 ranks along ventral suture, anatropous; styles short, thick, free or rarely connate; stigmas capitate to oblong, sometimes sulcate or 2-lobed. Fruit usually apocarpous with 1 to many free monocarps, these sometimes moniliform (constricted between seeds when more than 1-seeded), often fleshy, indehiscent, rarely dehiscent (Anaxagorea, Xylopia), and often with base extended into stipe, rarely on slender carpophore (Disepalum), less often syncarpous with carpels completely connate and seeds irregularly arranged and sometimes embedded in fleshy pulp. Seeds 1 to many per monocarp or many per syncarp, often arillate; endosperm copious, ruminate; embryo minute, near hilum.\r",
      "About 129 genera and over 2,300 species: tropics and subtropics, especially in Old World; 24 genera (one endemic, three introduced) and 120 species (41 endemic, 11 introduced) in China.",
      "The flowers often open before the petals have fully expanded making it easy to underestimate floral dimensions.One of the major studies of the Annonaceae of tropical Asia was by Suzanne Jovet-Ast (1914-2006), who published an account of the Indochinese species under her maiden name, Ast (Fl. Indo-Chine, Suppl. 1: 62-121. 1938). Unfortunately, she failed to provide Latin descriptions for her many new taxa, none of the names of which was therefore validly published. Her new combinations were validly published, however, and she did subsequently validate a few species of Goniothalamus under her maiden name; but she did not validate most of her new species until after she married and took up the name \"Jovet-Ast.\" These later names form the major part of all her publications, so we have chosen to cite her as \"Jovet-Ast [\"Ast\"]\" for those taxa validated under her maiden name.Tsiang Ying & Li Ping-t’ao. 1979. Annonaceae. In: Tsiang Ying & Li Ping-t’ao, eds., Fl. Reipubl. Popularis Sin. 30(2): 10-175.",
      "Fruit syncarpous, with completely united carpels and seeds embedded in pulp (usually cultivated as fruit trees)",
      "Sepals or inner petals and sometimes also outer petals clearly imbricate; stellate hairs often present",
      "Sepals and inner and outer petal whorls all valvate or rarely very narrowly imbricate at tip only (only 1 whorl of petals present in Dasymaschalon); simple hairs usually present, less often plant glabrous",
      "Trees or self-supporting shrubs; stellate hairs absent; sepals imbricate; petals valvate or very minutely imbricate; ovules 1 per carpel.",
      "Climbing shrubs; stellate hairs present; sepals valvate; inner petals and sometimes also outer petals imbricate; ovules 2 or more per carpel",
      "Monocarps ellipsoid, moniliform when more than 1-seeded; petals basally constricted to form enclosed floral chamber around stamens and carpels.",
      "Monocarp stipes 5.3-7.5 cm; outer petals usually much larger than inner petals; stamen connectives apically truncate (flowers of F. hainanensis unknown).",
      "Monocarp stipes 0.3-4 cm; outer petals only slightly larger than inner petals; stamen connectives apically acuminate to obtuse.",
      "Inner petals basally clawed or stipitate, laminas vaulted and connate into an apical cap at least initially",
      "Outer petals 2-7 mm, usually smaller than inner petals and similar to sepals (inner and outer petals subequal in Orophea hainanensis and O. yunnanensis)",
      "Outer petals more than 12 mm, equaling or longer than inner petals, conspicuously different from sepals",
      "Inner petals with a long basal claw, usually apically lozenge-shaped and cohering by their margins into a cap over stamens and carpels, sometimes with their tips conspicuously recurved; pedicel 0.2-1.2 cm.",
      "Inner petals with a short basal claw, shallowly saccate, at first cohering by their margins but soon free; pedicel usually 1.4-10 cm (0.5-0.7 cm in M. glochidioides).",
      "Flower buds lanceolate, apically long beaked and 3-angled; sepals connate at base or beyond into a cup; petals elongated, concave at base, narrowly convex below middle; anther locules transversely septate.",
      "Flower buds ovoid, apically rounded; sepals connate at base but not into a cup; petals flat or cucullate; anther locules not transversely septate",
      "Petals flat; stamen connectives apically rounded; stigmas subcapitate, not constricted at base; monocarps almost sessile (Chinese species).",
      "Petals cucullate; stamen connectives apically truncate to subtruncate; stigmas ovoid, constricted at base; monocarps long stipitate."
    ],
    "authors":"Bingtao Li & Michael G. Gilbert"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Berberidaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10100",
    "knowledge_content":[
      "Herbs, perennial, or shrubs, rarely small trees, evergreen or deciduous, sometimes rhizomatous or tuberous. Stems with or without spines. Leaves alternate, opposite, or basal, simple, or 1-3 × pinnately or 2-3 × ternately compound; stipules present or absent; venation pinnate or palmate. Inflorescences terminal or axillary, racemes, spikes, umbels, cymes, or panicles, or flowers fascicled or solitary. Flowers pedicellate or sessile, bisexual, radially symmetric; bracteoles or bracts present or absent. Perianth usually 2- or 3-merous, rarely absent. Sepals 6-9, often petaloid, distinct, in 2 or 3 whorls. Petals 6, distinct, flat, hooded, pouched, or spurred; nectary present or absent. Stamens 6, opposite petals; anthers 2-celled, dehiscing by valves or longitudinal silts. Ovary superior, apparently 1-carpellate; ovules numerous, rarely solitary; placentation marginal or appearing basal; style present or absent, sometimes persistent in fruit as a beak. Fruit a berry, capsule, follicle, or utricle. Seeds 1 to numerous, sometimes arillate; endosperm abundant.\r",
      "Seventeen genera and ca. 650 species: mainly in the north temperate zone and on subtropical mountains; 11 genera and 303 species (272 endemic, one introduced) in China; 17 additional species (15 endemic) are insufficiently known.",
      "Editors’ note. The Berberidaceae were to be published in Flora of China Volume 7 (2008). However, a problem with the treatment of Berberis necessitated postponing publication of the family until the present volume. See the comments under Berberis, below.The family Berberidaceae presents an interesting, distinctive biogeography. The two species of Achlys Candolle are disjunctly distributed between E Asia and North America, with one in Japan and Korea and one along the west coast of North America. Caulophyllum and Diphylleia each contain three species; the former has one species in E Asia and two in North America, the latter has two in E Asia and one in North America. Sinopodophyllum and Plagiorhegma (if maintained separate from Podophyllum Linnaeus and Jeffersonia Barton, respectively) are endemic to E Asia, but their closest relatives, Podophyllum and Jeffersonia, are widely disjunct in E North America. Epimedium has a wide, fragmented range from Japan westward to Algeria; the nearest relative, Vancouveria C. Morren & Decaisne, is endemic to the Pacific Northwest of North America. Dysosma and Nandina are endemic to China, and Ranzania T. Ito is endemic to Japan.Podophyllum cavaleriei H. Léveillé (Bull. Acad. Int. Géogr. Bot. 14: 142. 1914) is the replaced synonym of Pilea panzhihuaensis C. J. Chen et al. (Novon 17: 24. 2007) in the Urticaceae.Ying Tsunshen. 2001. Berberidaceae. In: Ying Tsunshen, ed., Fl. Reipubl. Popularis Sin. 29: 50-310.",
      "Leaves 2 or 3 × pinnately compound; margins of leaflets entire; anthers dehiscing by longitudinal slits; placentation parietal.",
      "Leaves simple or pinnately compound; margins of leaflets toothed; anthers dehiscing by 2 apically hinged valves; placentation basal"
    ],
    "authors":"Junsheng Ying, David E. Boufford & Anthony R. Brach"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Campanulaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10152",
    "knowledge_content":[
      "Herbs, lactiferous, perennial (often with rhizomes or caudices), less often annual, [or shrubs or trees outside of China]. Leaves estipulate, alternate (rarely opposite or whorled), simple, entire or variously toothed or dissected, petiolate or sessile. Flowers tetracyclic, perfect, with a specialized method of proterandrous secondary pollen presentation, resupinate in Lobelioideae, solitary in an axillary or less often terminal position, or aggregated into terminal or axillary inflorescences that appear racemose or paniculate (rarely capitate), pedicellate or rarely sessile; bracts leaflike or reduced, rarely absent; pedicels often bracteolate. Calyx synsepalous, adnate to ovary and forming a hypanthium (free in Cyananthus); lobes (3-)5(-10), valvate, sometimes with a reflexed appendage in each sinus, in some Codonopsis, inserted well below rim of hypanthium. Corolla sympetalous, actinomorphic or zygomorphic, most often some shade of blue or violet, or white; lobes (4 or)5(-10), valvate. Stamens equaling number of corolla lobes, antisepalous, distinct, coherent, or connate; anthers tetrasporangiate, dithecal, introrsely dehiscent by longitudinal slits, basifixed. Gynoecium syncarpous, 2-5(-10)-locular with axile placentation, [rarely 1-locular with parietal, basal, or apical placentation outside of China]; ovary at least partly inferior (superior in Cyananthus), sometimes crowned by an annular or tubular nectary; style solitary, pubescent with pollen-collecting hairs below apex; stigma typically with as many lobes as ovary locules. Fruit a capsule, commonly apically loculicidal or laterally poricidal, or a berry. Seeds usually small, numerous; embryo small, straight; endosperm copious, oily or rarely starchy.\r",
      "Eighty-six genera and over 2,300 species: cosmopolitan; 16 genera (one endemic, two introduced) and 159 species (77 endemic, two introduced) in China.",
      "Two of us (Lammers and Klein) do not agree with the separation of Leptocodon and Campanumoea from Codonopsis in this treatment. We consider that the single character used in each case, five lamellar glands alternate with the stamens in Leptocodon and baccate fruit in Campanumoea, is not sufficient to justify recognition of a distinct genus. We regard these two genera as embedded within Codonopsis, as was done by Lammers (in C. I. Peng, Phytogeogr. Bot. Invent. Taiwan, 43-61. 1992), Morris and Lammers (Bot. Bull. Acad. Sin. 38: 277-284. 1997), Lammers (in T. C. Huang, Fl. Taiwan, ed. 2, 4: 775-802. 1998), Lammers (in Kubitzki [Kadereit & Jeffrey], Fam. Gen. Vasc. Pl. 8: 26-56. 2007), and Lammers (World Checkl. Bibliogr. Campanulaceae. 262-273. 2007). On the other hand, one of us (Hong) notes that two characters distinguish Leptocodon from Codonopsis. One is the five lamellar glands and the other is the shape of the stigma segments, which are clavate in Leptocodon but orbicular-deltoid in Codonopsis. Campanumoea differs from Codonopsis not only in having baccate fruit but also in its pollen, which is shortly 5-colpate (vs. 5-8-long-colpate in the core group of Codonopsis). Campanumoea is not a very distinct genus, and it seems that it would be equally reasonable to sink it into Codonopsis or to separate it. However, if it were sunk, then it would also be reasonable to sink Adenophora into Campanula because the former genus differs from the latter only in having a nectar disk around the style.Pentaphragma Wallich ex G. Don and Sphenoclea Gaertner were included in Campanulaceae in FRPS but are treated in this volume as Pentaphragmataceae and Sphenocleaceae, respectively. See the notes under those two families.Hong De-yuan, Lian Yong-shan & Shen Lian-dai. 1983. Campanulaceae (Campanuloideae and Lobelioideae). In: Hong De-yuan, ed., Fl. Reipubl. Popularis Sin. 73(2): 1-173.T. G. Lammers. 1998. Campanulaceae. In: Tseng-Chieng Huang, ed., Fl. Taiwan, ed. 2, 4: 775-802.",
      "Flowers resupinate at anthesis; odd (unpaired) calyx lobe in a ventral (anterior) position prior to resupination; corolla zygomorphic (sometimes only slightly so); stamens connate, forming an asymmetric tube; locules and stigmas 2 (Lobelioideae)",
      "Flowers oriented normally; odd (unpaired) sepal in a dorsal (posterior) position; corolla actinomorphic; stamens distinct or coherent into a symmetric tube at anthesis but eventually separating; locules and stigmas (2 or)3-6 (Campanuloideae)",
      "Corolla strongly zygomorphic, unilabiate or bilabiate, lobes ± as long as tube or slightly shorter, tube cleft to base on dorsal surface; staminal column free from corolla, exserted from dorsal fissure of corolla.",
      "Corolla scarcely zygomorphic, salverform, lobes less than 1\/3 as long as tube, tube entire; staminal column adnate to corolla below middle, scarcely exserted from mouth of corolla.",
      "Calyx tube adnate to ovary, forming a hypanthium (though lobes sometimes apparently inserted at base or middle rather than its rim); corolla and stamens inserted on rim of hypanthium (i.e., atop ovary)",
      "Taproot greatly thickened, carrotlike or tuberous; flowers large, corolla 15-50 mm; stigmas ovoid or orbicular, ± as long as broad",
      "Taproot fibrous or but scarcely thickened; flowers small, corolla 2-12 mm; stigmas filiform or linear, much longer than broad",
      "Leaves pinnately lobed or parted; calyx lobes echinate; corolla lobes and stamens typically 4; pollen 4- or 5-colpate; seeds triquetrous.",
      "Leaves entire or toothed; calyx lobes entire or toothed; corolla lobes and stamens typically 5; pollen 3-porate; seeds terete or compressed.",
      "Plants annual, roots fibrous; flowers both chasmogamous and cleistogamous, latter often predominating; corolla lobes cut for 1\/2-3\/4 their length, lanceolate.",
      "Flowers large, corolla typically 15-75 mm; fruit dehiscing via 2 or 3 definite pores in firm sclerenchymatous pericarp",
      "Flowers small, corolla 5-12 mm; fruit dehiscing irregularly via ruptures and tears of membranous or papery pericarp",
      "Plants perennial via tuberiferous stolons; stems terete; flowers long pedicellate; seeds > 1.5 mm, testa finely striate."
    ],
    "authors":"Deyuan Hong, Prof. Ge Song, Thomas G. Lammers & Laura L. Klein"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Caprifoliaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10159",
    "knowledge_content":[
      "Shrubs or woody climbers, rarely small trees or herbs. Leaves opposite, rarely whorled, simple or pinnatifid, conduplicate or involute in vernation; interpetiolar stipules absent or rarely well developed. Inflorescence thyrsoid, axillary or terminal, compact or lax, cymes 1-, 2-, or 3-flowered; paired flowers sometimes with ovaries ± fused. Cymes with a pair of bracts and 2 pairs of bracteoles, located at base of ovaries, ± fused, occasionally accrescent in fruit, rarely absent. Flowers bisexual, actinomorphic or zygomorphic. Calyx 4- or 5-lobed. Corolla epigynous, gamopetalous; lobes 4 or 5, spreading, sometimes bilabiate, aestivation imbricate. Stamens (4 or)5, didynamous, alternating with corolla lobes, sometimes exserted; anthers free, 2-celled, opening by longitudinal slits, introrse. Ovary inferior, carpels 2-8, fused; placenta axile; ovules 1 to many per locule, some of which can be abortive, pendulous; style solitary; stigmas capitate or lobed. Fruit a berry, a drupe with 2-5 pyrenes, or a leathery achene. Seeds 1 to many; embryo small, straight; endosperm copious.\r",
      "Five genera and ca. 207 species: mostly in temperate regions of E Asia and E North America; five genera (one endemic) and 66 species (25 endemic) in China.",
      "Following recent phylogenetic studies (Bell et al., Harvard Pap. Bot. 6(2): 481-499. 2001; Donoghue et al., Harvard Pap. Bot. 6(2): 459-479. 2001; W. H. Zhang et al., Molec. Phylogen. Evol. 26: 176-189. 2002), Caprifoliaceae is now thought to include Caprifolieae, Diervilleae, Linnaeeae, Morinaceae, Dipsacaceae, and Valerianaceae. However, Blacklund and Pyck (Taxon 47: 657-661. 1998) preferred to retain Caprifolieae as a distinct family and raise Linnaeeae and Diervilleae as new families, and this system is followed in the Flora of China.Hsu Ping-sheng, Hu Jia-qi & Wang Han-jin. 1988. Caprifoliaceae (excluding Sambucus and Viburnum). In: Hsu Ping-sheng, ed., Fl. Reipubl. Popularis Sin. 72: 104-259.",
      "Flowers paired (rarely single and then pedunculate; rarely in threes and then bracteoles fused into a cupule) or in whorls of 6",
      "Flowers paired (rarely single and then pedunculate; rarely in threes and then bracteoles fused into a cupule).",
      "Flowers 6 in a single whorl, with 2 pairs of tight involucral bracts forming a capitulum; capitula paniculate; shrubs with triplinerved leaves.",
      "Inflorescence different, if flowers in a capitulum then plant a climber with perfoliate involucral bracts and bilabiate flowers in 1-4 whorls",
      "Devendraea  PusalkarHeptacodium  RehderLeycesteria  WallichLonicera  LinnaeusSymphoricarpos  Duhamel du MonceauTriosteum  Linnaeus"
    ],
    "authors":"Qiner Yang, Sven Landrein, Joanna Osborne & Renata Borosova"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Carlemanniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10162",
    "knowledge_content":[
      "Perennial herbs, shrubs, or subshrubs, often somewhat fleshy; stems with interpetiolar line. Leaves opposite, petiolate, simple, estipulate, ± asymmetric, dentate or crenate-serrate. Flowers bisexual, slightly zygomorphic, in terminal or axillary cymes or corymbs, sometimes heterostylous. Calyx tube adnate to ovary, 4- or 5-lobed; lobes ± unequal. Corolla 4- or 5-lobed; lobes imbricate or induplicate-valvate. Stamens 2, inserted at middle of corolla tube; filaments short; anthers linear-oblong, opening laterally by slits, connivent around style. Disk well developed, conical or cylindrical. Ovary inferior, 2-loculed, each locule with ovules many (30-100) in axile to basal placentation. Fruit a 2-loculed, dry or fleshy capsule, 2- or 5-valvate; calyx lobes persistent. Seeds many (30-100), ovoid, smooth, with endosperm ± fleshy.\r",
      "Although previously treated in FRPS within the Rubiaceae, the Carlemanniaceae is treated separately here (see APG, Ann. Missouri Bot. Gard. 85: 531-553. 1998; M. Thiv in Kubitzki, Fam. Gen. Vasc. Pl. 7: 57-59. 2004). It has also been included by various authors in the Caprifoliaceae.Herein, the term \"calyx tube\" refers to the ovary plus the tubular free portion of the calyx limb, but not including the calyx lobes when these are present.Lo Hsienshui. 1999. Carlemannia and Silvianthus. In: Lo Hsienshui, ed., Fl. Reipubl. Popularis Sin. 71(1): 175-179.",
      "Herbs; leaves distinctly crenate-serrate; flowers 4-merous, arranged in loose corymbose inflorescences; calyx lobes imbricate; fruit a 2-valved dry capsule.",
      "Shrubs; leaves often slightly irregular and shallowly dentate; flowers 4- or 5-merous, congested in dense subglobose inflorescence; calyx lobes induplicate-valvate; fruit a 5-valved fleshy capsule."
    ],
    "authors":"Tao Chen & Anthony R. Brach"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Cucurbitaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10233",
    "knowledge_content":[
      "Herbs, annual or perennial, or weak, woody shrubs with watery sap, scandent or prostrate. Roots fibrous or tuberous. Stem often angular. Leaves alternate, undivided or variously palmately or pedately divided, often cordate; tendrils solitary, lateral, simple or branched, spirally twisted, rarely absent; stipules absent. Plants monoecious or dioecious; flowers unisexual, very rarely bisexual; flowers paniculate, racemose, or subumbellate, rarely solitary. Calyx tube (hypanthium) adnate to ovary; tube rotate, campanulate, or saucer-shaped, usually 5-lobed; segments imbricate. Corolla usually sympetalous, inserted on calyx tube; segments valvate or involute. Stamens inserted at base or mouth of calyx tube, usually 5 or 3, of which one often 1-celled and other two 2-celled; filaments separate or variously united into a column; anthers separate or coherent into a head; anther cells straight to conduplicate, extrorse; rudimentary ovary often present in male flowers; staminodes often in female flowers. Ovary inferior or nearly completely so, mostly composed of 3 carpels, 3-locular, rarely 1- or 2- or spuriously 4-6-locular; ovules usually numerous, rarely few or solitary, horizontal, pendulous, or ascending, often immersed in pulp; placentas parietal, fleshy, often confluent at middle of ovary; style terminal, simple or branched at apex or styles free; stigma enlarged or 2-fid. Fruit usually a fleshy berry or corky, indehiscent or rarely opening by valves or by an operculum, rarely fibrous. Seeds often numerous, rarely few or solitary, horizontal, pendulous, or ascending, often compressed, rarely winged; endosperm absent; embryo with leaflike cotyledons and short radicle.\r",
      "About 123 genera and over 800 species: most in tropics and subtropics, very rare in temperate regions; 35 genera (one endemic, nine introduced) and 151 species (73 endemic, 14 introduced) in China.",
      "Lu An-ming & Zhang Zhi-yun. 1986. Cucurbitaceae. In: Lu An-ming & Chen Shu-kun, eds., Fl. Reipubl. Popularis Sin. 73(1): 84-280.",
      "Stamens 3 or 1, anther cells horizontal when only 1 stamen, or rarely 5 but then anther cells conduplicate",
      "Plants woody, scandent; leaflets almost entire, with 2 glands at base; seeds with membranous wing at apex.",
      "Plants herbaceous, scandent; leaflets distinctly denticulate, eglandular at base; seeds without wing or rarely winged",
      "Flowers with corolla segments ca. 2 cm, or if smaller then calyx longer than corolla; fruit baccate, indehiscent; seed not winged",
      "Plants monoecious; leaf blade cordate-hastate, eglandular at base; fruit dehiscent near middle; seeds not winged.",
      "Plants dioecious; leaf blade with 1 or 2 pairs of glands at base; fruit dehiscent near apex; seeds with membranous wing at apex.",
      "Plants dioecious or rarely flowers bisexual; fruit 3-valved from apex to base when mature; seeds 1-3, pendulous.",
      "Male flowers without pistillode; anther cells conduplicate; male and female flowers fasciculate in leaf axil.",
      "Male flowers in pedunculate cymes, racemes, or umbels, or solitary; ovary glabrous or with fine hairs",
      "Anther connective not produced beyond thecae; stigmas glabrous, apically shortly 2-lobed; fruit black when ripe.",
      "Anther connective usually shortly produced beyond thecae; stigmas papillose, rounded; fruit white or red when ripe."
    ],
    "authors":"Anmin Lu & Charles Jeffrey"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Diervillaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20466",
    "knowledge_content":[
      "Shrubs, deciduous. Winter buds with several scales. Leaves opposite, simple, margins serrate, estipulate. Inflorescence apical, axillary, or on short lateral shoots, cymose, flowers 2-6, or flowers solitary. Calyx tube narrowly cylindric; limb 5-lobed, incised to middle or base. Corolla 5-lobed, irregular or subregular; tube longer than limb. Stamens 5, inserted at middle of corolla tube; anthers included to exserted. Ovary inferior, with a globose gland on one side of upper part, 2-loculed; ovules numerous; style 1, slender, exserted; stigma capitate. Fruit a 2-valved dehiscent capsule; seeds numerous, small.\r"
    ],
    "authors":"Qiner Yang, Fred R. Barrie & Charles D. Bell"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Dipsacaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10282",
    "knowledge_content":[
      "Herbs, mostly perennial, less frequently annual or biennial, very rarely subshrubs. Leaves opposite, or sometimes whorled, simple, entire or toothed, pinnatifid to pinnatisect. Inflorescences of compact cymes forming a terminal, involucral head, or diffuse and paniculiform (Triplostegia). Flowers bisexual, nearly always subtended by 1 or 2 cupular, apically toothed or subentire involucels (epicalyx); receptacle hairy or naked. Calyx usually small, cupular, or 4- or 5-segmented, or with up to 10 teeth or setae. Corolla sympetalous, 5(or 4)-lobed, ± irregular. Stamens 4, rarely 2 or 3, inserted at summit of corolla tube; anthers 4-sporangiate, opening by longitudinal slits. Gynoecium of 2 carpels, but 1 carpel obsolete; ovary inferior, 1-loculed; ovule solitary, apical, pendulous; style slender; stigma entire or 2-fid. Fruit an achene, enclosed by involucel and crowned by persistent calyx.\r",
      "Ten genera and ca. 250 species: Africa, Asia, Europe; four genera and 17 species (four endemic) in China.",
      "He Shi-yuan, Hsing Chi-hua & Yin Tsu-tang. 1986. Dipsacaceae. In: Lu An-ming & Chen Shu-kun, eds., Fl. Reipubl. Popularis Sin. 73(1): 44-84.",
      "Plants without spines; flowers usually dimorphic, corolla of marginal flowers larger and 2-lipped; involucels usually with a crown",
      "Dipsacus  LinnaeusPterocephalus  Vaillant ex AdansonScabiosa  LinnaeusTriplostegia  Wallich ex Candolle"
    ],
    "authors":"Deyuan Hong, Liming Ma & Fred R. Barrie"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Goodeniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10380",
    "knowledge_content":[
      "Herbs, shrubs, or rarely small trees [or vines], without laticifers. Stipules absent. Leaves alternate, rarely opposite or whorled, simple. Inflorescences a cyme, raceme, head, or sometimes single flowered in axils. Flowers perfect, protandrous. Calyx epigynous, tubular, mostly (3-)5-lobed. Corolla sympetalous, irregular, 2-lipped or sometimes 1-labiate due to 2-segmentation of posterior lip to base; lobes 5, valvate, often induplicate. Stamens 5, alternate with corolla lobes, free from corolla or adnate to base of corolla tube; anthers 4-sporangiate and dithecal, introrse, longitudinally dehiscent. Ovary inferior, semi-inferior [or rarely (Velleia Smith) essentially superior], (1 or)2-locular [occasionally 4-locular (Scaevola porocarya F. Mueller)]; ovules 1 to many per locule, on axile or basal-axile placentas, anatropous. Fruit usually a capsule, less often a drupe or a small nut, often with persistent calyx. Seeds with a straight embryo embedded in copious endosperm.\r",
      "Twelve genera and ca. 400 species: pantropical and extending into subtropics; two genera and three species in China.",
      "The greatest diversity of the family is in Australia.Pollen presentation mechanism in the family is complex. The anthers are connivent or connate to form a tube into which pollen grains shed. The style, with a cupular indusium below the small stigma, grows up through the anther tube and collects the pollen grains, which are subsequently deposited or brushed onto visiting insects.Hong De-yuan. 1983. Goodeniaceae. In: Hong De-yuan, ed., Fl. Reipubl. Popularis Sin. 73(2): 177-180."
    ],
    "authors":"Deyuan Hong & Dianella G. Howarth"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Lentibulariaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10490",
    "knowledge_content":[
      "Herbs, perennial or annual, carnivorous, terrestrial, epiphytic, or aquatic. Roots present or absent. Stems often (Utricularia) modified into rhizoids, stolons, or rhizomes, rarely developed. Traps (bladders) on rhizoids, stolons, or leaves present in Utricularia but absent in Pinguicula. Stipules absent. Leaves alternate or in a basal rosette, simple or variously divided. Inflorescences usually racemes or reduced to a solitary flower; peduncle erect to twining. Flowers ± zygomorphic. Calyx 2-5-lobed or -parted; lobes imbricate, persistent. Corolla gamopetalous, tube short, limb 2-lipped or equally 5-lobed; lower lip entire or 2- or 3(-6)-lobed, lobes imbricate; upper lip entire or 2- or 3-lobed; spur subulate, cylindric, conic, or saccate. Stamens 2, inserted at base of corolla tube, included; filaments linear, short, curved or straight; anthers dorsifixed, ellipsoid; thecae 2, divaricate, confluent or (in Utricularia) sometimes distinct and ± separated by a connective; staminodes absent. Disk absent. Carpels 2, connate; ovary superior, 1-locular; placenta free-central or basal; ovules 2 to numerous, anatropous, somewhat sunken into placenta; style 1 or absent; stigma 2-lipped, upper lip reduced or obsolete. Fruit usually a capsule, loculicidal, circumscissile, or rarely indehiscent. Seeds few, numerous, or rarely 1 per capsule, minute, without endosperm.\r",
      "Three genera and ca. 290 species: cosmopolitan but mostly in tropical regions; two genera and 27 species (four endemic) in China.",
      "Leaves with margin usually involute, adaxially with viscid glands; traps absent; calyx 5-parted; corolla open at throat.",
      "Leaves with margin not involute, adaxially without viscid glands; traps present; calyx 2(-4)-parted; corolla with variously raised palate at throat."
    ],
    "authors":"Zhenyu Li, Zhen-yu Li, Martin R. Cheek & Peter G. Taylor"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Linnaeaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20472",
    "knowledge_content":[
      "Shrubs, erect or creeping. Leaves opposite, sometimes whorled, simple, estipulate, with an interpetiolar line. Inflorescence terminal or axillary; flowers in 3-flowered cymes, paired or single; bracts leaflike or reduced and located at base of ovary and forming an \"epicalyx.\" Flowers bisexual, ± zygomorphic. Perianth 4- or 5-merous. Corolla imbricate in bud; nectary consisting of ± compact glandular hairs, inside corolla tube (nectaria trichomalia). Stamens 4, alternating with corolla lobes; filaments adnate from 1\/3-1\/2 with corolla tube. Ovary inferior, 3- or 4-loculed, placentation axile; 1 or 2 locules with a single fertile ovule and 2 locules with numerous sterile ovules; style long, stigmas capitate. Fruit an achene crowned with persistent sepals (deciduous in Linnaea). Seeds 1 or 2; embryo small, straight; endosperm copious.\r",
      "Seven genera and 19 species (including one cultivated hybrid): Afghanistan, China, India, Japan, Korea, Kyrgyzstan, Nepal, Pakistan, Russia, Uzbekistan, and in Europe and North America; six genera (two endemic) and 15 species (eight endemic, one cultivated hybrid) in China.",
      "Hu Jia-qi. 1988. Caprifoliaceae (Linnaeeae, excluding Heptacodium and Symphoricarpos). In: Hsu Ping-sheng, ed., Fl. Reipubl. Popularis Sin. 72: 112-131.",
      "Petioles of opposite leaf pairs dilated and connate at base, enclosing axillary buds; corolla hypocrateriform, with a cylindrical tube and 4 or 5 spreading lobes; flowers in 3-flowered cymes or paired; stigmas green and mucilaginous.",
      "Petioles of opposite leaf pairs not dilated, axillary buds exposed; corolla funnelform or bilabiate with 5 spreading lobes; flowers paired or single; stigmas white and not mucilaginous",
      "Evergreen, creeping subshrubs; two bracts shieldlike and covered with sticky glandular hairs; inflorescence reduced to 2 single flowers at apices of branchlets (those can look like paired flowers but have more bracts and internodes separating them).",
      "Bracts and bracteoles covered with bristles, accrescent and becoming spongy, woody and fused to ovaries in fruit.",
      "Flowers terminal and paired (flowers opening simultaneously), sometimes 1-3(-8) due to supernumerary flowers axillary to bracteoles (more often so on repeat-bloom long shoots), spring flowering.",
      "Flowers axillary, paniculate, single or paired (flowers opening consecutively), summer or autumn flowering.",
      "Abelia  R. BrownDiabelia  LandreinDipelta  MaximowiczKolkwitzia  GraebnerLinnaea  LinnaeusZabelia  (Rehder) Makino"
    ],
    "authors":"Qiner Yang & Sven Landrein"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Morinaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10584",
    "knowledge_content":[
      "Herbs, perennial, caudexes usually covered with remnants of old leaf bases. Leaves opposite or verticillate; petioles often amplexicaul at base, forming a sheath. Flowers hermaphroditic, zygomorphic, in verticillasters or subcapitate to capitate heads. Involucel (epicalyx) of 4 fused bracteoles, with several to numerous spiny teeth or setae, 12-veined. Calyx fissured along ventral side, or 2-lipped. Corolla tubular; limb 5-lobed, scarcely to markedly 2-lipped. Stamens 4, all fertile, or 2 fertile plus 2 staminodes; anthers introrse, 2-celled, opening longitudinally. Ovary of 3 carpels, inferior, 1-locular, 6-veined, adnate to calyx tube; style 1, slender; stigma simple; ovules solitary, pendulous. Fruit an achene, enclosed in involucel and surmounted with persistent calyx.\r",
      "Two genera and ca. 13 species: SE Europe to the Himalaya and SW China; two genera and ten species (four endemic) in China.",
      "Hsing Chi-hua. 1986. Morina. In: Lu An-ming & Chen Shu-kun, eds., Fl. Reipubl. Popularis Sin. 73(1): 48-56.",
      "Fertile stamens 4; calyx limb oblique; fertile stems always coming from below rosettes; plants not thistlelike."
    ],
    "authors":"Deyuan Hong & Fred R. Barrie"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Myoporaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10592",
    "knowledge_content":[
      "Prostrate or erect shrubs or small trees, glabrous, glandular papillate or covered with stellate, villous, or glandular simple or branched trichomes, often with embedded resin cavities protruding from vegetative and floral parts, viscid to resinous. Stipules absent. Leaves simple, alternate to densely spiral, more rarely opposite or whorled, sessile to petiolate; leaf blade margin entire, serrate, crenate, or rarely lobed. Inflorescences a reduced dichasial cyme of 1-12 axillary flowers; bracts absent. Flowers bisexual, rarely functionally male or female. Sepals (4 or)5(or 6-9), distinct, basally connate, or rarely forming a deep calyx tube, valvate or imbricate, ± persistent. Corolla bilabiate, campanulate, rarely urceolate, actinomorphic, or zygomorphic, 5-lobed, lower lip 1-3-lobed, upper lip 2-4-lobed. Stamens 4(-8), inserted in corolla tube, alternate with corolla lobes, included or exserted; filaments filiform; anther cells confluent, reniform or sagittate. Gynoecium of 2 connate carpels; ovary superior, 2-carpelled, becoming 4(-12)-loculed by division of ovary; ovules 1-3(or 4) per locule, pendulous, anatropous; stigma capitate. Fruit usually indehiscent, rarely semi-dehiscent or subschizocarpic, dry or drupaceous with fleshy or watery mesocarp; endocarp woody. Seeds with a straight or slightly curved embryo; endosperm absent or sparse.\r",
      "Seven genera and ca. 250 species: tropical America, E and SE Asia, Australia, Indian Ocean islands (Mauritius and Rodrigues); one species in China.",
      "The family has recently been monographed (R. J. Chinnock, Eremophila and allied genera: A monograph of the plant family Myoporaceae, 1-672. 2007), and Pentacoelium was re-instated as a genus distinct from Myoporum Banks & Solander ex G. Forster. Although Pentacoelium is comparable vegetatively with species of Myoporum, the flowers are much larger and the fruit are quite different. The fruit of Pentacoelium are large and the most complex in the family. The fruit are similar in size and internal structures to Bontia Linnaeus, a genus endemic to the Caribbean and surrounding coastal areas of South America. Both genera show fruit features that suggest adaptation to dispersal by water, but the fruit of Pentacoelium are more complicated with a star-shaped inner woody zone and up to 10 locules and subapical lacunae extending down into the fruit.Li Zhenyu. 2002. Myoporaceae. In: Hu Chiachi, ed., Fl. Reipubl. Popularis Sin. 70: 310-313."
    ],
    "authors":"Hongbin Cui, Deyuan Hong & Robert J. Chinnock"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Pentaphragmataceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10661",
    "knowledge_content":[
      "Herbs perennial, ± succulent, without latex. Rhizome elongate, robust, often ± woody. Leaves alternate; leaf blade large, asymmetric at base. Inflorescence an axillary cyme or cincinnus, solitary or 2 or 3 together; pedicels short or absent. Flowers bisexual, actinomorphic except calyx. Calyx tube campanulate or tubular; calyx lobes 5, persistent, often white, unequal in width, often 2 wider and other 3 narrower. Corolla adnate to calyx as far as distal part of calyx, 5-cleft for more than halfway, or nearly fully divided and appearing petaloid, often white. Stamens 5, alternate with corolla lobes, inserted at proximal part of corolla tube; filament glabrous; anther ovoid or long ellipsoid, introrse or almost lateral due to connective being developed and exserted higher than anther cells. Ovary inferior, 2-loculed; ovules numerous; stigma capitate or conic, entire. Fruit an indehiscent berry. Seeds numerous, minute, ovoid or ovoid-globose; testa obviously reticulate.\r",
      "One genus and ca. 25 species: S China, Indonesia, Malaysia, Papua New Guinea, Philippines, Singapore, Thailand, Vietnam; two species (one endemic) in China.",
      "Pentaphragmataceae and Campanulaceae are not immediately related, although both are in the Asterales. Pentaphragma has quite different flowers, with no hint of the secondary pollen presentation that occurs throughout Campanulaceae s.l. Thus the inflorescence is cymose, usually scorpioid; the sepals are petaloid, with two large ones and three small ones; the corolla is ± deeply lobed; there are nectariferous cavities between septa joining hypanthium to ovary (unique in flowering plants); and the anthers are extrorse (introrse in all Campanulaceae s.l.). In addition, there is no latex; the leaves are distichous, with leaf blades strongly asymmetric; and the endosperm is starchy, the latter condition being extremely uncommon in Campanulaceae s.l.Hong De-yuan. 1983. Campanulaceae (Pentaphragmatoideae). In: Hong De-yuan, ed., Fl. Reipubl. Popularis Sin. 73(2): 174-176."
    ],
    "authors":"Deyuan Hong & Nicholas J. Turland"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Phrymaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20234",
    "knowledge_content":[
      "Herbs, annual or perennial [or subshrubs to shrubs], erect, prostrate, creeping to ascending. Stems 4-angular or winged or terete, occasionally highly reduced. Stipules absent. Leaves simple, opposite; leaf blade margin serrate or entire or variously toothed. Inflorescences a terminal [or axillary] spike [or a terminal raceme or a cyme] or flowers solitary and axillary. Flowers perfect, with [or without] a bract and a bracteole. Calyx connate, 5-lobed or dentate; lobes usually less than 1\/3 of calyx length. Corolla connate, tubular or cylindric, 2-lipped; lower lip with 3 imbricate lobes; upper lip 2-lobed. Stamens [2 or]4, inserted in corolla tube or exserted, anterior 2 longer; anthers longitudinally dehiscent. Gynoecium of 2 connate carpels; ovary superior, 1- or 2-locular; stigma broadly 2-lobed to 2-lipped, receptive only on inner surface and close together upon contact. Fruit an achene (in Phryma), loculicidal capsule (e.g., in Mimulus Linnaeus) [or occasionally berrylike (in Leucocarpus D. Don)]. Seeds numerous, rarely to 1, with an oblong embryo; endosperm scanty.\r",
      "About 14 genera and 150 species: worldwide, especially well developed in W North America and Australia; two genera and six species (four endemic) in China; one species treated here, one genus and five species previously treated in Fl. China 18 (see comment below).",
      "Z. Yu Li (in FRPS 70: 314-317. 2002) treated Phrymaceae to include only the genus Phryma, but recent studies have shown that the family should include a number of genera previously considered to be part of Scrophulariaceae. For China Phrymaceae now includes Mimulus with five species (four endemic), which has already been treated for the Flora of China in Scrophulariaceae (D. Y. Hong & N. H. Holmgren, Fl. China 18: 40-41. 1998), and Phryma with a single species. Two additional genera from Scrophulariaceae in China, Mazus Loureiro and Lancea J. D. Hooker & Thomson, were included in Phrymaceae by P. R. Beardsley and R. G. Olmstead (Amer. J. Bot. 89: 1093-1102. 2002), but we have excluded these two genera from Phrymaceae (see B. Oxelman et al., Taxon 54: 411-425. 2005; Z. Xia et al., Amer. J. Bot. 96: 519-530. 2009).Yang Han-pi. 1979. Mimulus. In: Tsoong Pu-chiu & Yang Han-pi, eds., Fl. Reipubl. Popularis Sin. 67(2): 164-172; Li Zhenyu. 2002. Phrymaceae. In: Hu Chiachi, ed., Fl. Reipubl. Popularis Sin. 70: 314-317."
    ],
    "authors":"Hongbin Cui & Deyuan Hong"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Plantaginaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10701",
    "knowledge_content":[
      "Herbs or small shrubs, rarely arborescent. Stipules absent. Leaves spirally alternate, usually in a basal rosette, rarely opposite or whorled, simple; leaf blade veins (1 or)3-11, arcuate. Inflorescences spikes, rarely racemes or 1-flowered, pedunculate, each flower with 1 bract. Flowers small, protogynous, bisexual, rarely polygamous or unisexual. Calyx usually 4-parted, persistent, segments imbricate. Corolla scarious or membranous, gamopetalous, actinomorphic or rarely zygomorphic, (3 or)4-lobed; lobes imbricate. Stamens (1 or 2 or)4, inserted on corolla tube, alternate with lobes; anthers free, versatile, with an apical appendage, thecae 2 and parallel. Pistil consisting of 2 carpels; ovary superior, (1 or)2-loculed, axile or rarely basal; style 1, filiform, mostly longitudinally stigmatic. Fruit a pyxis, rarely an indehiscent capsule or nutlet, with 1 to numerous seeds. Seeds minute; cotyledons narrow; endosperm fleshy.\r",
      "Two genera and more than 210 species: cosmopolitan; one genus and 22 species (three endemic, four introduced) in China."
    ],
    "authors":"Hongbin Cui, Zhenyu Li, Lai Wei & Ronald K. Hoggard"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Rubiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10778",
    "knowledge_content":[
      "Authors: Tao Chen, Xianrui Luo, Hua Zhu, Charlotte M. Taylor, Friedrich Ehrendorfer, Henrik Lantz, Michele Funston & Christian Puff",
      "Trees, shrubs, annual or perennial herbs, subshrubs, vines, or lianas, infrequently monocaulous or creeping and rooting at nodes, terrestrial or infrequently epiphytic, with bisexual flowers, infrequently dioecious, or rarely polygamo-dioecious (Diplospora, Galium, Guettarda, perhaps Brachytome) or monoecious (Galium), evergreen or sometimes deciduous (Hymenodictyon), sometimes armed with straight to curved spines (formed by modified stems or peduncles), infrequently with elongated principal stems bearing lateral short shoots (i.e., brachyblasts; Benkara, Catunaregam, Ceriscoides, Himalrandia, Leptodermis, Serissa), infrequently with lateral branches or short shoots spinescent (i.e., prolonged, sharp, and leafless at apex), infrequently with reduced internodes that give an appearance of verticillate leaf arrangement (Brachytome, Damnacanthus, Duperrea, Rothmannia, Rubovietnamia), infrequently with buds resinous (Gardenia) or mucilaginous (Scyphiphora), infrequently with tissues fetid when bruised, [rarely with swollen hollow stems or leaf bases housing ants (Neonauclea)]; branchlets terete to angled or quadrate, in latter two cases often becoming terete with age, or rarely flattened (Wendlandia) or winged (Hedyotis, Rubia), buds conical or rounded with stipules valvate or imbricate, or infrequently flattened with stipules erect and pressed together (Cinchona, Haldina, Nauclea, Neonauclea). Raphides present or absent. Leaves opposite, verticillate, or apparently verticillate (i.e., closely set due to reduced internodes), decussate or occasionally distichous, petiolate to sessile, infrequently somewhat to strongly anisophyllous, rarely punctate- or striate-glandular (Galium); margins flat to occasionally undulate or crisped, entire or rarely lobed (Hymenodictyon, Morinda) to denticulate or serrate (Hymenodictyon, Leptomischus, Ophiorrhiza, Wendlandia); secondary veins pinnate or rarely triplinerved or palmate (Hedyotis, Rubia), free (i.e., eucamptodromous) or uniting near margins (i.e., brochidodromous) in weak to well-developed or rarely substraight submarginal vein, sometimes with foveolate (i.e., pitted or cryptlike) and\/or tufted (i.e., pubescent) domatia (i.e., structures that house mites) in abaxial axils, these rarely also present in axils of tertiary veins (Morinda), with presence of domatia often variable within a species; tertiary and\/or quaternary venation rarely arranged in regular squares (Guettarda), regular rectangles (i.e., clathrate; Urophyllum), or lineolate (i.e., closely parallel within each areole; Timonius); petiole rarely articulate at base (Ixora); stipules persistent with leaves, deciduous before leaves, or quickly caducous, interpetiolar and infrequently fused to adjacent petioles or leaf bases, sometimes united around stem into a sheath, rarely completely united into a conical cap (i.e., calyptrate; Gardenia), with interpetiolar portion variously triangular in general shape to truncate, with apex entire or bilobed, multifid, lacerate, setose, or laterally appendaged, with apex, lobes, setae, and\/or appendages sometimes glandular (Chassalia, Hedyotis, Hymenodictyon, Knoxia, Mitchella, Mycetia, Neanotis, Ophiorrhiza, Pentas, Pseudopyxis, Psychotria, Trailliaedoxa), internally (i.e., adaxially) with small to well-developed colleters (i.e., glandular trichomes), these infrequently persistent after stipules fall (Psychotria), or stipules rarely expanded into 1 to several leaflike segments and then apparently absent due to leaflike form that gives an appearance of verticillate leaves (Argostemma, Asperula, Galium, Microphysa, Phuopsis, Rubia). Inflorescences terminal, axillary (i.e., borne at both axils at a node), or pseudoaxillary (i.e., borne consistently in 1 axil per node; lateral), sometimes apparently leaf-opposed due to marked anisophylly, or rarely superaxillary (Damnacanthus, Diplospora) or cauline (Mycetia), variously cymose to thyrsiform, corymbiform, paniculiform, racemiform, spiciform, fasciculate, or capitate and few to many flowered or occasionally reduced to a solitary flower, pedunculate (peduncle here used for basalmost axis supporting inflorescence or solitary flower) to sessile, when sessile often with 3 principal axes (i.e., tripartite), bracteate or bracts sometimes reduced or apparently absent, with bracts (here usually including bracts borne on pedicels or next to flowers, i.e., bracteoles) generally triangular to linear or sometimes leaflike (i.e., similar to normal or somewhat reduced leaves) and rarely enlarged, petaloid, and resembling calycophylls (Dunnia, Neohymenopogon), infrequently fused and involucral, occasionally fused in pairs (i.e., forming a calyculus, or calyculate), infrequently thickened and spatulate to clavate or conical (genera of Naucleeae), or infrequently stipuliform, rarely glandular (Damnacanthus, Mycetia), multifid to fimbriate (Damnacanthus, Kelloggia, Spermacoce) or spinescent (Phuopsis). Flowers sessile to pedicellate (pedicel here used for ultimate axis immediately supporting a single flower, except when this is a peduncle), bisexual and monomorphic, distylous, or rarely tristylous (Chassalia, Pentas), unisexual with 2 forms generally similar except for corolla size and hypanthium development, or rarely cleistogamous (Ophiorrhiza), actinomorphic or rarely zygomorphic (Argostemma), sometimes with ovaries of individual flowers partially to fully fused (Mitchella, Morinda, Mouretia, Nauclea), variously diurnal or nocturnal, usually sweetly fragrant, protandrous [or rarely protogynous], occasionally with secondary pollen presentation (e.g., Ixora, Pavetta, Phuopsis, Scyphiphora, genera of Naucleeae). Calyx gamosepalous and fused to inferior ovary in hypanthium or ovary portion, this generally ellipsoid, turbinate, obconic, cylindrical, or occasionally subglobose to hemispherical, glabrous and smooth, pubescent, or rarely tuberculate (Galium) or with unusual flattened (Dentella) or hooked, sometimes glandular trichomes (Galium, Kelloggia), or rarely longitudinally ridged to winged (Gardenia,Spiradiclis), above this developed into a free limb portion, this limb variously tubular to cupular or infrequently reduced to obsolete (Asperula, Coffea, Galium, Leptunis, Microphysa, Ophiorrhiza, Phuopsis, Rubia), truncate to 4- or 5(-9)-denticulate (i.e., lobes reduced to tiny projections along a generally truncate margin) or shallowly to deeply 4- or 5(-9)-lobed, open in bud or rarely with lobes markedly imbricate (Emmenopterys, Keenania), [or rarely spathaceous (i.e., fused into a conical cap that splits irregularly)], inside variously near base and\/or at sinuses between lobes with few to numerous small colleters, rarely densely or markedly veined (Clarkella, Myrioneuron, Pseudopyxis), rarely on margins with well-developed, sessile to stalked glands (Mycetia), lobes generally triangular to linear, occasionally obtuse to lanceolate or oblanceolate, or rarely prolonged into a slender shaft bearing a thickened apical portion (Neonauclea), occasionally slightly to markedly unequal on an individual flower with all lobes of different lengths or infrequently in unequal pairs of similar lengths (Diodia, Mitracarpus, Spermacoce), infrequently with 1(to 5, Mussaenda) lobe on some (or all, Mussaenda) flowers of an inflorescence enlarged into a calycophyll (i.e., a membranous to papery, petaloid, veined, white to colored blade borne on a generally well-developed stipe; Emmenopterys, Morinda, Mussaenda, Schizomussaenda). Corolla large and often showy to reduced, gamopetalous, white, yellow, orange, red, blue, purple, and\/or pale green, when nocturnal often white at anthesis becoming yellow with age, variously funnelform, salverform (i.e., hypocrateriform), tubular, campanulate, or occasionally rotate to infrequently urceolate (i.e., swollen in basal part of tube; Canthium, Lasianthus) or inflated (i.e., markedly swollen in middle or upper part of tube; Keenania, Leptomischus), infrequently curved in tube and\/or gibbous (i.e., asymmetrically swollen at very base of tube; Chassalia, Guettarda, Mycetia, Ophiorrhiza), infrequently differing in shape between long-styled and short-styled forms (Antirhea), infrequently markedly fleshy to leathery (Caelospermum, Damnacanthus, Fosbergia, Rothmannia, Timonius, Urophyllum), inside glabrous to variously pubescent with pubescence frequently confined to throat, outside infrequently ridged to winged (Cinchona, Ophiorrhiza), rarely fenestrate in tube (i.e., with longitudinal slits; Damnacanthus, Paederia), lobes (3 or)4 or 5(-11), shorter than or occasionally longer than tube, acute or less often obtuse to rounded at apex, generally spreading to somewhat reflexed at anthesis, infrequently with margins crisped to irregular, densely ciliate, and\/or appendaged (Cinchona, Luculia, Rondeletia, Saprosma, Serissa), in bud imbricate (and usually quincuncial), valvate, valvate-induplicate, valvate-reduplicate, or convolute (i.e., contorted) to left or rarely to right (Coptosapelta, Rothmannia), usually with aestivation consistent within a genus, occasionally with wings, ridges, and\/or rounded to hornlike thickenings or protuberances on back or at apex (Lerchea, Ophiorrhiza), rarely cucullate (Lerchea). Stamens adnate to corolla, free or rarely fused to stigma (Acranthera), alternate to corolla lobes and isomerous (i.e., equal in number to lobes) or rarely more numerous (Gardenia) [to rarely fewer], inserted variously in corolla throat, tube, or infrequently at base and sometimes appearing free (Galium), included to exserted, with point of insertion and position of anthers usually differing between long-styled and short-styled forms of distylous flowers, with staminodes of pistillate flowers generally similar to stamens but smaller; filaments well developed to reduced or obsolete, free or rarely coherent (Argostemma) or fused (Acranthera, Argostemma), variously glabrous to pubescent, occasionally markedly flattened (Hymenodictyon, Kelloggia); anthers free or rarely coherent or fused (Argostemma), 4-thecal or rarely 2-thecal (Hymenodictyon), 2-celled, in outline generally narrowly oblong, linear (i.e., narrowly fusiform), narrowly lanceolate, or narrowly elliptic, at base occasionally bifid (i.e., sagittate; Caelospermum, Cephalanthus, Duperrea, Hamelia, Neohymenopogon, Scyphiphora), dorsifixed (i.e., medifixed to dorsifixed near base) to occasionally basifixed, infrequently pubescent (Hyptianthera, Lerchea), with dehiscence introrse by longitudinal slits or rarely by apical pores (Argostemma), with connective infrequently prolonged into an apical and\/or sometimes basal appendage (Acranthera, Argostemma, Hyptianthera, Morinda, Rubovietnamia, Wendlandia), appendages rarely fused into a cone (Acranthera); pollen variously 3- or 4(or 5)-colpate and generally subglobose or occasionally 3- or 4-porate, 5-25-colpate and disk-shaped or ellipsoidal, in tetrahedral tetrads and 3- or 4-porate, cylindrical with 2 pores, or inaperturate. Ovary inferior [or rarely secondarily superior], sometimes fused between flowers (Mitchella, Morinda, Mouretia), (1 or)2(-10)-celled (i.e., locular), with ovules 1 or 2 to numerous in each cell (i.e., locule) on basal, axile (i.e., inserted on septum), apical, or infrequently parietal (Ceriscoides, Gardenia) placentas, in staminate flowers usually with ovary reduced and pistillode composed of structures similar to but smaller than style and stigma, in distylous flowers usually with ovary similarly developed but style and stigma differing in size and position in flower and sometimes stigmas also differing in shape between long-styled and short-styled forms; style 1, terminal on ovary, developed or rarely reduced (Galium, Microphysa), variously glabrous to pubescent, surrounded at base by well-developed fleshy disk [or this rarely reduced], this disk variously annular, conical, 2-parted, or shallowly lobed, glabrous or rarely pubescent (Clarkella, Mouretia, Timonius); stigmas free or rarely fused to anther connectives (Acranthera), 1- or 2(-10)-lobed (i.e., these lobes often equivalent to \"stigmas 1 or 2 to 10\" of some authors), with whole stigma or lobes variously capitate, linear, spatulate, clavate, lobed, or infrequently mitriform (i.e., shaped like a drinking glass) to cylindrical with recessed attachment (Canthium, Mitragyna, Pyrostria), glabrous or infrequently pubescent (Clarkella, Hyptianthera), variously included to exserted, with receptive surfaces introrse, apical, or internal. Infructescences generally similar to inflorescences but occasionally with part or all changing color, orientation, shape, and\/or other characteristics as the fruit mature. Fruit simple or rarely multiple (i.e., a syncarp; Mitchella, Morinda, Nauclea), variously capsular with dehiscence loculicidal, septicidal, circumscissile (i.e., around equator or middle; Mitracarpus), or through an apical beak (i.e., prolonged disk portion, sometimes to give appearance of partially superior ovary; Hedyotis, Neanotis, Neohymenopogon, Ophiorrhiza, Pentas, Spiradiclis) or operculum (i.e., circular lid; Argostemma, Leptodermis, Leptomischus, Mouretia, Pseudopyxis); or fleshy, small to quite large, and baccate (i.e., with numerous seeds enclosed by fleshy to juicy pulp or endocarp and usually indehiscent); or drupaceous (i.e., with 1 to several seeds enclosed in pyrenes), fleshy to occasionally dry, and indehiscent or infrequently dehiscent releasing pyrenes (Paederia, Serissa); or schizocarpous (i.e., dry and separating into segments) with mericarps (i.e., segments, cocci, nutlets) indehiscent (e.g., Asperula, Cephalanthus, Richardia); calyx limb persistent or deciduous usually leaving a circular scar, sometimes with persistent carpophore or septum (Adina); pyrenes (i.e., seeds enclosed in and dispersing with endocarp layer) when present and ovules all developed 1-10-locular and 1-10-seeded (i.e., fruit containing several pyrenes and each pyrene with 1 seed in 1 locule, or pyrenes solitary in each fruit and comprising entire ovary), ellipsoid to subglobose, plano-convex (i.e., hemispherical), concavo-convex, lenticular, or angled (i.e., narrow with 2 large inner faces and a small outer face), with outer wall hard to cartilaginous (Caelospermum) or infrequently papery (Coffea, Pavetta), smooth to ridged or sulcate on dorsal (i.e., abaxial) surface, without (Psychotria) or usually with evident preformed germination slits, pores, and\/or opercula generally on ventral (i.e., adaxial) surface, rarely winged (Paederia) or pubescent (Caelospermum, Paederia); seeds 1 to numerous, small (0.1-1.9 mm), medium-sized (2-5 mm) to large (5.1-20 mm), variously ellipsoid, lenticular, flattened, oblanceoloid, angled, or plano-convex, smooth to variously winged, foveolate, tuberculate, papillose, and\/or striate; endosperm (i.e., albumen) fleshy, oily, corneous (i.e., horny) and entire or infrequently ruminate (Psychotria), or rarely absent (Antirhea); embryo variously shaped. x = 6-17, most commonly 11, less frequently 9 or 12.\r",
      "About 660 genera and 11,150 species: cosmopolitan family, with most genera and species in humid tropical regions; 97 genera (three endemic, ten introduced) and 701 species (352 endemic, 23 introduced, six of unconfirmed occurrence) in China.",
      "This is one of the largest families of flowering plants and is represented nearly worldwide though it is most abundant in the tropical regions of both hemispheres. Important economic members of the family are coffee (Coffea), quinine (Cinchona), madder (Rubia), ipecac (Carapichea Aublet), and various horticultural plants, notably Gardenia, Ixora, Mussaenda, and Pentas. Several genera include pantropical weeds, notably Mitracarpus, Richardia, and Spermacoce, of neotropical origin, and Oldenlandia (Hedyotis) of African origin. A number of species are used for various medicinal purposes.Genera, tribes, and subfamilies of Rubiaceae characteristically either have or lack raphides; this character is generally considered informative taxonomically in this family. Raphides are tiny, needle-shaped crystals that are produced in groups inside some cells of leaf, stem, flower, and fruit tissues. They apparently function to protect the plant from herbivores. Raphides are often visible with a hand lens on dried specimens, particularly in soft tissues such as petals, the calyx hypanthium, and the young leaves at the apex of the stem, but may be difficult to see especially in succulent plants.Leaf domatia are common in Rubiaceae and are sometimes taxonomically informative at least for separation of species. These domatia provide protection for tiny mites that live on the leaves and that help protect the plant from herbivores and fungi by eating insect eggs, small insects, and spores. These domatia occasionally take the form of foveolae or crypts, but more often are formed by small groups or tufts of pubescence, which is sometimes different in form from pubescence found on other parts of the plant.At least half of the species of Rubiaceae have distylous flowers: an individual species has two flower forms, the long-styled form (or pin) with the stigmas borne above the anthers and the short-styled form (or thrum) with the anthers borne above the stigmas. An individual plant bears only one flower form, and the flowers are incompatible with other flowers of similar form whether borne on the same or another plant. Heterostyly is unusual in the flowering plants and is found in several other plant families that mostly have three floral forms instead of two with the third form (the homostylous) with the stigmas and anthers borne at the same level. Tristyly has only been documented very rarely for Rubiaceae, although it was noted by FRPS for Chassalia curviflora in China.A number of species of many genera of Rubiaceae have calyx lobes that are unequal in size on an individual flower, and in some species of several genera one or more of the calyx lobes are markedly different, much enlarged and also often petaloid. These structures are found on flowers, where they are typically brightly colored and apparently function to attract pollinators, and\/or on the fruit, where they are dry and brown and apparently function in dispersal of the fruit or seeds. These structures have variously been called \"petaloid calyx lobes,\" a morphologically descriptive term; \"semaphylls,\" a term that refers to the assumed function in pollination; and \"calycophylls,\" the term used here that refers to the leaflike shape of the calyx lobe. These structures are sometimes mistaken for bracts; a few species of Rubiaceae do also have petaloid bracts (e.g., Dunnia), but those structures are inserted on the inflorescence axes or immediately below the ovary of the flower.The woody Rubiaceae are better represented (i.e., more diverse) in moist temperate regions of China than in comparable habitats in North America, as detailed by Latham and Ricklefs (in Ricklefs & Schluter, Spec. Diversity Ecol. Communities, 294-314. 1993). They concluded that this pattern, which is also found in a number of other dicotyledonous families, is due largely to historical factors. The principal factors they identified are the extinction of woody Rubiaceae in these other regions, while the plants were able to persist in E Asia (e.g., Emmenopterys), and the long-term direct connection of the moist temperate and moist tropical zones in E Asia vs. the separation of these zones by deserts and large water bodies in other regions. They agreed with Wolfe (in Nelson & Rosen, Vicariance Biogeogr. 413-427. 1981) that the connections of plant ranges between E North America and E Asia were broken by the end of the Eocene, and thus that species of the several genera that are found in both regions (e.g., Cephalanthus) have had separate evolutionary histories for some time. Several SE Asian Rubiaceae genera, all found in China, appear to represent the most basal living lineages of the family, notably Acranthera, Coptosapelta, and Luculia (Bremer et al., Syst. Biol. 48: 413-435. 1999; Bremer & Manen, Pl. Syst. Evol. 225: 43-72. 2000; Rydin et al., Pl. Syst. Evol. 278: 101-123. 2009).A number of species of Rubiaceae are cultivated as ornamentals; most of these are mentioned and some are keyed and described here.Additional information on many of the cultivated Rubiaceae was presented by Puff and Chamchumroon (Thai Forest Bull., Bot. 31: 75-94. 2003).Complete Rubiaceae floras for E Asia are very few. The Chinese Rubiaceae were treated comprehensively in 1999 by FRPS; the treatment here is based primarily on that work. The Fl. URSS was published in English in 2000, but this is an unedited, unmodified translation of the 1958 work. The Fl. Japan has been published in several editions but includes relatively few genera and is rather idiosyncratic. The genus overview within the Rubiaceae of Thailand: A Pictorial Guide to Indigenous and Cultivated Genera by Puff et al. (43-240. 2005) is a useful recent reference.Some morphological features that are characteristic of the Rubiaceae have been described, measured, and named very differently by different authors, and the differing terminology has generated some confusion. In particular, the terminology and measurements used for the calyx and gynoecium have differed widely. The ovary of Rubiaceae flowers is typically inferior, and the calyx is gamosepalous with its free portion, or limb, arising from the top of the ovary portion; this limb varies from reduced (i.e., not developed) to developed, and truncate to deeply lobed. Most Rubiaceae authors have distinguished the inferior ovary portion of the flower from the free calyx limb; the ovary portion has sometimes been called simply an ovary, but sometimes considered to include the fused calyx and corolla tissue covering it and called a hypanthium. However, several authors, including in FRPS, have treated as one structure the inferior ovary together with the unlobed lower portion of the calyx limb, when this is present, as the \"calyx tube\" and the lobed portion of the calyx as a separate structure, the calyx lobes. The \"calyx tube\" is often clearly delimited and measurable, but the inclusion of the ovary in this means that this measurement can sometimes include ovaries that have been fertilized and are developing into fruit, thus are larger than and not comparable to the ovaries at anthesis even though the corolla may be still attached to the flowers. Here the ovary or hypanthium portion of the flower is measured separately from the limb; the term \"hypanthium\" is used to link these measurements to those of FRPS. The limb is measured separately here because the length of the tubular portion of this often includes taxonomically useful information, and while the \"calyx tube\" measurement is lost when the fruit are developed, the length of the tubular portion of the free calyx limb is usually still evident on the fruit thus facilitating identification. Another portion of the gynoecium that has been regarded differently by different authors is the distinction between the stigma and style: the structures regarded as 2-lobed stigmas by some authors are regarded as a style with 2 separate stigmas by as many other authors. Morphological study of the androecium and gynoecium here during preparation of a flora treatment has not been detailed and no focused effort has been made here to systematize these morphological interpretations.Inflorescence terminology is complicated in most flowering plant families. The terms \"bract\" and \"bracteole\" have been carefully and regularly applied by some Rubiaceae authors, with the term \"bracteole\" used only for the bracts that immediately subtend the flowers or in some cases that are found anywhere along the pedicels, and the term \"bract\" used for the remaining structures. However, other authors have not distinguished these structures, or have not distinguished them regularly or consistently. The term \"floral bract\" here refers to the structures found on the pedicels or that immediately subtend sessile flowers. Bracts and leaves are generally considered homologous structures, and in Rubiaceae these often vary continuously along the inflorescences. In particular, Rubiaceae commonly have somewhat reduced leaves subtending the inflorescences, and bracts that are somewhat enlarged and occasionally leaflike. These structures have been variously called \"reduced leaves\" or \"foliose bracts\" or \"foliaceous bracts\" (here called \"leaflike bracts\"). In particular, many species with branched inflorescences sometimes have rather large, leaflike bracts subtending the basalmost pair of secondary axes; these have been various interpreted as enlarged bracts at the top of the peduncle, or vegetative leaves that are borne at the base of a sessile, tripartite inflorescence.Significant measurements found on plants from outside China are noted in the discussions following the species descriptions and\/or are included within brackets in the descriptions in accordance with Flora of China style. Authors in FRPS described the seeds and embryos of some Rubiaceae but not others; their descriptions are reported. In many cases no information is available about these features for Chinese Rubiaceae. Authors in FRPS also described the pollen of a few genera; these reports are not included here because a number of very detailed, extensively documented pollen descriptions are available elsewhere, which show that much variation is found in pollen morphology at the species level in Rubiaceae and as yet Rubiaceae genera are not well characterized in terms of pollen. Thus, the very limited information available only at the genus level here does not seem well integrated into this flora treatment. The counts presented here for leaf veins apply to the secondary veins, as done by the majority of Rubiaceae authors. Many species of Rubiaceae also frequently have rather well-developed though shorter intersecondary veins, which often vary widely in number and degree of development between populations or plants; these apparently were occasionally combined with the secondary veins in the measurements given by FRPS, but such measurements are subject to significant misinterpretation by authors working in other regions and the varied usage in that work adds yet more confusion.Where data were missing from the descriptions in the first draft for the Flora of China, the terms \"unknown,\" \"not known,\" \"not noted,\" and \"not seen\" were retained (with \"not known\" consisted to \"unknown\"). Where these terms were used in the habitats and elevational ranges they were deleted in accordance with the style of previous Flora of China volumes. Where missing data were denoted with question marks, e.g., \"shape??,\" or with constructions such as \"__ × __ ,\" these were deleted because it was not apparent which of the above categories of missing data applied.The genus Khasiaclunea Ridsdale (Blumea 24: 347. 1979) is known with certainty from India and Myanmar and provisionally from N Vietnam; this may also be present in China, but no confidently determined specimens have yet been seen. The single species, K. oligocephala (Haviland) Ridsdale (Blumea 24: 347. 1979; Adina oligocephala Haviland, J. Linn. Soc., Bot. 33: 46. 1897), was reported by Ridsdale (loc. cit.) as \"probably\" found in China; however, this genus is not treated here.Lo Hsienshui, Ko Wancheung, Chen Weichiu, Hsue Hsianghao & Wu Hen. 1999. Rubiaceae (1). In: Chen Weichiu, ed., Fl. Reipubl. Popularis Sin. 71(1): i-xvii, 1-432; Lo Hsienshui, Ko Wancheung, Chen Weichiu & Ruan Yunzhen. 1999. Rubiaceae: Rubioideae. In: Chen Weichiu, ed., Fl. Reipubl. Popularis Sin. 71(2): i-xvi, 1-377; Wan Wenhao. 2000. Theligonaceae. In: Chen Chia-jui, ed., Fl. Reipubl. Popularis Sin. 52(2): 147-151.",
      "Leaves apparently whorled and estipulate, 4 to numerous at each node; herbs, twiners, and low shrubs; calyx limb reduced to a thin rim or absent.",
      "Leaves paired to whorled with stipules developed between each pair; calyx limb well developed to reduced or apparently absent",
      "Acaulescent to caulescent herbs, soft subshrubs, or herbaceous vines or clambering plants, if tall subshrubs then stems annual."
    ],
    "authors":"This is one of the largest families of flowering plants and is represented nearly worldwide though it is most abundant in the tropical regions of both hemispheres. Important economic members of the family are coffee (Coffea), quinine (Cinchona), madder (Rubia), ipecac (Carapichea Aublet), and various horticultural plants, notably Gardenia, Ixora, Mussaenda, and Pentas. Several genera include pantropical weeds, notably Mitracarpus, Richardia, and Spermacoce, of neotropical origin, and Oldenlandia (Hedyotis) of African origin. A number of species are used for various medicinal purposes.Genera, tribes, and subfamilies of Rubiaceae characteristically either have or lack raphides; this character is generally considered informative taxonomically in this family. Raphides are tiny, needle-shaped crystals that are produced in groups inside some cells of leaf, stem, flower, and fruit tissues. They apparently function to protect the plant from herbivores. Raphides are often visible with a hand lens on dried specimens, particularly in soft tissues such as petals, the calyx hypanthium, and the young leaves at the apex of the stem, but may be difficult to see especially in succulent plants.Leaf domatia are common in Rubiaceae and are sometimes taxonomically informative at least for separation of species. These domatia provide protection for tiny mites that live on the leaves and that help protect the plant from herbivores and fungi by eating insect eggs, small insects, and spores. These domatia occasionally take the form of foveolae or crypts, but more often are formed by small groups or tufts of pubescence, which is sometimes different in form from pubescence found on other parts of the plant.At least half of the species of Rubiaceae have distylous flowers an individual species has two flower forms, the long-styled form (or pin) with the stigmas borne above the anthers and the short-styled form (or thrum) with the anthers borne above the stigmas. An individual plant bears only one flower form, and the flowers are incompatible with other flowers of similar form whether borne on the same or another plant. Heterostyly is unusual in the flowering plants and is found in several other plant families that mostly have three floral forms instead of two with the third form (the homostylous) with the stigmas and anthers borne at the same level. Tristyly has only been documented very rarely for Rubiaceae, although it was noted by FRPS for Chassalia curviflora in China.A number of species of many genera of Rubiaceae have calyx lobes that are unequal in size on an individual flower, and in some species of several genera one or more of the calyx lobes are markedly different, much enlarged and also often petaloid. These structures are found on flowers, where they are typically brightly colored and apparently function to attract pollinators, and\/or on the fruit, where they are dry and brown and apparently function in dispersal of the fruit or seeds. These structures have variously been called \"petaloid calyx lobes,\" a morphologically descriptive term; \"semaphylls,\" a term that refers to the assumed function in pollination; and \"calycophylls,\" the term used here that refers to the leaflike shape of the calyx lobe. These structures are sometimes mistaken for bracts; a few species of Rubiaceae do also have petaloid bracts (e.g., Dunnia), but those structures are inserted on the inflorescence axes or immediately below the ovary of the flower.The woody Rubiaceae are better represented (i.e., more diverse) in moist temperate regions of China than in comparable habitats in North America, as detailed by Latham and Ricklefs (in Ricklefs & Schluter, Spec. Diversity Ecol. Communities, 294-314. 1993). They concluded that this pattern, which is also found in a number of other dicotyledonous families, is due largely to historical factors. The principal factors they identified are the extinction of woody Rubiaceae in these other regions, while the plants were able to persist in E Asia (e.g., Emmenopterys), and the long-term direct connection of the moist temperate and moist tropical zones in E Asia vs. the separation of these zones by deserts and large water bodies in other regions. They agreed with Wolfe (in Nelson & Rosen, Vicariance Biogeogr. 413-427. 1981) that the connections of plant ranges between E North America and E Asia were broken by the end of the Eocene, and thus that species of the several genera that are found in both regions (e.g., Cephalanthus) have had separate evolutionary histories for some time. Several SE Asian Rubiaceae genera, all found in China, appear to represent the most basal living lineages of the family, notably Acranthera, Coptosapelta, and Luculia (Bremer et al., Syst. Biol. 48 413-435. 1999; Bremer & Manen, Pl. Syst. Evol. 225 43-72. 2000; Rydin et al., Pl. Syst. Evol. 278 101-123. 2009).A number of species of Rubiaceae are cultivated as ornamentals; most of these are mentioned and some are keyed and described here.Additional information on many of the cultivated Rubiaceae was presented by Puff and Chamchumroon (Thai Forest Bull., Bot. 31 75-94. 2003).Complete Rubiaceae floras for E Asia are very few. The Chinese Rubiaceae were treated comprehensively in 1999 by FRPS; the treatment here is based primarily on that work. The Fl. URSS was published in English in 2000, but this is an unedited, unmodified translation of the 1958 work. The Fl. Japan has been published in several editions but includes relatively few genera and is rather idiosyncratic. The genus overview within the Rubiaceae of Thailand A Pictorial Guide to Indigenous and Cultivated Genera by Puff et al. (43-240. 2005) is a useful recent reference.Some morphological features that are characteristic of the Rubiaceae have been described, measured, and named very differently by different authors, and the differing terminology has generated some confusion. In particular, the terminology and measurements used for the calyx and gynoecium have differed widely. The ovary of Rubiaceae flowers is typically inferior, and the calyx is gamosepalous with its free portion, or limb, arising from the top of the ovary portion; this limb varies from reduced (i.e., not developed) to developed, and truncate to deeply lobed. Most Rubiaceae authors have distinguished the inferior ovary portion of the flower from the free calyx limb; the ovary portion has sometimes been called simply an ovary, but sometimes considered to include the fused calyx and corolla tissue covering it and called a hypanthium. However, several authors, including in FRPS, have treated as one structure the inferior ovary together with the unlobed lower portion of the calyx limb, when this is present, as the \"calyx tube\" and the lobed portion of the calyx as a separate structure, the calyx lobes. The \"calyx tube\" is often clearly delimited and measurable, but the inclusion of the ovary in this means that this measurement can sometimes include ovaries that have been fertilized and are developing into fruit, thus are larger than and not comparable to the ovaries at anthesis even though the corolla may be still attached to the flowers. Here the ovary or hypanthium portion of the flower is measured separately from the limb; the term \"hypanthium\" is used to link these measurements to those of FRPS. The limb is measured separately here because the length of the tubular portion of this often includes taxonomically useful information, and while the \"calyx tube\" measurement is lost when the fruit are developed, the length of the tubular portion of the free calyx limb is usually still evident on the fruit thus facilitating identification. Another portion of the gynoecium that has been regarded differently by different authors is the distinction between the stigma and style the structures regarded as 2-lobed stigmas by some authors are regarded as a style with 2 separate stigmas by as many other authors. Morphological study of the androecium and gynoecium here during preparation of a flora treatment has not been detailed and no focused effort has been made here to systematize these morphological interpretations.Inflorescence terminology is complicated in most flowering plant families. The terms \"bract\" and \"bracteole\" have been carefully and regularly applied by some Rubiaceae authors, with the term \"bracteole\" used only for the bracts that immediately subtend the flowers or in some cases that are found anywhere along the pedicels, and the term \"bract\" used for the remaining structures. However, other authors have not distinguished these structures, or have not distinguished them regularly or consistently. The term \"floral bract\" here refers to the structures found on the pedicels or that immediately subtend sessile flowers. Bracts and leaves are generally considered homologous structures, and in Rubiaceae these often vary continuously along the inflorescences. In particular, Rubiaceae commonly have somewhat reduced leaves subtending the inflorescences, and bracts that are somewhat enlarged and occasionally leaflike. These structures have been variously called \"reduced leaves\" or \"foliose bracts\" or \"foliaceous bracts\" (here called \"leaflike bracts\"). In particular, many species with branched inflorescences sometimes have rather large, leaflike bracts subtending the basalmost pair of secondary axes; these have been various interpreted as enlarged bracts at the top of the peduncle, or vegetative leaves that are borne at the base of a sessile, tripartite inflorescence.Significant measurements found on plants from outside China are noted in the discussions following the species descriptions and\/or are included within brackets in the descriptions in accordance with Flora of China style.  in FRPS described the seeds and embryos of some Rubiaceae but not others; their descriptions are reported. In many cases no information is available about these features for Chinese Rubiaceae.  in FRPS also described the pollen of a few genera; these reports are not included here because a number of very detailed, extensively documented pollen descriptions are available elsewhere, which show that much variation is found in pollen morphology at the species level in Rubiaceae and as yet Rubiaceae genera are not well characterized in terms of pollen. Thus, the very limited information available only at the genus level here does not seem well integrated into this flora treatment. The counts presented here for leaf veins apply to the secondary veins, as done by the majority of Rubiaceae authors. Many species of Rubiaceae also frequently have rather well-developed though shorter intersecondary veins, which often vary widely in number and degree of development between populations or plants; these apparently were occasionally combined with the secondary veins in the measurements given by FRPS, but such measurements are subject to significant misinterpretation by authors working in other regions and the varied usage in that work adds yet more confusion.Where data were missing from the descriptions in the first draft for the Flora of China, the terms \"unknown,\" \"not known,\" \"not noted,\" and \"not seen\" were retained (with \"not known\" consisted to \"unknown\"). Where these terms were used in the habitats and elevational ranges they were deleted in accordance with the style of previous Flora of China volumes. Where missing data were denoted with question marks, e.g., \"shape??,\" or with constructions such as \"__ × __ ,\" these were deleted because it was not apparent which of the above categories of missing data applied.The genus Khasiaclunea Ridsdale (Blumea 24 347. 1979) is known with certainty from India and Myanmar and provisionally from N Vietnam; this may also be present in China, but no confidently determined specimens have yet been seen. The single species, K. oligocephala (Haviland) Ridsdale (Blumea 24 347. 1979; Adina oligocephala Haviland, J. Linn. Soc., Bot. 33 46. 1897), was reported by Ridsdale (loc. cit.) as \"probably\" found in China; however, this genus is not treated here.Lo Hsienshui, Ko Wancheung, Chen Weichiu, Hsue Hsianghao & Wu Hen. 1999. Rubiaceae (1). In Chen Weichiu, ed., Fl. Reipubl. Popularis Sin. 71(1) i-xvii, 1-432; Lo Hsienshui, Ko Wancheung, Chen Weichiu & Ruan Yunzhen. 1999. Rubiaceae Rubioideae. In Chen Weichiu, ed., Fl. Reipubl. Popularis Sin. 71(2) i-xvi, 1-377; Wan Wenhao. 2000. Theligonaceae. In Chen Chia-jui, ed., Fl. Reipubl. Popularis Sin. 52(2) 147-151."
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Sphenocleaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20289",
    "knowledge_content":[
      "Herbs annual, without latex. Leaves alternate, simple. Inflorescence a dense terminal or leaf-opposed spike, bracteate and bracteolate. Flowers sessile, bisexual, actinomorphic. Calyx epigynous, 5-lobed. Corolla epigynous, tubular, 5-lobed to middle. Stamens 5, inserted at proximal part of corolla tube, alternate with corolla lobes; filament extremely short; anther 2-celled. Ovary inferior, 2-loculed; ovules numerous, anatropous; placentation axile; stigma obscurely 2-lobed, lobes subcapitate. Fruit a capsule, oblate, circumscissile. Seeds numerous, oblong.\r",
      "One species: widely distributed in Old World tropics, including China; introduced in New World tropics.",
      "Sphenocleaceae are only superficially similar to Campanulaceae s.l., and molecular data place them securely in the Solanales. They lack latex; the style is short and without hairs; there is no secondary pollen presentation; and fruit dehiscence is circumscissile, immediately inside the calyx.Hong De-yuan. 1983. Campanulaceae (Sphenocleoideae). In: Hong De-yuan, ed., Fl. Reipubl. Popularis Sin. 73(2): 176-177."
    ],
    "authors":"Deyuan Hong & Nicholas J. Turland"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Stylidiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10860",
    "knowledge_content":[
      "Herbs [rarely small shrubs or cushion plants], without laticifers. Stipules absent. Leaves in rosettes or alternate [rarely whorled or imbricate], simple. Inflorescences terminal, cymes, lax spikes [racemes, panicles, pseudoheads, or corymbs], or with flowers solitary. Flowers perfect [rarely unisexual by abortion], usually zygomorphic. Calyx synsepalous; tube adnate to ovary; limb with 5[-9] distinct or partly connate lobes, occasionally 2-labiate. Corolla synpetalous, [4 or]5[-9]-lobed; lower lobe (labellum) often smaller and reflexed [rarely hooded]. Stamens 2, adnate with style, forming a gynostemium (column); gynostemium often irritable, normally bent to labellar side but snapping to an oppositely bent position when touched; anthers extrorse, 2-celled, protandrous. Ovary inferior, incompletely 2-locular [occasionally 1-locular due to reduction of septum]; ovules few to numerous, on axile or free central placentas, anatropous; stigma entire or 2-cleft. Fruit a capsule, usually septicidal. Seeds minute; seed coat thin; embryo small, embedded in copious endosperm.\r",
      "Four genera and ca. 320 species: Australia, New Zealand, S end of South America, with only Stylidium extending into tropical Asia; one genus and two species in China."
    ],
    "authors":"Deyuan Hong & Juliet A. Wege"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Valerianaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10936",
    "knowledge_content":[
      "Herbs, perennial or biennial, rarely annuals [or shrubs, absent from China], with a characteristic fetid odor caused by monoterpenoid and sesquiterpenoid ethereal oils; vestiture of white, multicellular hairs; taprooted or rhizomatous; roots adventitious. Leaves opposite, basal and cauline, less frequently all basal, simple to pinnatisect or imparipinnate, entire to variously toothed. Inflorescences cymose, simple or compound dichasia or monochasia, bracteate and bracteolate. Flowers perfect or rarely unisexual. Calyx 5-lobed (Nardostachys), reduced to inconspicuous teeth (Patrinia), or setaceous, plumose, and pappuslike (Valeriana). Corolla connate, regular to irregular, sometimes 2-lipped; tube often gibbous (nectariferous) near base; limb (3-)5-lobed; corollas of female flowers 1\/3-1\/2 size of those of perfect or male flowers. Stamens 1-4, inserted near base of corolla tube, weakly to strongly exserted in bisexual and male flowers, vestigial and included in female flowers; anthers versatile, 4-sporangiate, opening by longitudinal slits. Ovary inferior; carpels 3, 1 fertile, with a solitary, pendulous, apical ovule, 2 sterile; style solitary; stigma entire or 3-lobed. Fruit a cypsela (but commonly referred to as an achene), sometimes winged; sterile locules often reduced; calyx persistent. Seed 1, embryo large, straight, and without endosperm.\r",
      "Twelve genera and ca. 300 species: nearly cosmopolitan; three genera and 33 species (18 endemic) in China.",
      "Chiu Lien-ching & Wang Han-jin. 1986. Valerianaceae. In: Lu An-ming & Chen Shu-kun, eds., Fl. Reipubl. Popularis Sin. 73(1): 5-44.",
      "Stamens 3, rarely 4; calyx segments up to 20, inrolled at anthesis, unrolled in mature fruit, becoming plumose and pappuslike.",
      "Bracteoles not enlarged into wings in fruit; caudices nearly always covered with fibrous remains of old leaves; leaves entire.",
      "Bracteoles enlarged into wings in fruit; caudices without fibrous remains of old leaves; leaves segmented or serrate."
    ],
    "authors":"Deyuan Hong, Fred R. Barrie & Charles D. Bell"
  },
  {
    "group_title":"Cucurbitaceae through Valerianaceae",
    "family":"Viburnaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20329",
    "knowledge_content":[
      "Shrubs, less frequently perennial herbs, or small trees. Leaves opposite, simple or compound: ternate, biternate, ternate-pinnate, biternate-pinnate, or odd-pinnate. Inflorescences terminal panicles or umbellate, spicate, or capitate cymes. Flowers bisexual; calyx and corolla both connate, (3-)5-merous. Stamens 5 (Sambucus, Viburnum) or 5, 4, or 3 (Adoxa, Sinadoxa), alternate corolla lobes, inserted on corolla tube; filaments cleft into 2 semi-stamens (in Adoxa, Sinadoxa); anthers 1-celled, peltate, extrorse, longitudinally dehiscent; staminodes 5, 4, or 3, in inner whorl, opposite corolla lobes. Ovary semi-inferior to inferior, 1- or 3-5-loculed; styles 5, 4, or 3, connate or free, or absent; stigmas capitate or 2- or 3-fid. Fruit drupes; seeds 1 or 3-5.\r",
      "Four genera and ca. 220 species: mainly in the N Hemisphere; four genera (one endemic) and 81 species (49 endemic) in China.",
      "Chiu Lien-ching. 1986. Adoxaceae. In: Lu An-ming & Chen Shu-kun, eds., Fl. Reipubl. Popularis Sin. 73(1): 1-5; Hu Jia-qi & Hsu Ping-sheng. 1988. Sambucus and Viburnum. In: Hsu Ping-sheng, ed., Fl. Reipubl. Popularis Sin. 72: 4-104.",
      "Leaves compound; ovary 3-5-loculed; drupes usually 3-5-seeded; shrubs, perennial herbs, or small trees",
      "Perennial herbs less than 30 cm tall; fertile stamens 5, 4, or 3, cleft into 2 semi-stamens, anthers 2-celled",
      "Basal and cauline leaves pinnately compound; inflorescence of several condensed cymes in an interrupted spike.",
      "Basal leaves simple, 3-cleft, or ternately or biternately compound; cauline leaves simple and 3-cleft or ternate; inflorescences condensed capitate, several flowered cymes or racemelike."
    ],
    "authors":"Deyuan Hong, Qiner Yang, Valéry Malécot & David E. Boufford"
  },
  {
    "group_title":"Asteraceae",
    "family":"Asteraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10074",
    "knowledge_content":[
      "Authors: Zhu Shi, Yilin Chen, Yousheng Chen, Yourun Lin(Ling Yuou-ruen), Shangwu Liu, Xuejun Ge, Tiangang Gao, Shixin Zhu, Ying Liu, Christopher J. Humphries, Qiner Yang, Eckhard von Raab-Straube, Michael G. Gilbert, Bertil Nordenstam, Norbert Kilian, Luc Brouillet, Irina D. Illarionova, D. J. Nicholas Hind, Charles Jeffrey, Randall J. Bayer, Jan Kirschner, Werner Greuter, Arne A. Anderberg, John C. Semple, Jan Štěpánek, Susana Edith Freire, Ludwig Martins, Hiroshige Koyama, Takayuki Kawahara, Leszek Vincent, Alexander P. Sukhorukov, Evgeny V. Mavrodiev & Günter Gottschlich",
      "Herbs, subshrubs, or shrubs, rarely trees or climbers, bisexual, monoecious, or sometimes dioecious, many with laticiferous cells or canals and\/or resinous ducts. Leaves often in a basal rosette; cauline leaves usually alternate, more rarely (in China) opposite or whorled, sessile or petiolate, without stipules; petiole sometimes auriculate at base; leaf blade entire to variously lobed or divided. Florets bisexual (perfect), female (pistillate), or functionally male (functionally staminate), solitary or few to many enclosed in an involucre of 1- to many-seriate phyllaries (involucral bracts) to form a capitulum; calyculus of outer bracts sometimes present and often differing markedly from phyllaries. Capitula solitary or few to many arranged in variously formed synflorescences, homogamous or heterogamous, discoid, disciform, radiate, subradiate, radiant, or ligulate; receptacle usually flattened, sometimes slightly concave or convex, rarely conical, smooth or alveolate, paleate (scaly) or epaleate, with bristles, scales, hairs, or naked. Corolla (3-) 5-merous, gamopetalous, tubular or tubular-filiform, and regular, bilabiate, radiate, or ligulate. Stamens (4 or)5, inserted within corolla tube; filaments adnate to proximal part of corolla; anthers basifixed or dorsifixed, usually coalescent into a tube, base caudate or not, apex with (rarely without) a sterile, ovate or lanceolate appendage; pollen grains usually tricolporate, echinate or sometimes lophate or spinulate, often caveate. Style apically bifid (rarely entire); style branches variously shaped, with or without an apical appendage, hairs, or papillae. Ovary inferior, 1-loculed; ovule 1, basal, anatropous. Fruit an achene (cypsela). Pappus consisting of 1 to many rows of scales or bristles, or absent. Seed erect; endosperm scanty; embryo straight.\r",
      "Between 1,600 and 1,700 genera and ca. 24,000 species: cosmopolitan (except Antarctica); 15 tribes (one introduced), 248 genera (18 endemic, 49 introduced), and 2,336 species (1,145 endemic, 109 introduced) in China.",
      "Taxonomic discussion on the Asteraceae is included under the relevant tribes. The following notes apply to the whole family. Modes of reproduction in the Chinese Asteraceae are known only fragmentarily. As regards the world diversity of the family, only about 12% of genera have been studied using cytoembryology to identify the reproduction system. In 3%, agamospermy was found to occur. Probably the most common reproduction system is allogamy with a sporophytic self-incompatibility; occasional selfing is also possible (stigma ageing or mentor effect). More or less obligate autogamy is relatively rare. Other uncommon reproduction systems include gynodioecy, a very rare dioecy (with heterogametic females). Asexual reproduction is a widespread phenomenon in the Asteraceae, with a wide range of mechanisms. In addition to the rare adventitious embryony, there are common types of autonomous apomixis, agamospermy (apospory, diplospory) associated with various forms of embryogenesis (parthenogenesis, apogamety). All the types of reproduction are to be considered in the evaluation of population variation and for taxonomic conclusions because the prevailing type of reproduction substantially influences the variation limits of taxa.Ling Yong, Chen Yi-ling, Shih Chu, Chen Feng-hwai, Chang Chao-chien, Tseng Yong-qian, Hu Chi-ming & Huang Xiu-lan. 1979. Compositae (2): Inuleae-[Heliantheae]-Helenieae. In: Ling Yong, ed., Fl. Reipubl. Popularis Sin. 75: i-xviii, 1-422; Shih Chu & Fu Gou-xun. 1983. Compositae (3): Anthemideae [1]. In: Ling Yong & Shih Chu, eds., Fl. Reipubl. Popularis Sin. 76(1): i-viii, 1-149; Ling Yong, Chen Yi-ling & Shih Chu. 1985. Compositae (1): Carduoideae Kitam.: Vernonieae-[Eupatorieae]-Astereae. In: Ling Yong & Chen Yi-ling, eds., Fl. Reipubl. Popularis Sin. 74: i-xiv, 1-388; Shih Chu. 1987. Compositae (7): Echinopeae [\"Echinopsideae\"], Cynareae. In: Ling Yong & Shih Chu, eds., Fl. Reipubl. Popularis Sin. 78(1): i-ix, [t.] 1-7, 1-226; Liu Shang-wu. 1989. Compositae (4): Senecioneae: Senecioninae [Farfugium, Ligularia, Cremanthodium]. In: Ling Yong & Liu Shang-wu, eds., Fl. Reipubl. Popularis Sin. 77(2): i-vii, 1-188; Ling Yourun (= Ling Yeou-ruenn). 1991. Compositae (3): Anthemideae (2). In: Ling Yong & Ling Yourun (= Ling Yeou-ruenn), eds., Fl. Reipubl. Popularis Sin. 76(2): i-xii, 1-316; Tseng Yung-chien. 1996. Compositae (9): Mutisieae. In: Tseng Yung-chien, ed., Fl. Reipubl. Popularis Sin. 79: i-iv, 1-113; Shih Chu. 1997. Compositae (10): Cichorioideae: Lactuceae. In: Ling Yong & Shih Chu, eds., Fl. Reipubl. Popularis Sin. 80(1): i-xiv, 1-342; Chen Yiling. 1999. Compositae (5): Senecioneae, Calenduleae. In: Chen Yiling, ed., Fl. Reipubl. Popularis Sin. 77(1): i-xiii, 1-369; Ge Xuejun, Ling Yeouruenn & Zhai Datong. 1999. Compositae (11): Cichorieae: Taraxacum. In: Ling Yeouruenn & Ge Xuejun, eds., Fl. Reipubl. Popularis Sin. 80(2): i-iv, 1-94; Shih Chu & Jin Shuying. 1999. Compositae (8): Cynareae [Saussurea]. In: Chen Yiling & Shih Chu, eds., Fl. Reipubl. Popularis Sin. 78(2): i-x, 1-243.",
      "Capitula of 2 kinds, either with only functionally male florets or with only female florets; flowering not precocious",
      "Capitula all alike, homogamous or heterogamous, rarely plants subdioecious and then flowering precocious",
      "Capitula homogamous and all florets ligulate, i.e., corollas with an expanded abaxial, apically 5-toothed, 5-lobed, or 5-cleft limb; latex (milky juice) present.",
      "Capitula heterogamous, or if homogamous then corollas tubular and 5-lobed or zygomorphic and pseudoligulate (5-lobed with one deeper cleft or sinus); plants without or rarely with latex",
      "Capitula heterogamous (marginal florets with a strap-shaped, entire or 2-4-toothed or 2-4-lobed outer limb) or homogamous and corollas 3-5-lobed, actinomorphic",
      "Capitula not in bracteate glomerules; phyllaries not decussate; style branches very short or scarcely bilobed.",
      "Style branch tips shorter than stigmatic lines, or absent; capitula radiate, disciform, or discoid; corollas often yellow.",
      "Style shaft glabrous or with hairs or evident papillae in distal part and\/or style branches with hairs or evident papillae abaxially or apically or on an apical appendage",
      "Style shaft with a papillose-pilose thickening below branches; leaves spiny, at margin finely serrulate-spinulose, or not spiny",
      "Style shaft without a papillose-pilose thickening below branches; leaves neither spiny nor at margin finely serrulate-spinulose",
      "Achene densely hairy, capitula homogamous, plants biennial or perennial, and leaves never grasslike; pappus inserted directly on upper edge of achene, not surrounded by a rim.",
      "Achene glabrous or subglabrous, rarely densely hairy but then capitula radiant, plants annual, or leaves grasslike; pappus insertion surrounded by a ± conspicuous rim or crown.",
      "Achenes large, heteromorphic, outer cymbiform or curved, inner strongly curved to circular; receptacle epaleate; pappus absent.",
      "Achenes small, columnar or compressed, straight or only slightly curved, homomorphic or only slightly heteromorphic, if large then receptacle paleate; pappus present or absent",
      "Phyllaries rather dry, either with distinct scarious margin or papery, brownish, yellowish, or whitish, never herbaceous and green throughout",
      "Anthers tailed at base; phyllaries papery, whitish, brownish, or yellowish, especially in distal part.",
      "Style branches long, slender, subulate, without an apical appendage, hairy abaxially and with stigmatic papillae over entire adaxial surface; capitula homogamous.",
      "Phyllaries uniseriate, but sometimes with an outer series of much shorter bracts (calyculus); involucre cylindric.",
      "Phyllaries uniseriate, but sometimes with an outer series of much smaller bracts (calyculus); capitula never aggregated into a compact synflorescence.",
      "Phyllaries 2- or 3-seriate or imbricate in several series; capitula sometimes aggregated into a compact synflorescence"
    ],
    "authors":"Zhu Shi, Yilin Chen, Yousheng Chen, Yourun Lin(Ling Yuou-ruen), Shangwu Liu, Xuejun Ge, Tiangang Gao, Shixin Zhu, Ying Liu, Christopher J. Humphries, Qiner Yang, Eckhard von Raab-Straube, Michael G. Gilbert, Bertil Nordenstam, Norbert Kilian, Luc Brouillet, Irina D. Illarionova, D. J. Nicholas Hind, Charles Jeffrey, Randall J. Bayer, Jan Kirschner, Werner Greuter, Arne A. Anderberg, John C. Semple, Jan Štěpánek, Susana Edith Freire, Ludwig Martins, Hiroshige Koyama, Takayuki Kawahara, Leszek Vincent, Alexander P. Sukhorukov, Evgeny V. Mavrodiev & Günter Gottschlich"
  },
  {
    "group_title":"Poaceae",
    "family":"Poaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10711",
    "knowledge_content":[
      "Authors: Shou-liang Chen, De-Zhu Li, Guanghua Zhu, Zhenlan Wu, Sheng-lian Lu, Liang Liu, Zheng-ping Wang, Bi-xing Sun, Zheng-de Zhu, Nianhe Xia, Liang-zhi Jia, Zhenhua Guo, Wenli Chen, Xiang Chen, Guangyao Yang, Sylvia M. Phillips, Chris Stapleton, Robert J. Soreng, Susan G. Aiken, Nikolai N. Tzvelev, Paul M. Peterson, Stephen A. Renvoize, Marina V. Olonova & Klaus Ammann",
      "Annual or perennial herbs, or tall woody bamboos. Flowering stems (culms) jointed, internodes hollow or solid; branches arising singly from nodes and subtended by a leaf sheath and 2-keeled prophyll, often fascicled in bamboos. Leaves arranged alternately in 2 ranks, differentiated into sheath, blade, and an adaxial erect appendage at sheath\/blade junction (ligule); leaf sheath surrounding and supporting culm-internode, split to base or infrequently tubular with partially or completely fused margins, modified with reduced blade in bamboos (culm sheaths); leaf blades divergent, usually long, narrow and flat, but varying from inrolled and filiform to ovate, veins parallel, sometimes with cross-connecting veinlets (especially in bamboos); ligule membranous or a line of hairs. Inflorescence terminal or axillary, an open, contracted, or spikelike panicle, or composed of lax to spikelike racemes arranged along an elongate central axis, or digitate, paired, or occasionally solitary; axillary inflorescences often many, subtended by spatheoles (specialized bladeless leaf sheaths) and gathered into a leafy compound panicle; spikelets often aggregated into complex clusters in bamboos. Spikelets composed of distichous bracts arranged along a slender axis (rachilla); typically 2 lowest bracts (glumes) empty, subtending 1 to many florets; glumes often poorly differentiated from accompanying bracts in bamboos. Florets composed of 2 opposing bracts enclosing a single small flower, outer bract (lemma) clasping the more delicate, usually 2-keeled inner bract (palea); base of floret often with thickened prolongation articulated with rachilla (callus); lemma often with apical or dorsal bristle (awn), glumes also sometimes awned. Flowers bisexual or unisexual; lodicules (small scales representing perianth) 2, rarely 3 or absent, 3 to many in bamboos, hyaline or fleshy; stamens 3 rarely 1, 2, 6, or more in some bamboos, hypogynous, filaments capillary, anthers versatile; ovary 1-celled, styles (1 or)2(rarely 3), free or united at base, topped by feathery stigmas, exserted from sides or apex of floret. Fruit normally a dry indehiscent caryopsis with thin pericarp firmly adherent to seed, pericarp rarely free, fleshy in some bamboos; embryo small or large; hilum punctate to linear.\r",
      "About 700 genera and 11,000 species: widely distributed in all regions of the world; 28 tribes, 226 genera (seven endemic), and 1795 species (809 endemic) in China.",
      "Grasses are present throughout China, but the largest area of natural grassland lies in the northern part of the country, forming part of the temperate Eurasian steppe. Much of this area has now been converted from rangeland into farmland with wheat (Triticum) as the major food crop. The moister grasslands of northeast China support forest steppe, the dominant natural grasses being Leymus chinensis and Stipa grandis. The climate becomes progressively drier eastward, supporting steppe and semidesert steppe. Species of Stipa are dominant, with Agropyron, Cleistogenes, Koeleria, and Leymus. Common grasses of the dry alpine steppe of the high Xizang-Qinghai Plateau include species of Elymus, Festuca, Leymus, Poa, Puccinellia, and Stipa. Desert grasses of northwest China include sand-binding species of Aeluropus, Cleistogenes, and Orinus.\r",
      "In warm, subtropical areas of southern China widespread tropical genera are well represented, including Cymbopogon, Digitaria, Eulalia, Paspalum, Pennisetum, and Setaria. The major food crop here is rice (Oryza). Other tropical genera with their center of distribution in southeast Asia extend into China, including Arundinella, Isachne, and Microstegium. Extensive pure stands of Phacelurus latifolius are found in coastal salt marshes, as are introduced species of Spartina. Phragmites species form large colonies in the shallow margins of inland lakes and rivers.\r",
      "The subfamilies of Poaceae are not included here, as they are largely based on non-morphological characters that are not readily available for identification purposes. However, the traditional grass tribes, as broadly accepted over the last two decades, do mainly have a morphological expression, backed up by characteristics of anatomy, embryology, and other cryptic characters. With practice and increasing familiarity with the family, it is usually possible to assign an unknown grass to a tribe without undue difficulty. The tribe is therefore taken as the primary division here.\r",
      "Modern molecular systematic studies are providing new insights into grass relationships. This new information has been incorporated where it has proved possible to link it to morphology, mainly by the separation of Danthonieae from Arundineae and the repositioning of a few individual genera. However, where the new information leads to the redefinition of tribes, or the genera within them, on grounds not easily expressed morphologically, the traditional treatment has been retained. Aveneae are upheld as distinct from Poeae, and Eragrostideae as distinct from Cynodonteae, because they are usually easily recognizable and hence useful for identification. Grass taxonomy is at present undergoing a period of rapid modification. The incorporation of molecular data into the classification scheme is incomplete, alterations are ongoing, and a new system with overall acceptance has not yet emerged. The primary purpose of a Flora is to provide an identification guide, usually for the non-specialist, and it must therefore be based mainly on morphology. Those interested in the latest research and new ideas on grass relationships can find more detailed information in the taxonomic literature. The following is recommended: Columbus, J. T. et al., eds. 2006. Monocots: comparative biology and evolution. [Aliso, 2 volumes]. Rancho Santa Ana Botanic Garden, Claremont.\r",
      "Extensive use has been made of Genera Graminum by Clayton and Renvoize (1986) during the preparation of this volume. In particular, Chen Shouliang and Sylvia Phillips have used the key to tribes and the tribal descriptions there as the basis for those in this volume.\r",
      "The names of the Chinese agrostologists Sun Bixing and Liu Liang are abbreviated as \"B. S. Sun\" and \"L. Liu\" in this volume, but the alternative abbreviations \"B. X. Sun\" and \"L. Liou\" occur sometimes in other literature. The bamboo specialist Xue Jiru (Hsueh Chi-ju) is abbreviated as \"Hsueh\" in this volume because he always gave his name as \"Hsueh\" as the author of plant names, regardless of any different spelling used for him as the author of the works in which the names were published.\r",
      "Wang Zhengping, Ye Guanghan, Yang Yaling, Yu Zehua, Hu Chenhua, Geng Bojie, Feng Xuelin, Jia Liangzhi, Xia Nianhe, Li Dezhu, Zhang Weiping, Xue Jiru, Zhu Zhengde, Zhao Qiseng, Chen Shouliang, Sheng Guoying, Chen Shaoyun, Yao Changyu, Lu Jionglin, Sun Jiliang, Lin Wantao, Yi Tongpei, Zhao Huiru, Wen Taihui & Dai Qihui. 1996. Gramineae (Poaceae) (1). In: Geng Bojie & Wang Zhengping, eds., Fl. Reipubl. Popularis Sin. 9(1): 1–704; Liu Liang, Zhu Taiping, Chen Wenli, Wu Zhenlan & Lu Shenglian. Gramineae (Poaceae) (2). In: Liu Liang, ed., Fl. Reipubl. Popularis Sin. 9(2): 1–405; Lu Sheng-lian, Sun Yong-hua, Liu Shang-wu, Yang Yong-chang, Wu Zhen-lan, Kuo Pen-chao, Yang Hsi-ling, Wang Chao-pin & Tsui Nai-ran. 1987. Gramineae (3). In: Kuo Pen-chao, ed., Fl. Reipubl. Popularis Sin. 9(3): 1–329; Chen Shouliang, Jin Yuexing, Zhuang Tide, Fang Wenzhe, Sheng Guoying, Liu Liang, Wu Zhenlan, Lu Shenglian, Sun Bisin, Hu Zhihao, Wang Song, Sun Xiangzhong, Wang Huiqin, Yang Xilin, Wang Chaopin, Li Binggui & Wen Shaobin. 1990. Gramineae (Poaceae) (4). In: Chen Shouliang, ed., Fl. Reipubl. Popularis Sin. 10(1):1–401; Chen Shouliang, Zhuang Tide, Fang Wenzhe, Sheng Guoying, Jin Yuexing, Liu Liang, Sun Bisin, Hu Zhihao & Wang Song. 1997. Gramineae (Poaceae) (5). In: Chen Shouliang, ed., Fl. Reipubl. Popularis Sin. 10(2): 1–301\r",
      "1.  Institute of Botany, Jiangsu Province and Chinese Academy of Sciences, Nanjing Botanical Garden, Mem. Sun Yat-Sen, Zhongshan Men Wai, Nanjing, Jiangsu 210014, People’s Republic of China.\r",
      "2.  Kunming Institute of Botany, Chinese Academy of Sciences, Heilongtan, Kunming, Yunnan 650204, People’s Republic of China.\r",
      "3.  Missouri Botanical Garden, P.O. Box 299, Saint Louis, Missouri 63166-0299, U.S.A. (Zhu Guanghua died on 2 November 2005.)\r",
      "4.  Northwest Plateau Institute of Biology, Chinese Academy of Sciences, 59 Xiguan Street, Xining, Qinghai 810001, People’s Republic of China.\r",
      "5.  Institute of Botany, Chinese Academy of Sciences, 20 Nanxincun, Xiangshan, Beijing 100093, People’s Republic of China. (Liu Liang died on 2 June 2001.)\r",
      "6.  Department of Biology, Nanjing University, Ling-Hai-Rou, Nanjing, Jiangsu, People’s Republic of China.\r",
      "7.  Department of Biology, Yunnan University, 52 Cuihu North Road, Kunming, Yunnan 650091, People’s Republic of China. (Sun Bixing died on 6 October 2002.)\r",
      "8.  Dendrological Herbarium, Forest Resources and Environment, Nanjing Forestry University, Longpan Road, Nanjing, Jiangsu 210037, People’s Republic of China.\r",
      "9.  South China Botanical Garden, Chinese Academy of Sciences, Guangzhou, Guangdong 510650, People’s Republic of China. (Jia Liangzhi died on 7 November 2004.)\r",
      "10.  Institute of Biology, Guizhou Academy of Sciences, Xiaohe, Guiyang, Guizhou 550009, People’s Republic of China.\r",
      "11.  Dendrological Herbarium, Department of Forestry, Jiangxi Agricultural University, Meiling, Nanchang, Jiangxi 330045, People’s Republic of China.\r",
      "13.  United States National Herbarium, Department of Botany, National Museum of Natural History, MRC-166, Smithsonian Institution, P.O. Box 37012, Washington, DC 20013-7012, U.S.A.\r",
      "14.  National Herbarium of Canada, Research Division, Canadian Museum of Nature, P.O. Box 3443, Station D, Ottawa, Ontario K1P 6P4, Canada.\r",
      "15.  Herbarium: Higher Plants, V. L. Komarov Botanical Institute, Russian Academy of Sciences, 2 Prof. Popov Street, St. Petersburg 197376, Russia.\r",
      "Spikelets arranged in pairs (rarely triads) on fragile racemes; raceme rachis breaking up into segments bearing a sessile and pedicelled spikelet.",
      "Spikelets arranged singly in panicles or racemes (occasionally raceme fragile but spikelets single; or spikelets paired but raceme tough)",
      "Spikelets with strictly 2 florets and no rachilla extension; lower floret staminate or barren, sometimes reduced to an empty lemma, upper floret fertile.",
      "Spikelets with 1 to many florets (if 2 florets, then both fertile, or the lower fertile, or rachilla extension present)"
    ],
    "authors":"' Institutions"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Acoraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20008",
    "knowledge_content":[
      "Perennial herbs, glabrous, aromatic, growing in marshes or as emergent aquatics; laticifers and raphides absent; aerenchyma present. Rhizome creeping, much branched, lacunose, with specialized aromatic oil cells; roots on lower side and bearing leaves at apex. Leaves distichous, bases overlapping, unifacial, ensiform, not differentiated into petiole and blade; intravaginal squamules present in leaf axils; venation parallel. Inflorescence solitary, terminal, borne laterally on leaflike scape (usually interpreted as peduncle and spathe; peduncle with 2 separate vascular systems); continuous shoot arising in axil of leaf preceding inflorescence; spathe much longer than spadix, erect, persistent (appearing merely as a vertical extension of leaflike peduncle); spadix jutting out at an angle from peduncle, sessile, conoid, cylindric and fingerlike or slender and tail-like, flowering from base to top. Flowers bisexual, with perigone, densely arranged, bractless, 3-merous; tepals 6, in 2 whorls of 3, free, thin, arched; stamens 6, in 2 whorls of 3, free, filaments linear-oblong and flattened, anthers introrse, thecae globose-ellipsoid, subopposite, dehiscing by longitudinal slit, connective inconspicuous; pollen monosulcate, ellipsoid, small (15-20 µm), exine shallowly and remotely or more densely foveolate, otherwise psilate, apertural exine subpsilate; gynoecium (pistil) obconic-cylindric, only slightly exceeding tepals, ovary 2- or 3-locular, ovules several per locule, orthotropous (atropous), pendent on apical placenta, both integuments bearing trichomes and inner integument longer than outer, forming micropyle, stigma minute (± punctate), subsessile (a broad stylar region especially seen by longitudinal cut). Fruit a few-seeded berry, oblong-obovoid with thinly leathery pericarp, enclosed by tepals, ± whitish with brownish stigma remnant when fresh, soon drying to straw-brown, 1-5(-9)-seeded. Seed oblong to ellipsoid; testa light brown, with small pits (slightly foveolate) (Acorus calamus) or smooth (A. gramineus), long integumentary trichomes (bristles) present at micropyle (A. gramineus) or absent (A. calamus); embryo axile, cylindric or conoid (A. gramineus), with perisperm and abundant endosperm. 2n = (22), 24, 36, (44), 48.\r",
      "One genus and two species: temperate and subtropical Asia and North America, tropical Asia; introduced and naturalized in Europe, New Guinea (at least partly), and North America (partly); both species in China."
    ],
    "authors":"Heng Li, Guanghua Zhu & Josef Bogner"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Alismataceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10025",
    "knowledge_content":[
      "Herbs, perennial or rarely annual, aquatic or of marshes, sometimes rhizomatous. Leaves basal, linear, lanceolate, elliptic to ovate or orbicular, or sagittate, with elongated sheathing petioles; principal veins parallel with margins and converging toward apex and connected by transverse veins. Flowers often whorled at nodes of scape forming racemes, panicles, or umbels, pedicellate, actinomorphic, bisexual, unisexual, or polygamous, usually bracteate. Sepals 3, persistent, green. Petals 3, deciduous, usually white, sometimes yellowish. Stamens 3 to numerous, whorled, with elongated filaments; anthers 2-celled, extrorse, opening by longitudinal slits. Carpels 3 to numerous, whorled or spirally arranged, free; ovules 1 to several; style persistent. Fruit a cluster or whorl of laterally compressed achenes, drupelets, or occasionally follicles. Seeds curved, with a horseshoe-shaped embryo; endosperm absent.\r",
      "About 13 genera and ca. 100 species: cosmopolitan, especially abundant in temperate and tropical regions of the N Hemisphere; six genera (one introduced) and 18 species (three endemic, one introduced) in China.",
      "Chen Yaodong. 1992. Alismataceae. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 127-145; Zhou Lingyun. 1992. Butomopsis and Limnocharis. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 147-151.",
      "Stamens 8 or 9, or numerous, with sterile staminodes in outermost whorl, filaments flattened; stigmas sessile, carpels 6-9 or numerous, crowded into a head; aquatic herbs with terminal umbels; bracts forming an involucre",
      "Stamens 3 to numerous; style persistent, carpels few to numerous; aquatic or marsh herbs with racemes, panicles, or umbels",
      "Inflorescences much branched, paniculate; fruitlets drupaceous, swollen, with woody endocarp and spongy exocarp.",
      "Inflorescences unbranched, flowers usually solitary or up to 3 in inflorescence; fruitlets achenelike, laterally compressed.",
      "Alisma  LinnaeusButomopsis  KunthCaldesia  ParlatoreLimnocharis  BonplandRanalisma  StapfSagittaria  Linnaeus"
    ],
    "authors":"Qingfeng Wang, Robert R. Haynes & C. Barre Hellquist"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Aponogetonaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10054",
    "knowledge_content":[
      "Herbs, perennial, freshwater aquatic. Rhizome tuberous, with fibrous roots. Leaves submerged and\/or floating, basal, long petiolate, broadly elliptic to linear, with few primary veins and numerous transverse secondary veins, sheathed at base. Inflorescence usually a simple or 2-forked terminal spike; spathe present, but usually very early caducous. Flowers hermaphroditic or unisexual. Perianth segments 1-3 or rarely absent, white, yellow, mauve, or bluish violet, often petaloid, persistent. Stamens 6 to many; filaments elongated, free, filiform or flattened; anthers extrorse, 2-celled, opening by longitudinal slits. Carpels 3-6(-8), free or slightly united near base; ovary superior; style short; ovules 2-8 per carpel. Fruit a whorl of follicles. Seeds without endosperm; embryo straight.\r",
      "Zhou Lingyun & Zhong Xiongwen. 1992. Aponogetonaceae. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 34-36."
    ],
    "authors":"Youhao Guo, Robert R. Haynes & C. Barre Hellquist"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Araceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10056",
    "knowledge_content":[
      "Authors: Heng Li, Guanghua Zhu, Peter C. Boyce, Jin Murata, Wilbert L. A. Hetterscheid, Josef Bogner & Niels Jacobsen",
      "Herbs, perennial, of diverse habit including climbers, floating aquatics, helophytes, pachycaul shrubs, and geophytes. Underground stems absent, or present and then rhizomatous or tuberous; aerial stems variously produced or not, often evergreen; bulbils for vegetative reproduction sometimes produced, e.g., on leaf or on special shoots. Leaves alternate or apparently basal, usually petiolate with sheathing bases, often subtended by prophylls and\/or cataphylls; leaf blade various, e.g., linear, simple (base often cordate to sagittate), sometimes peltate or variously compound (e.g., pinnate, radiate, pedate, or decompound), or still more complex and \"dracontioid\" (elaborate forms of sagittate, hastate, or trisect leaves in which anterior and posterior divisions are highly dissected and subdivided). Inflorescences (sometimes precocious) subtended by membranous prophylls and\/or cataphylls, consisting of a spadix subtended by a spathe. Spathe commonly with tubelike base (margins fused or not) persistent or with deciduous blade. Spadix bearing bisexual or unisexual flowers, in latter case plants paradioecious or monoecious (spadix female proximally and male distally), very rarely with morphologically bisexual but functionally unisexual flowers. Bisexual flowers: tepals 0, 4, or 6; stamens 4-6(-22), filaments free, anthers with 2 thecae; ovary usually 3-loculed or more loculed or 1-loculed (pseudomonomerous). Unisexual flowers almost always naked [rare exceptions (only 3 genera, these all from Africa, including cultivated Zamioculcas with tepalate flowers)]: male represented by 1-6 (usually 2-4) free stamens or 2-12 (rarely up to 32) stamens connate into a synandrium overtopped by a common synconnective, anthers often subsessile, usually dehiscing apically by pores or slits (straight or horseshoe-shaped); female flowers consisting of a single ovary (sometimes associated with a sterile staminode), commonly 1-loculed (sometimes with 3 or 4 locules), ovules 1 to many per locule, placentation parietal, axile, basal, or apical. Pollen grains aperturate or inaperturate, exine of various ornamentation. Most genera (Aroideae s.l.) with inaperturate pollen grains without sporopollenin. Sterile (neuter) flowers derived from male or female flowers sometimes present at apex or base of female and\/or male zones of spadix. Spadix sometimes with a sterile, terminal appendix. Fruit usually a head of 1- to several-seeded indehiscent separate berries, or dehiscent via shedding stylar plate (Monstereae excluding Amydrium) or syncarpous and apically dehiscent (Cryptocoryne) or syncarpous and indehiscent (Syngonium, cultivated), commonly red, green, white, or yellow, rarely blue.\r",
      "About 110 genera and more than 3,500 species: all parts of the world except polar regions and the driest deserts, chiefly in tropical and subtropical regions; 26 genera and 181 species (72 endemic) in China.",
      "There is an abundance of Araceae in the S and SW provinces of China. The NE and NW regions are poorer. About 50% of Araceae species in China are medicinal plants; for example, Arisaema heterophyllum, Pinellia pedatisecta, and P. ternata have been used since ancient times. Tubers of Amorphophallus and Colocasia are used for food or in industry for starch. Pistia is very valuable as feed for pigs and sometimes is cultivated as an ornamental plant in aquatic gardens.The following genera are not native to China but are cultivated there: Aglaonema Schott, Anthurium Schott, Caladium Ventenat, Dieffenbachia Schott, Monstera Adanson, Philodendron Schott, Spathiphyllum Schott, Syngonium Schott, Zamioculcas Schott, and Zantedeschia Sprengel.Li Hen. 1979. Araceae (excluding Acorus). In: Wu Cheng yih & Li Hen, eds., Fl. Reipubl. Popularis Sin. 13(2): 1-242.",
      "Plants without prickles (unarmored); leaves deciduous, oblong-cordate; inflorescences carried at ground level with most of peduncle hypogeal; plants of boreal habitats.",
      "Plants armored with prickles; leaves evergreen, sagittate or hastate to pinnatifid or pinnatipartite; inflorescence carried on an erect, aerial peduncle; plants of tropical habitats.",
      "Plants climbing, not aquatic and\/or helophytic; spathe deciduous; fruit various, if red then spathe caducous; plants of tropical habitats",
      "Inflorescences solitary or at most 3 held loosely together; flowers without perigone; fruit ovoid, white at maturity.",
      "Inflorescences several together distichously arranged; flowers with reduced inconspicuous perigone; fruit truncate, red at maturity.",
      "Seeds 2-4 per fruit on an intrusive parietal placenta; leaves pinnately divided with pinholes along midrib.",
      "Spathe brightly colored (inside commonly yellow or purple-red); female flowers with staminodes (staminodes absent in S. griffithii); stem a repent or suberect epigeal rhizome.",
      "Plant without conspicuous erect aerial stolons, if stolons present then these decumbent and bearing tubercles at tips",
      "Mature infructescences declined to pendent; placentation parietal; fruit < 3 mm (to 5 mm in C. gigantea), pale yellow to brown and fruit-smelling when ripe; seeds small, very numerous per fruit.",
      "Mature infructescences erect; placentation basal; fruit > 4 mm, red when ripe, odorless; seeds large, few per fruit.",
      "Spadix appendix absent (spadix fertile to apex), or if present then usually consisting of clearly defined subglobose sterile (neuter) flowers",
      "Spadix appendix present, ± smooth to rugulose, hairy or echinate, without subglobose sterile (neuter) flowers, or if such sterile flowers present then usually confined to proximal part or base",
      "Spathe wholly persistent into fruiting, splitting from base to apex at fruit maturity; spathe free from spadix; spadix appendix absent; vegetative tissues aromatic (terpenoids) when crushed.",
      "Spathe limb deciduous during anthesis, proximal spathe persisting to fruiting and then splitting from apex to base at fruit maturity; much of female zone of spadix adnate to spathe; spadix appendix present; vegetative tissues not aromatic.",
      "Spadix unisexual, or if bisexual then male and female zones contiguous or separated by sterile zone usually covered with staminodes",
      "Leaves variously divided (most commonly pedate to pedatisect but not decompound), very rarely entire; berries ripening reddish.",
      "Leaves commonly solitary, usually decompound, very rarely pedate, never entire; berries ripening red or blue.",
      "Appendix with a stipelike smooth part below base or contiguous with male zone, whorl of staminodes absent above male zone; placentation basal",
      "Sterile zone between female and male zones with smooth naked distal part, base with various numbers of staminodes or whole zone covered with staminodes but then leaves always entire and proximal staminodes spatulate (in T. flagelliforme).",
      "Sterile zone between female and male zones fully covered with staminodes, or grooved and with staminodes only at base; leaves usually pedate, rarely entire (in S. giganteum); staminodes never spatulate"
    ],
    "authors":"Heng Li, Guanghua Zhu, Peter C. Boyce, Jin Murata, Wilbert L. A. Hetterscheid, Josef Bogner & Niels Jacobsen"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Arecaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10061",
    "knowledge_content":[
      "Stems solitary or clustered, short and subterranean, erect, or climbing. Leaves pinnate, palmate, or costapalmate, spirally or rarely distichously arranged, sometimes spiny; sheaths usually open, sometimes closed and forming crownshafts, in climbing plants usually with knees and sometimes with flagella; petioles short or absent to elongate, smooth, spiny, in palmate leaves with a hastula at apex, rarely hastula absent; rachis short to elongate, absent in palmate leaves, sometimes extended into a whiplike climbing organ (cirrus); pinnae in pinnate leaves either regularly or irregularly arranged along rachis, spreading in 1 or several planes, variously shaped, mostly reduplicate, rarely induplicate, sometimes jagged or lobed at apices, rarely gray abaxially; segments in palmate leaves variously arranged, single or multi-fold, split to varying degrees, mostly induplicate, rarely reduplicate. Plants monoecious, sometimes dioecious, iteroparous (pleonanthic) or less often semelparous (hapaxanthic). Inflorescences borne among or below leaves, solitary or rarely multiple at each node; peduncle bearing a prophyll and usually 1 or more peduncular bracts; rachis bearing prominent or much-reduced rachis bracts; rachillae 1 to many, bearing flowers in various arrangements, often solitary, paired, in threes (triads) or more; flowers usually with 3 sepals, 3 petals, 6 stamens, and 3 carpels. Fruits variously shaped and colored, sometimes covered with overlapping scales; endosperm ruminate or homogeneous; germination remote or adjacent; eophylls undivided, bifid, pinnate, or palmate.\r",
      "About 183 genera and ca. 2,450 species: tropical and subtropical areas in Africa, the Americas, Asia, Madagascar, and the Pacific; 18 genera (two introduced) and 77 species (27 endemic, four introduced, including Areca catechu, Arenga pinnata, Cocos nucifera, and Phoenix dactylifera) in China.",
      "A very wide range of palm species is grown as ornamentals in botanical gardens, including those in the humid, tropical parts of China. A few are more widely grown in China and are listed at the end of this account.\r",
      "Pei Shengji, Chen Sanyang & Tong Shaoquan. 1991. Palmae. In: Pei Shengji & Chen Sanyang, eds., Fl. Reipubl. Popularis Sin. 13(1): 1-172.\r",
      "Archontophoenix H. Wendland & Drude (假槟榔属 jia bin lang shu). One species is cultivated in tropical and subtropical areas of Fujian, Guangdong, Guangxi, Hainan, Taiwan, and Yunnan: A. alexandrae (F. Mueller) H. Wendland & Drude (Linnaea 39: 212. 1875; Ptychosperma alexandrae F. Mueller, Fragm. 5(33): 47. 1865; 假槟榔 jia bin lang), native to Australia.",
      "Borassus Linnaeus (糖棕属 tang zong shu). One species is cultivated in S Yunnan (Xishuangbanna): B. flabellifer Linnaeus (Sp. Pl. 2: 1187. 1753; 糖棕 tang zong), native to Bangladesh, Cambodia, India, Indonesia, Laos, Myanmar, Sri Lanka, Thailand, and Vietnam.",
      "Butia (Beccari) Beccari (布迪椰子属 bu di ye zi shu). One species is cultivated as an ornamental: B. capitata (Martius) Beccari (Agric. Colon. 10: 507. 1916; Cocos capitata Martius, Hist. Nat. Palm. 2: 114. 1826; 布迪椰子 bu di ye zi), native to Brazil and Uruguay.",
      "Corypha Linnaeus (贝叶棕属 bei ye zong shu). One species is cultivated in S Yunnan (Xishuangbanna): C. umbraculifera Linnaeus (Sp. Pl. 2: 1187. 1753; 贝叶棕 bei ye zong), native to India and Sri Lanka.",
      "Dypsis Noronha ex Martius (散尾葵属 san wei kui shu). One species is cultivated in S China: D. lutescens (H. Wendland) Beentje & J. Dransfield (Palms Madagascar, 212. 1995; Chrysalidocarpus lutescens H. Wendland, Bot. Zeitung 36: 117. 1878; 散尾葵 san wei kui), native to Madagascar.",
      "Elaeis Jacquin (油棕属 you zong shu). One species is cultivated in Hainan, Taiwan, and Yunnan: E. guineensis Jacquin (Select. Stirp. Amer. Hist. 280. 1763; 油棕 you zong), native to W Africa but now very widely grown for its oil-rich fruits.",
      "Hyophorbe Gaertner (酒瓶椰子属 jiu ping ye zi shu). One species is becoming a common street tree in Hainan: H. lagenicaulis (L. H. Bailey) H. E. Moore (Principes 20: 119. 1976; Mascarena lagenicaulis L. H. Bailey, Gentes Herb. 6: 74. 1942; (酒瓶椰子 jiu ping ye zi), native to Round Island, Mauritius.",
      "Raphia P. Beauvois (酒椰属 jiu ye shu). One species is recorded as cultivated in China: R. vinifera P. Beauvois (Fl. Oware 1: 77. 1806; 酒椰 jiu ye), native to W Africa.",
      "Roystonea O. F. Cook (王棕属 wang zong shu). Two species are recorded as cultivated in China: R. oleracea (Jacquin) O. F. Cook (Bull. Torrey Bot. Club 28: 554. 1901; Areca oleracea Jacquin, Select. Stirp. Amer. Hist. 278. 1763; 菜王棕 cai wang zong) and R. regia (Kunth) O. F. Cook (Science, n.s., 12: 479. 1900; Oreodoxa regia Kunth in Humboldt et al., Nov. Gen. Sp. 1, ed. 4°: 305. 1816; 大王椰子 da wang ye zi), both native to the Caribbean region.",
      "Sabal Adanson (箬棕属 ruo zong shu). Two species are recorded as cultivated in China: S. minor (Jacquin) Persoon (Syn. Pl. 1: 399. 1805; Corypha minor Jacquin, Hort. Bot. Vindob. 3: 8. 1776; Chamaerops acaulis Michaux; 小箬棕 xiao ruo zong) and S. palmetto (Walter) Loddiges ex Schultes & J. H. Schultes (Syst. Veg. 7: 1487. 1830; Corypha palmetto Walter, Fl. Carol. 119. 1788; 箬棕 ruo zong), both native to SE United States.",
      "Syagrus Martius (金山葵属 jin shan kui shu). One species is cultivated in S China: S. romanzoffiana (Chamisso) Glassman (Fieldiana, Bot. 31: 382. 1968; Cocos romanzoffiana Chamisso, Choris. Voy. Pittor. 5. 1822; 皇后葵  huang hou kui), native to Brazil.",
      "Washingtonia Rafinesque (华盛顿棕属 hua sheng dun zong shu). One species is cultivated in Fujian, Guangdong, Taiwan, and Yunnan: W. filifera (Linden ex André) H. Wendland (Bot. Zeitung (Berlin) 37: lxi, 68. 1880; Pritchardia filifera Linden ex André, Ill. Hort. 24: 32. 1877; 毛华盛顿棕 mao hua sheng dun zong), native to Mexico (Baja California) and the United States (Arizona, California); and one species is cultivated in S China: W. robusta H. Wendland (Gart.-Zeitung (Berling) 2: 198. 1883; 华盛顿棕 hua sheng dun zong), native to Mexico (Baja California, Sonora).\r",
      "Cirrus (plural cirri) – a long, narrow extension of the leaf rachis with small, grapnel-like spines, found in climbing palms.",
      "Clustered – a term applied to an individual palm with basal axillary branching giving several stems in the same plant.",
      "Crownshaft – a cylindric structure formed by the base of the leaves, and appearing as an extension of the stem.",
      "Flagellum (plural flagella) – a modified inflorescence consisting of a long, whiplike organ covered with recurved spines, found in some climbing species of Calamus.",
      "Hastula – in palmate leaves, a flap of tissue borne at the apex of the petiole, where it joins the blade, usually on the adaxial surface.",
      "Induplicate – of a pinna or segment in which the central axis of a fold is abaxial and the margins adaxial (i.e., V-shaped in cross section).",
      "Infrafoliar – of an inflorescence reaching anthesis below the leaves, and free of its subtending leaf.",
      "Interfoliar – of an inflorescence reaching anthesis while still subtended by its leaf. Interfoliar inflorescences may become infrafoliar in fruit.",
      "Iteroparous (syn. pleonanthic) – the condition of a stem with a relatively long reproductive phase, typically of over 20 years duration, before death.",
      "Reduplicate – of a pinna or segment fold in which the central axis of a fold is adaxial and the margins abaxial (i.e., L-shaped in cross section).",
      "Remote germination – germination in which the seedling develops at some distance from the seed, by extension of the cotyledonary petiole.",
      "Semelparous (syn. hapaxanthic) – the condition of a stem with a relatively short reproductive phase, typically of 1–7 years duration, before death.",
      "Leaf blades not or seldom split to their bases, segments single or multi-fold, not wedge-shaped, with pointed or split apices",
      "Adult leaves markedly costapalmate; petioles with stout spines along margins; fruits globose to ellipsoid, not grooved.",
      "Adult leaves palmate; petioles with small, blunt spines along margins; fruits kidney-shaped or oblong, grooved.",
      "Knees on leaf sheaths absent; inflorescences borne simultaneously at apex of stem, their production ending life of stem (semelparous); inflorescence branches covered with prominent, overlapping bracts obscuring flowers.",
      "Knees on leaf sheaths usually present; inflorescences borne sequentially along stem, their production not ending life of stem (iteroparous); inflorescence branches without prominent, overlapping bracts, flowers visible",
      "Cirri always present; inflorescences not flagellate, usually shorter than leaves, with boat-shaped bracts splitting their entire length and then either falling off or remaining attached and enclosed by prophyll, without grapnel-like spines.",
      "Cirri present or absent; inflorescences flagellate or not flagellate, usually longer than leaves, with sheathing, tubular bracts not or only briefly splitting and remaining attached, not enclosed by prophyll, usually with grapnel-like spines.",
      "Leaf sheaths closed and forming a crownshaft; inflorescences borne below crownshaft, with only 1 bract (or bract scar); only apical pinnae with lobed margins",
      "Leaf sheaths open, not forming a crownshaft; inflorescences borne among leaves, with several bracts (or bract scars); all pinnae with lobed or jagged margins",
      "Apical few nodes of stems covered with reddish brown scales; apical part of rachillae not shriveling, male and female flowers borne all along rachillae.",
      "Apical few nodes of stems green, without scales; apical part of rachillae with male flowers only, shriveling after flowers are shed.",
      "Pinnae strongly asymmetric, scarcely to deeply lobed along margins; sepals of male flowers joined at their bases into a cupule.",
      "Pinnae ± symmetric, notched but usually not lobed along margins; sepals of male flowers free, imbricate."
    ],
    "authors":"Shengji Pei, Sanyang Chen, Lixiu Guo, John Dransfield & Andrew Henderson"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Burmanniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10133",
    "knowledge_content":[
      "Herbs, annual or perennial, small, mycotrophic, semi-mycotrophic, or autotrophic, often rhizomatous or tuberous. Leaves alternate, simple, entire; autotrophic species with basal rosette leaves; all with cauline leaves. Inflorescences terminal, many-flowered cymes or racemes, or flower solitary. Flowers bisexual. Perianth of 1 or 2 whorls and each whorl of 3 tepals, corolline, tubular or campanulate. Perianth tube often 3-angled or 3-winged; tepals sometimes appendaged; appendages terminal, elongated, slender. Stamens 3 or 6, if 3 then subsessile in perianth throat, if 6 then pendent in perianth tube; connectives large, often appendiculate. Ovary inferior, 1-loculed with parietal placentation or 3-loculed with axile placentation; ovules numerous, anatropous, bitegmic; style filiform, shortly cylindric, or conic; stigmas 3, sometimes connate. Fruit capsular, occasionally fleshy, with either persistent perianth tube and style or only persistent basal ring of perianth, dehiscence irregular or by transverse ventral slits. Seeds small, numerous; endosperm present.\r",
      "About 16 genera and 148 species: tropical and subtropical regions; three genera and 13 species (two endemic) in China.",
      "Wu Te-lin & Chen Sen-jen. 1981. Burmanniaceae. In: Wu Te-lin, ed., Fl. Reipubl. Popularis Sin. 16(2): 169-175.",
      "Perianth tube salverform, cylindric, trigonous, or campanulate; style ± as long as perianth tube; stamens 3"
    ],
    "authors":"Delin Wu, Prof. Dianxiang Zhang & Richard M. K. Saunders"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Butomaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10135",
    "knowledge_content":[
      "Herbs, perennial, aquatic or of swamps, rhizomatous, usually with milky juice. Leaves usually emersed, basal, alternate, linear to orbicular, sheathing at base, sessile, triquetrous. Flowers hermaphroditic, in terminal, long pedunculate umbels within erect scapes, long pedicellate, with 3 free bracts. Perianth segments in 2 series, outer 3 usually sepal-like, inner 3 petal-like and usually thin and deciduous. Stamens 9, free; anthers basifixed, 2-celled, opening by longitudinal slits. Carpels 6, connate at base; ovules numerous. Fruit a whorl of follicles; follicles with apical long beak. Seeds numerous, without endosperm; embryo straight.\r",
      "One genus and one or two species: best represented in tropical areas of the Americas, also in S Africa, Asia, Europe, and North America; one species in China.",
      "Zhou Lingyun. 1992. Butomaceae (excluding Butomopsis and Limnocharis). In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 146-147."
    ],
    "authors":"Qingfeng Wang, Robert R. Haynes & C. Barre Hellquist"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Corsiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10220",
    "knowledge_content":[
      "Herbs, perennial, achlorophyllous, holomycotrophic, rhizomatous or tuberous. Stem unbranched. Leaves alternate, amplexicaul, small. Flowers solitary, terminal, bisexual or unisexual, epigynous. Perianth of 6 tepals in 2 whorls, zygomorphic; posterior tepal large, broad, sometimes with basal callus; other tepals linear-filiform. Stamens 6; filaments short; anthers dorsifixed, dehiscence extrorse; pollen (not known from Corsiopsis) 1-aperturate. Gynoecium syncarpous, 3-carpellate; ovary unilocular with 3 parietal placentae; ovules numerous, anatropous, bitegmic, tenuinucellate; style absent or short; stigmas 3. Fruit (not known from Corsiopsis) capsular, with 3 valves. Seeds (not known from Corsiopsis) numerous, very small, winged; embryo rudimentary at time of release.\r",
      "Three genera and 29 species: E Asia, Australia, Pacific islands (New Guinea, Solomon Islands), South America; one genus (endemic) with one species in China."
    ],
    "authors":"Prof. Dianxiang Zhang & Richard M. K. Saunders"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Cymodoceaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10244",
    "knowledge_content":[
      "Plants submerged in salt water. Rhizomes creeping, usually slender. Stems shortened. Leaves sessile, alternate, subopposite, or crowded at nodes, linear, with conspicuous midvein, sheathing at base. Plants dioecious. Flowers minute, unisexual, solitary or in cymes. Male flowers pedunculate; perianth of 3 small scales or absent; stamens 1-3; anthers connate, sessile, longitudinally dehiscent; pollen grains threadlike. Female flowers sessile; perianth absent or cupular or of 3 segments; carpels 2, free; style simple or divided into 2(-4) filiform stigmas; ovule 1, pendulous. Fruitlet achene- or nutlike. Seeds without endosperm.\r",
      "Four genera and 16-20 species: tropical and subtropical regions worldwide; three genera and four species in China.",
      "Guo Youhao & Li Qingyi. 1992. Halodule and Syringodium. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 96-102; Zhou Lingyun, You Jun & Zhong Xiongwen. 1992. Cymodocea. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 107.",
      "Styles divided into 2 filiform stigmas; anthers attached at same height on stalk; leaves 2-7 together on short erect shoots, 7-17-veined."
    ],
    "authors":"Youhao Guo, Robert R. Haynes & C. Barre Hellquist"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Cyperaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10246",
    "knowledge_content":[
      "Authors: Lun-Kai Dai, Prof. Song-Yun Liang, Shuren Zhang, Yancheng Tang, Tetsuo Koyama, Gordon C. Tucker, David A. Simpson, Henry J. Noltie, Mark T. Strong, Jeremy J. Bruhl, Karen L. Wilson & A. Muthama Muasya",
      "Herbs, annual or perennial, rhizomatous to stoloniferous. Culms (stems) simple, often 3-sided. Leaves basal and\/or cauline, often 3-ranked, comprising a blade and sheath but sometimes only sheath present; sheath open or closed; ligule often present, sometimes on opposite side to leaf blade; leaf blade usually linear, grasslike, sometimes basally broader and constricted into a pseudopetiole. Involucral bracts 1 to several, leaflike or glumelike. Inflorescences unbranched and spicate or capitate, to branched and anthelate (umbel-like) or paniculate, comprising 1 to many ultimate inflorescence units, these either indeterminate and called spikelets or in a few genera determinate and called pseudospikelets (see explanation below). Spikelets with 1 to many glumes, sometimes reduced to a single flower and aggregated into unisexual spikes; glumes membranous to leathery, spirally arranged or 2-ranked, each subtending a single flower. Pseudospikelets comprising 2-12 membranous scalelike floral bracts on a much reduced axis; lowest 2 bracts opposite, keeled, pseudospikelet subtended and usually hidden by a glumelike bract; bracts spirally arranged and aggregated into spikeletlike spikes. Flowers bisexual or unisexual with plants monoecious or rarely dioecious. Perianth absent or reduced to bristles or scales. Stamens 1-3; anthers basifixed. Ovary 2- or 3-carpellate, unilocular, with a single ovule; style divided or rarely undivided, base sometimes persistent and variously shaped in fruit; stigmas 2 or 3. Fruit usually a hard 2- or 3-sided nutlet, rarely with a succulent or corky exocarp, surface smooth or variously minutely patterned, sometimes partially or completely enclosed by an enlarged basal prophyll (utricle).\r",
      "One hundred and six genera and ca. 5,400 species: worldwide except Antarctica; 33 genera and 865 species (326 endemic, five introduced) in China.",
      "Recent phylogenetic studies (e.g., D. A. Simpson et al., Aliso 23: 72-83. 2007; A. M. Muasya et al., Bot. Rev. (Lancaster) 75: 52-66. 2009) suggest that tribal and generic delimitation in Cyperaceae is likely to be modified in the future.The closest relatives to Cyperaceae are Juncaceae and Thurniaceae (D. A. Simpson in P. Rudall, P. J. Cribb, D. F. Cutler & C. J. Humphries, eds., Monocot. Syst. Evol. 2: 497-509. 1995) in the order Poales. Poaceae, which shares some characteristics of Cyperaceae, such as wind pollination and reduced floral structure, has often been placed near to Cyperaceae but is now shown to be more distantly related (H. P. Linder & E. A. Kellogg in P. Rudall et al., loc. cit.: 473-496; D. A. Simpson in P. Rudall et al., loc. cit.: 497-509).Inflorescence structure in Cyperaceae is notoriously difficult to interpret due to its highly reduced nature. Consequently, the terminology used in describing parts of the inflorescence can be confusing with several terms often being applied to the same structure. In addition, several terms are also used in the Poaceae, but they do not always relate to the same structure in both families. A laudable attempt to standardize terminology in Cyperaceae was made by I. Kukkonen (Ann. Bot. Fenn. 31: 37-43. 1994). In our treatment we have attempted to keep terminology as simple as possible.Inflorescences are generally either unbranched or very shortly branched and spicate or capitate in appearance to prominently branched and paniculate or anthelate (umbel-like), with variations around these. The basic unit of the inflorescence in most Cyperaceae is the spikelet. This comprises a very short to elongated axis, which subtends one to many scalelike bracts, referred to here as glumes. Each glume subtends and partially hides a single very small, bisexual or unisexual flower, which may or may not have a perianth. The perianth, when present, is reduced to bristles or scales. There may be 1-3 stamens and a pistil comprising an ovary, style, and 2 or 3 stigmas. The ovary gives rise to a hard, 1-seeded nutlet (sometimes referred to as an achene). Spikelets tend to be aggregated into larger structures known as spikes. In the tribe Cariceae this basic structure is modified such that the spikelet is reduced to a single flower that is enclosed by a saclike structure known as a utricle, the latter being a modified prophyll at the base of the spikelet. The utricle is subtended by a glumelike bract, and the whole structure is again aggregated with others into spikes. Some confusion arises with caricoid spikes especially as the spikelets comprise only one flower and are subtended by a glumelike bract. This has meant that spikes are sometimes referred to as spikelets and the glumelike bracts as true glumes.The spikelet is indeterminate, i.e., having no terminal flower. However, in Hypolytrum, Lepironia, and Mapania, the basic inflorescence unit has an apparently terminal female flower. To distinguish this type of unit, the term pseudospikelet is used here; some authors refer to it as a spicoid. Its structure is rather different to that of the spikelet, comprising 2-12 scalelike floral bracts on a very much reduced axis. The two lowest bracts are opposite, keeled, and often enclose the upper bracts (when the latter are present). The lower bracts subtend a male flower comprising a single stamen, the upper bracts usually being empty. The terminal flower, which is not subtended by a floral bract, is female. There are no perianth bristles or scales, and the whole structure is subtended and partially to fully hidden by a glumelike bract. These are again aggregated into spikes, but there is further confusion in terminology with the spikes sometimes being referred to as spikelets. The above interpretation of the pseudospikelet is widely accepted, although some workers have interpreted it as a single flower.One of us (Dai) believes that if Kyllinga and Pycreus are treated as separate genera from Cyperus, as they are in this treatment, then Juncellus and Mariscus should also be separated from Cyperus on account of their distinct morphological characters.Tang Tsin & Wang Fa-Tsuan. 1961. Cyperaceae (1). In: Tang Tsin & Wang Fa-Tsuan, eds., Fl. Reipubl. Popularis Sin. 11: i-xv, 1-261; Liang Song-yun, Dai Lun-kai, Tang Yan-cheng & Li Pei-chun. 2000. Cyperaceae (2). In: Dai Lun-kai & Liang Song-yun, eds., Fl. Reipubl. Popularis Sin. 12: i-xxii, 1-582.For accurate identification of Cyperaceae good fruiting material should be used wherever possible. Indeed this is essential in certain genera, such as Fimbristylis and Scleria. It is also important to have underground parts as these may be diagnostic for some species. Care is needed when counting the number of stigmas as these are easily broken off. Several should be observed from the same specimen. Care is also needed when counting the stamens. Anthers break off easily leaving the filaments partially hidden within the glumes. Always check that filaments are present. Also, care should be taken to distinguish perianth bristles from filaments as the number of perianth bristles may be useful in separating taxa. The bristles will usually have antrorse or retrorse hairs on them.\r",
      "Amphicarpous - applied to a small secondary inflorescence occurring at the base of the culm in certain genera, particularly Schoenoplectus.",
      "Anthela (plural anthelae, adjective anthelate) - an umbel-like inflorescence in which the primary branches ± arise from the same point, the inflorescence being subtended by 1 to several involucral bracts.",
      "Compound - applied to an inflorescence or partial inflorescence where there are 2 orders of branching, i.e., primary and secondary.",
      "Conic - cone-shaped, being wider at the base than the apex; here it is used as the 3-dimensional equivalent of lanceolate.",
      "Contraligule - membranous, ligulelike structure at the apex of the leaf sheath on the side of the culm facing away from the leaf blade.",
      "Decompound - applied to an inflorescence or partial inflorescence where there are 3 or more orders of branching, i.e., primary, secondary, and tertiary.",
      "Determinate - applied to an inflorescence with terminal flowers and therefore not capable of indefinite growth.",
      "Disk - 3-lobed structure occurring at the base of the nutlet in Scleria and Diplacrum. In some species it may be indistinct, whereas in Scleria sumatrensis it is developed into a cuplike structure ± covering the nutlet.",
      "Involucral bract - bract or bracts occurring at the point where the inflorescence arises from the culm. Vary from being leaflike to glumelike or setaceous.",
      "Ligule - membranous tissue or fringe of hairs occurring at the apex of the leaf sheath on the inner side at the point where it joins the leaf blade.",
      "Nutlet - hardened, usually minute, 1-seeded fruit, the surface of which may be smooth to variously patterned and a diagnostic character for many species. Often called an achene in literature on Cyperaceae.",
      "Paniculate - inflorescence comprising partial inflorescences arising at intervals along the main inflorescence axis.",
      "Perianth bristles - small bristlelike or scalelike structures at the base of the nutlet. Presumed to be the remnants of a fully developed perianth.",
      "Prophyll - 2-keeled structure at the base of a branch within an inflorescence. It may be glumelike or tubular or, in Kobresia and Carex, developed into a utricle.",
      "Pseudospikelet - the ultimate inflorescence unit in Hypolytrum, Lepironia, and Mapania. Has a much reduced axis and appears flowerlike. Comprises 2-12 scalelike bracts each subtending a male flower. The whole structure is terminated by a female flower, thus making it determinate.",
      "Rhizome - underground stem, which may be short, often giving the plant a tufted habit, or long creeping.",
      "Scalelike bract - membranous scalelike structure in a pseudospikelet each of which subtends a male flower comprising a single stamen only. The lowest 2 floral bracts usually have a keel and are opposite.",
      "Septate - partitioned. In some species, particularly in Eleocharis, the culm has a series of horizontal septa, which are best seen in dried material.",
      "Simple - applied to an inflorescence or partial inflorescence where there is only one order of branching, i.e., primary branching",
      "Spike - an aggregation of spikelets or pseudospikelets; sometimes the whole structure is similar in appearance to a spikelet (in Ascolepis Nees ex Steudel, Carex, Hypolytrum, Kobresia, Lepironia, Lipocarpha, and Mapania).",
      "Spikelet - the ultimate inflorescence unit in most genera of Cyperaceae. Has an elongated or reduced axis with 1 to many glumes, each glume subtending a bisexual or unisexual flower.",
      "Stolon - in Cyperaceae this term is applied to a thin underground branch arising from the rhizome or base of the culm. Each stolon terminates in an aerial shoot.",
      "Style base - a variously shaped portion at the base of the style which is persistent on the mature nutlet in some genera.",
      "Utricle - a prophyll which has developed into a characteristic bottlelike structure and partially to completely surrounds the nutlet in Kobresia and Carex.",
      "The Cyperaceae are the third largest family in the Monocotyledons (after Orchidaceae and Poaceae). The largest genera in China are Carex (527 spp.), Cyperus (62 spp.), Fimbristylis (53 spp.), Eleocharis (35 spp.), and Scleria (24 spp.). In the present treatment we follow D. A. Simpson (Amer. J. Bot. 90: 1071-1087. 2003) for subfamily delimitation and Goetghebeur (in K. Kubitzki, Fam. Gen. Vasc. Pl. 4: 141-190. 1998) for tribal and generic delimitation and sequence. Two subfamilies and eight tribes of Cyperaceae occur in China with generic allocation as follows:",
      "Inflorescence comprising small units (pseudospikelets) with 2 opposite, keeled, scalelike bracts at base often enclosing a further 2-10 scalelike bracts, each unit subtended and usually hidden by a glumelike bract",
      "Inflorescence made up of capitate clusters of spikelets arising along whole length of culm; nutlets tightly enclosed by 2 subtending glumes and shed with them.",
      "Inflorescence paniculate or ± capitate, arising on upper part of culm; nutlets not tightly enclosed by 2 glumes.",
      "Utricle completely closed except at apex; spikelets all unisexual with either 1 male or 1 female flower.",
      "Spikelets much reduced, with 0-2 glumes subtended by a glumelike spikelet bract, spikelets densely clustered into spikes or in a capitate inflorescence",
      "Leaves flat, midrib conspicuous or inconspicuous; inflorescence paniculate spreading and loose or small capitate; perianth bristles present or absent; nutlets beaked",
      "Leaf midrib inconspicuous or terete; inflorescence densely narrowly paniculate, long and large and spreading, loose; perianth bristles present or absent; nutlets beakless",
      "Leaf blades usually present, if absent then style base not persistent on nutlet; perianth bristles absent",
      "Inflorescence a single spikelet, up to 3 spikelets, or capitate, if paniculate then longest inflorescence bract culmlike and apparently continuous with culm, inflorescence appearing to be lateral",
      "One involucral bract over 1.5 cm, longest involucral bract erect, culmlike and apparently continuous with culm, inflorescence appearing to be lateral."
    ],
    "authors":"Lun-Kai Dai, Prof. Song-Yun Liang, Shuren Zhang, Yancheng Tang, Tetsuo Koyama, Gordon C. Tucker, David A. Simpson, Henry J. Noltie, Mark T. Strong, Jeremy J. Bruhl, Karen L. Wilson & A. Muthama Muasya"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Hydrocharitaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10426",
    "knowledge_content":[
      "Herbs, annual or perennial, submerged or floating, aquatic, in fresh or brackish water or marine. Stems short or elongated, sometimes stoloniferous. Leaves radical or cauline, alternate, opposite, subopposite, whorled, or pseudowhorled, sessile or petiolate, usually sheathing at base. Flowers unisexual or bisexual, actinomorphic, enclosed in a bifid spathe or within 2 opposite spathal bracts, or rarely not spatulate; spathes sessile or pedunculate. Stamens 1 to many, occasionally some staminodal; anthers 1-4-thecous. Ovary inferior, 1-loculed; carpels 2-15, fused; ovules few to many, on parietal, sometimes intruding placentae; styles 2-5; stigmas usually bifid. Fruit a fleshy and berrylike capsule dehiscent or opening by decay of pericarp, or an achene (Najas). Seeds numerous, usually small, without endosperm; embryo straight.\r",
      "Eighteen genera and ca. 120 species: widely distributed in tropical and subtropical regions of the world; 11 genera (one introduced) and 34 species (four endemic, one introduced) in China.",
      "Wang Huiqin & Sun Xiangzhong. 1992. Hydrocharitaceae. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 151-190; Zhou Lingyun, You Jun & Zhong Xiongwen. 1992. Najas. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 108-125.",
      "Fruit an elliptic-oblong achene; perianth 2-lipped; plant annual, submerged in fresh or brackish water; leaves sessile.",
      "Fruit a fleshy and berrylike capsule; perianth segments free, 1- or 2-seriate, 3 per series, outer often sepaloid, inner petaloid; plant perennial or annual, floating or submerged; leaves petiolate or sessile",
      "Plants slender; leaves usually opposite or binate, not in 2 rows, linear to ovate, usually petiolate.",
      "Flowers usually bisexual; sepals linear to lanceolate, shorter than petals; leaves with prominent midvein."
    ],
    "authors":"Qingfeng Wang, Youhao Guo, Robert R. Haynes & C. Barre Hellquist"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Juncaginaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10463",
    "knowledge_content":[
      "Herbs, of marshes or aquatic, scapiferous, with short, vertical rhizomes. Leaves mostly basal, alternate, erect, linear, sheathed at base, margin entire. Flowers hermaphroditic or unisexual and plants dioecious or polygamous; flowers small, ebracteate, in pedunculate spikes or racemes. Perianth segments 2-6(-8), in 2 series, sepaloid. Stamens 3, 4, or 6, often attached to base of perianth segments; anthers subsessile, 2-thecous, extrorse, opening by longitudinal slits. Carpels 3, 4, or 6, free or partly connate, each with 1 ovule; styles short or stigmas sessile. Fruit apocarpous or syncarpous; fruitlets separating at maturity. Seeds without endosperm; embryo straight.\r",
      "Guo Youhao & Li Qingyi. 1992. Triglochin. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 37-40."
    ],
    "authors":"Youhao Guo, Robert R. Haynes & C. Barre Hellquist"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Lemnaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10488",
    "knowledge_content":[
      "Herbs, mostly perennial, minute, aquatic, floating or submersed, reduced to small green bodies called fronds corresponding partly to leaf and partly to stem. Roots absent or 1-21, filiform, arising from lower surface of frond; root hairs absent. Fronds 1 to many coherent together, orbicular or oblong to lanceolate and flat or convex (gibbous) on lower surface, or globose to ovoid, 0.4-15 mm, with or without veins; daughter fronds successively formed from 1 basal cavity or 2 basal pouches detaching or remaining attached for many weeks, bases of pouches sometimes surrounded by a small, membranous scale (prophyll) covering bases of roots. Node (point of origin of veins, roots, and daughter fronds) situated ca. 1\/3 from base toward apex. Turions (in some species) formed under unfavorable conditions, frondlike but smaller, compact, sinking to bottom. Flowers (interpreted as inflorescences by some authors) rarely seen in most species, 1(or 2), emerging from one of pouches or from a cavity near median line on upper surface, sometimes surrounded by a small, utricular, membranous scale (corresponding to a spathe in the Araceae); perianth absent; stamens 1 or 2; pollen grains ulcerate, exine spinulose; ovary 1, bottle-shaped, 1-7-ovuled, tapering into short style; stigma funnel-shaped. Fruit indehiscent, opening by bursting.\r",
      "Five genera and 38 species: worldwide in aquatic ecosystems; four genera and eight (possibly nine) species in China.",
      "In the opinion of the present authors, it is too early to decide if the Lemnaceae should be included within the Araceae. While this placement has been supported by some phylogenetic studies, only a few species of Lemnaceae have been investigated so far. Before the whole spectrum of variability of molecular characteristics of the Lemnaceae is known, it would be unwise to change the status. The Lemnaceae are a well-characterized entity of taxa, whereas the Araceae are a heterogeneous group. It is very difficult to find common characters in the Lemnaceae and Araceae. The flowering organ is not at all decisive. It is not even certain if the flowering organ of the Lemnaceae is a flower or a reduced inflorescence. It is also very difficult to find special common characters between Lemnaceae and the genera that are placed nearest to them according to phylogenetic studies.Different species of Lemnaceae are often found sympatric at the same habitats; sometimes they are associated with various kinds of aquatic ferns and vascular plants. They usually grow gregariously and with rapid reproduction (up to doubling within 24 hours). The fronds of all species are commonly utilized as high-quality feed for domestic animals, fish, and fowl.Li Hen. 1979. Lemnaceae. In: Wu Cheng yih & Li Hen, eds., Fl. Reipubl. Popularis Sin. 13(2): 206-211.",
      "Fronds rootless, without veins, each frond with 1 basal cavity reproducing daughter fronds; flower emerging from a cavity near median line of upper surface, not surrounded by scale; stamen 1, 2-locular; seed 1, subsmooth.",
      "Fronds with 1-21 roots, with 1-21 veins, each frond with 2 lateral pouches at base reproducing daughter fronds and (rarely in most species) 1 flower; flower surrounded by small, utricular, membranous scale; stamens 2, 4-locular; seeds 1-5, longitudinally ribbed",
      "Fronds with 2-21 roots and (3-)5-21 veins, surrounded at base by a small membranous scale covering point of attachment of roots",
      "Fronds 1-1.5 × as long as wide, with 7-16(-21) veins, with (5-)7-21 roots, flat, rarely slightly gibbous; 1(or 2) roots perforate covering scale.",
      "Fronds 1.5-3 × as long as wide, with (3-)5-7 veins, with (1 or)2-7(-12) roots, flat or gibbous; all roots perforate covering scale."
    ],
    "authors":"Heng Li & Elias Landolt"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Pandanaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10649",
    "knowledge_content":[
      "Trees, shrubs, or woody lianas, terrestrial, evergreen, dioecious. Stems simple or often bifurcately branched, ringed with persistent annular leaf scars, often producing adventitious prop roots; aerial roots present or absent. Vegetative reproduction by suckers present or absent. Leaves simple, numerous, spirally arranged at apex of stems and branches, sessile, linear to lanceolate, leathery, often lustrous or glaucous, glabrous, keeled abaxially, parallel veined, with numerous horizontal secondary veins, base open-sheathed and amplexicaul, margin and midrib abaxially often spinulose, apex often long acuminate. Male inflorescences axillary and terminal, compound, bracteate, comprising several-branched racemes or panicles with crowded flowers on spicate ultimate branches; spathes often enlarged at apex, white or colored. Perianth absent. Male flowers sessile (pedicellate in Sararanga Hemsley), with pistillode sometimes present; stamens numerous, fasciculate, arising on rachises or spadix branches; filaments smooth (Pandanus) or papillose (Freycinetia), seemingly branched; anthers basifixed, 2-celled with 4 pollen sacs, dehiscing by longitudinal slits, connective often apiculate; pollen grains often spinulose. Female inflorescences terminal, solitary or in spikes, racemes, or capitula, short, bracteate, with crowded flowers, often pendulous in fruit. Female flowers with or without staminodes; pistils free or aggregated and appressed to adjacent pistils forming 1- to many-carpelled phalanges or clusters; ovary superior, 1- to several locular; ovules solitary to numerous, anatropous, placentation basal or parietal; style absent or very short; stigmas 1 or more, subsessile, glandular-papillose. Fruit a berry (Freycinetia) or drupe (Pandanus), when drupaceous a multiple structure (syncarp) composed of 2-20 woody, or basally fleshy or fibrous, cylindric to globose, connate, free or often crowded and clustered carpels, each cluster of carpels termed a \"phalange,\" with mesocarp fibrous and often pithy or hollow above, fibrous and fleshy below; endocarp membranous or evanescent. Seeds 1 to numerous, minute, often fusiform; testa membranous (Pandanus) or crustose (Freycinetia); endosperm oily and fleshy, or starchy; strophiole originating from raphe sometimes present; embryo basal, minute; germination often epigeal.\r",
      "Three genera and ca. 800 species: Old World tropics, several species introduced as economic or ornamental plants; two genera and seven species (one endemic, one introduced) in China.",
      "See Stone (Blumea 16: 361-372. 1968; in J.-F. Leroy, Fl. Cambodge, Laos & Vietnam 20: 3-48. 1983; Bot. J. Linn. Soc. 97: 33-48. 1988).Zhou Lingyun & Zhong Xiongwen. 1992. Pandanaceae. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 12-23.",
      "Stems present, climbing by aerial roots, often also with long, pendulous aerial roots not utilized in climbing; prop roots absent; male spadices usually 2-5, rarely solitary, simple, sometimes fleshy; connective of stamen not apiculate; filaments papillose; ovary 1-locular; carpels many ovuled; fruit a berry.",
      "Stems present or absent; often with aerial roots or prop roots or both; male spadices solitary, branched, thin, leathery; connective of stamen apiculate; filaments smooth; ovary 1-12-locular; carpels always 1-ovuled; fruit a drupe divided into phalanges."
    ],
    "authors":"Kun Sun & Robert A. DeFilipps"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Posidoniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20251",
    "knowledge_content":[
      "Herbs perennial, submerged, marine, with creeping rhizome and short, erect stems. Rhizomes and stems with dense, persistent, fibrous leaf bases. Leaves basal, alternate, sheathed at base; sheaths convolute, auriculate at base, apex ligulate. Inflorescence of 1 or more aggregated spikes on elongated peduncle, subtended by reduced leaves (leaflike bracts). Flowers bisexual or uppermost with a reduced gynoecium. Perianth absent or of 3 caducous scales. Stamens 3; anthers sessile, extrorse, with a thick connective, opening by longitudinal slits. Carpel 1; ovule 1, elongated. Fruit fleshy, indehiscent. Seeds without endosperm; embryo straight.\r",
      "One genus and ca. five species; one species in Mediterranean, others on shores of W Pacific Ocean; one species in China.",
      "Guo Youhao & Li Qingyi. 1992. Posidonia. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 95-96."
    ],
    "authors":"Youhao Guo, Robert R. Haynes & C. Barre Hellquist"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Potamogetonaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10726",
    "knowledge_content":[
      "Herbs, perennial or annual, in fresh to brackish water, totally submerged or with floating leaves. Rhizomes present or absent. Stems elongated or shortened, terete to compressed, rarely strongly compressed. Leaves alternate or basal, occasionally opposite or subopposite; stipules free from leaves or adnate to leaf base and sheathing stems. Inflorescence a capitate spike, terminal or axillary. Plants monoecious; flowers small, bisexual. Perianth bractlike, free, present or absent. Stamens (1-)4; anthers sessile, (1 or)2-celled, extrorse, longitudinally dehiscent. Carpels (1-)4, free; ovule solitary. Fruit drupaceous. Embryo curved; endosperm absent.\r",
      "Guo Youhao & Li Qingyi. 1992. Potamogetonaceae (excluding Halodule, Phyllospadix, Posidonia, Ruppia, Syringodium, Triglochin, and Zostera). In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 40-83.",
      "Submersed leaves with stipules free from leaf base, or if adnate then adnate portion less than 1\/2 length of stipule; leaves submersed and floating or all submersed; submersed leaf blades translucent, not channeled, flattened; peduncle stiff, submersed or projecting above water surface.",
      "Submersed leaves with stipules adnate to leaf blade for 2\/3 or more length of stipule; leaves all submersed, blades opaque, channeled; peduncle lax, not projecting inflorescence above water surface."
    ],
    "authors":"Youhao Guo, Robert R. Haynes, C. Barre Hellquist & Zdenek Kaplan"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Ruppiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20267",
    "knowledge_content":[
      "Plants perennial or annual, in saline, brackish, or extremely hard water, totally submerged. Rhizomes slender, usually branched. Stems terete, elongated or not. Leaves alternate, sessile, narrowly linear, entire or minutely denticulate toward apex; stipules adnate to leaf base and sheathing stems; sheaths shortly auriculate, ligule absent. Inflorescences of few-flowered spikes, pedunculate; spikes enclosed by involucral leaves at first; peduncles short at first but elongated in fruit. Flowers hermaphroditic, small, ebracteate. Perianth absent. Stamens 2; anthers sessile, extrorse, opening by longitudinal slits. Carpels 4 or more, free, 1-ovuled, sessile in flower but usually becoming narrowly stipitate in fruit; stigma sessile, peltate or umbonate. Fruit drupaceous, asymmetric, indehiscent. Seeds without endosperm.\r",
      "One genus and three to ten species: salt marshes throughout temperate and tropical regions; one species in China."
    ],
    "authors":"Youhao Guo, Robert R. Haynes & C. Barre Hellquist"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Scheuchzeriaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10802",
    "knowledge_content":[
      "Plants perennial, of marshes, with creeping rhizomes. Stems erect, leafy, unbranched. Leaves alternate, linear, sheathing at base; sheaths open, with a prominent ligule at juncture of sheath and blade; sheath remains often persistent, intravaginal hairs numerous. Racemes terminal, few flowered. Flowers bisexual, 3-merous, bracteate. Pedicels elongating following fertilization. Perianth segments 6, in 2 series, sepaloid, free, persistent; stamens 6, free, with elongated filaments; anthers basifixed, linear, extrorse, opening by longitudinal slits. Pistils 3(-6), distinct to connate at base; stigmas sessile, papillose; ovules 2 or few in each carpel. Fruiting carpels follicular, inflated; follicles 1-4 per aggregate. Seeds 1 or 2(or 3), without endosperm; embryo straight.\r",
      "One species: widely distributed in the cooler parts of the N temperate zone in Asia, Europe, and North America.",
      "Zhou Lingyun. 1992. Scheuchzeriaceae. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 125-127."
    ],
    "authors":"Youhao Guo, Robert R. Haynes & C. Barre Hellquist"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Triuridaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10917",
    "knowledge_content":[
      "Herbs achlorophyllous, mycotrophic, reddish, purple, or yellow. Stems erect, simple or nearly so. Leaves alternate, reduced, scalelike, not green. Plants monoecious or dioecious; flowers small, unisexual, rarely bisexual or polygamous, actinomorphic, in racemes or subcorymbs, with decurved bracteate pedicels. Perianth segments 3-10, in 1 series, valvate, usually united at base, sometimes appendaged at apex, reflexed after anthesis. Stamens 2-6, inserted at base of receptacle or perianth; anthers 2- or 4-thecous, extrorse, mostly opening by transverse slit; connective often reduced into long subulate appendages. Carpels 6 to many, free; style terminal to subbasal; ovule solitary, basal. Fruiting carpels crowded, opening by a slit. Seed internally fleshy, white, oily, undifferentiated.\r",
      "Zhou Lingyun & Zhong Xiongwen. 1992. Triuridaceae. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 190-193."
    ],
    "authors":"Youhao Guo & Martin Cheek"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Typhaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10926",
    "knowledge_content":[
      "Herbs, perennial, aquatic or in marshes, with creeping rhizomes. Stems simple or branched, robust or slender. Leaves alternate, distichous, erect, emergent or floating, sheathed at base. Plants monoecious. Bracts leaflike. Inflorescence either of globose heads on upper part of stems and branches with several male and female heads in a panicle, raceme, or spike, male heads above female, or of a single cylindric spike with lower part female and upper part male. Flowers minute, numerous. Perianth segments of 3-6 chaffy elongate scales or absent. Male flowers with 1 or more stamens; anthers basifixed, longitudinally dehiscent. Female flowers bracteolate or with fine hairs at base; ovary 1-loculed, rarely 2-loculed, narrow at base or on a long capillary stalk; styles simple or forked; stigma unilateral, broadened or spatulate; ovule 1. Fruit minute, nutlike, indehiscent, falling off together with stalk if present. Seeds with thin testa.\r",
      "Two genera and ca. 35 species: tropical and temperate regions; two genera and 23 species (six endemic) in China.",
      "Chen Yaodong. 1992. Typhaceae and Sparganiaceae. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 1-12, 23-31.",
      "Flowers in a dense cylindric spike, lower part female and upper part male, sometimes separated by a gap."
    ],
    "authors":"Kun Sun & David A. Simpson"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Zannichelliaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10959",
    "knowledge_content":[
      "Plants submerged in fresh or brackish water. Rhizomes creeping, usually slender, branched, rooting at nodes. Stems elongated, slender, much branched. Leaves submerged, sessile, alternate, subopposite, or crowded at nodes, linear, with conspicuous midvein, sheathing at base, margin entire. Plants monoecious. Flowers axillary, minute, unisexual, solitary or in cymes. Male flower solitary, pedunculate, without perianth; stamens 1(or 2); filament slender; anthers 2-thecous; pollen grains globose or nearly so. Female flowers with a cupular perianth, sessile; carpels 1-9, free; ovule 1, pendulous; styles simple, slender, elongated; stigmas usually obliquely peltate. Fruitlet achene- or nutlike, slightly compressed, subsessile or stipitate, abaxially keeled; keel usually winged. Seeds without endosperm.\r",
      "The Angiosperm Phylogeny Group [APG] (Bot. J. Linn. Soc. 161: 105-121. 2009) included this family in the Potamogetonaceae. However, for the Flora of China, we treat the families separately.Several species have been recognized by some authors, and the taxonomy of the genus needs considerable reevaluation.Zhou Lingyun, You Jun & Zhong Xiongwen. 1992. Zannichellia. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 102-107."
    ],
    "authors":"Youhao Guo, Robert R. Haynes & C. Barre Hellquist"
  },
  {
    "group_title":"Acoraceae through Cyperaceae",
    "family":"Zosteraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10962",
    "knowledge_content":[
      "Herbs, perennial, rarely annual, in saline water, rhizomatous, caulescent. Leaves alternate, submersed, sessile, sheath persisting longer than blade or decaying into bundles of fibers, blade linear. Inflorescences axillary or terminal, spadices surrounded by spathe, pedunculate. Plants monoecious or dioecious; flowers unisexual; subtending bracts often present; perianth lacking. Male flowers with single stamen, anthers dehiscing longitudinally. Female flowers with single pistil. Fruit achenelike. Seed 1 with straight embryo.\r",
      "Three genera and 18 species: widely distributed in temperate and subtropical coastal waters worldwide; two genera and seven species in China.",
      "Guo Youhao & Li Qingyi. 1992. Zostera and Phyllospadix. In: Sun Xiangzhong, ed., Fl. Reipubl. Popularis Sin. 8: 85-95."
    ],
    "authors":"Youhao Guo, Robert R. Haynes & C. Barre Hellquist"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Amaryllidaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10032",
    "knowledge_content":[
      "Herbs perennial, rarely shrubby or treelike, often with bulbs, corms, rhizomes, or tubers. Leaves basal or cauline, often narrow, margin entire or spiny. Inflorescence a terminal spike, umbel, raceme, panicle, or flowers solitary. Flowers bisexual, actinomorphic or zygomorphic, usually subtended by 1 to several spathaceous involucres. Perianth segments 6, in 2 whorls, free or connate to form a short tube, with or without a corona. Stamens 6, inserted at perianth throat or at base of segments; filaments sometimes basally connate; anther dorsifixed or basifixed, mostly introrse. Ovary inferior, 3-loculed; ovules few to many per locule; placentation axile. Style slender; stigma capitate or 3-lobed. Fruit a capsule, usually loculicidal, sometimes dehiscing irregularly, rarely a berry. Seeds with endosperm.\r",
      "More than 100 genera and 1200 species: tropical, subtropical, and temperate regions worldwide; ten genera and 34 species (14 endemic, four introduced) in China.",
      "Qian Xiao-hu, Chen Sing-chi, Hsu Yin, Hu Zhi-bi, Huang Xiu-lan & Fan Quan-jin. 1985. Amaryllidaceae.  In: Pei Chien & Ting Chih-tsun, eds., Fl. Reipubl. Popularis Sin. 16(1): 1--42.",
      "Leaves fleshy and thick, with a spinelike apex and often with sharp, marginal teeth; perianth tube present; ovary beakless",
      "Leaves neither fleshy nor thick, never spiny; perianth tube absent or very short; ovary sometimes narrowly beaked.",
      "Plants with bulbs or a bulblike base formed by persistent leaf bases; flowering stem scapose, leafless except for involucre enclosing strictly terminal umbel, sometimes 1-flowered.",
      "Rootstock a tuberous rhizome or corm covered with fibers; perianth yellow (color not recorded for  Curculigo sinensis).",
      "Acanthochlamys  P. C. KaoAgave  LinnaeusCrinum  LinnaeusCurculigo  GaertnerHypoxis  LinnaeusIxiolirion  Fischer ex HerbertLycoris  HerbertNarcissus  LinnaeusPancratium  LinnaeusZephyranthes  Herbert"
    ],
    "authors":"Zhanhe Ji & Alan W. Meerow"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Bromeliaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10123",
    "knowledge_content":[
      "Herbs or rarely shrubs, epiphytic, lithophytic, or terrestrial. Leaves spirally arranged, usually rosulate, sessile, simple, veins parallel, base dilated, sheathing, margin often spinose serrate or sometimes entire. Inflorescence terminal or lateral, scapose or sessile, a panicle, raceme, spike, or head, sometimes reduced to solitary, pseudolateral flowers; bracts usually brightly colored and conspicuous. Flowers bisexual or sometimes functionally unisexual, 3-merous. Sepals and petals each 3, distinct, free or basally connate; petals often brightly colored, basal margin with a pair of scalelike appendages. Stamens 6, in 2 whorls of 3; filaments free, connate, or collectively or individually adnate to petals; anthers 2-celled, dehiscing by longitudinal slits. Gynoecium of 3 carpels united to form a compound, 3-loculed, superior or very often partly or wholly inferior ovary; ovules few to usually ± numerous in each locule; placentation axile. Style terminal and often 3-parted; stigmas papillose. Fruit a berry or less often a septicidal capsule, or seldom compound and fleshy. Seeds usually winged or plumose; endosperm mealy; embryo small to fairly large.\r",
      "About 50 genera and 2000--2600 species: mainly tropical America, except for  Pitcairnia feliciana (A. Chevalier) Harms & Mildbraed in tropical W Africa; one species (introduced) in China."
    ],
    "authors":"Wei-liang Ma & Bruce Bartholomew"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Cannaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10155",
    "knowledge_content":[
      "Herbs perennial. Stems erect, robust. Rhizomes tuberous. Leaves alternate, spirally arranged, large, veins pinnate and parallel, base sheathing. Inflorescence a terminal raceme or panicle of showy, 1- or 2-flowered cincinni. Flowers bisexual, asymmetric, mostly large. Sepals 3, green, free, persistent. Corolla lobes 3, green or colored, basally connate into a tube and adnate to staminodes. Staminodes and stamen in 2 whorls: outer whorl with (2 or)3 conspicuous, petaloid staminodes, usually red or yellow; inner whorl with a reflexed staminode (labellum), narrower than outer staminodes, and a fertile stamen; filament petaloid; anther 1-loculed, adnate to apical margin of filament. Ovary inferior, 3-loculed; ovules numerous per locule; placentation axile. Style petaloid. Fruit a capsule, 3-valved, usually warty. Seeds many, globose; endosperm copious; embryo straight.\r",
      "One genus and ten to twenty species: tropical and subtropical America; one species (introduced) in China.",
      "Wu Te-lin & Chen Sen-jen. 1981. Cannaceae.  In: Wu Te-lin, ed., Fl. Reipubl. Popularis Sin. 16(2): 152--158."
    ],
    "authors":"Delin Wu & W. John Kress"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Centrolepidaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10171",
    "knowledge_content":[
      "Herbs annual or perennial, tufted, small. Stems branched, short. Leaves crowded or densely distichous; leaf sheath open, broadly membranous, often with ligule adaxially at juncture with leaf blade; leaf blade narrowly lanceolate, linear, or filiform, stomata paracytic. Inflorescence a terminal head or spike, rarely 1-flowered; bracts 2 to many, distichous. Flowers unisexual or bisexual. Perianth absent. Stamens 1(or 2); filaments filiform; anthers dorsifixed, versatile, 1-loculed, dehiscing longitudinally; pollen grains 3-nucleate, 1-porate. Carpels 1 to many, superior, connate or free. Styles free or connate at base; stigmas linear. Fruit small, dehiscing longitudinally; pericarp membranous. Seeds minute; albumen farinaceous; embryo small.\r",
      "About five genera and ca. 35 species: mainly in Australia, a few in SE Asia, Pacific Islands, and South America; one species in China.",
      "Wu Kuo-fang. 1997. Centrolepidaceae.  In: Wu Kuo-fang, ed., Fl. Reipubl. Popularis Sin. 13(3): 8--10."
    ],
    "authors":"Guofang Wu & Kai Larsen"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Commelinaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10212",
    "knowledge_content":[
      "Herbs annual or perennial, sometimes woody at base. Stems with prominent nodes and internodes. Leaves alternate, distichous or spirally arranged, sessile or petiolate; leaf sheath prominent, open or closed; leaf blade simple, entire. Inflorescence usually of cincinni in panicles or solitary, sometimes shortened into heads, sometimes sessile with flowers fascicled, sometimes axillary and penetrating enveloping leaf sheath, rarely flowers solitary and terminal or axillary. Flowers bisexual, rarely unisexual, actinomorphic or zygomorphic. Sepals 3, free or connate only at base, often boat-shaped or carinate, sometimes galeate at apex. Petals (2 or)3, free, sometimes connate and tubular at middle and free at 2 ends ( Cyanotis), sometimes clawed. Stamens 6, free, all or only 2 or 3 fertile; filaments glabrous or torulose villous; anthers parallel or slightly divergent, longitudinally dehiscent, rarely dehiscent by apical pores; staminodes 1--3; antherodes 4-lobed and butterflylike, 3-sect, 2-lobed and dumbbell-shaped, or entire. Ovary 3-loculed, or reduced to 2-loculed; ovules 1 to several per locule, orthotropous. Fruit a loculicidal, 2- or 3-valved capsule, rarely baccate and indehiscent. Seeds few, large; endosperm copious; hilum orbicular or linear.\r",
      "About 40 genera and 650 species: mainly in tropical regions, fewer species in subtropical and temperate regions; 15 genera (two introduced) and 59 species (12 endemic, three introduced) in China.",
      "Inflorescence neither penetrating leaf sheath nor sessile nor capitate; stems sometimes with lateral branches penetrating leaf sheaths; fertile stamens 6 or fewer.",
      "Climbers; involucral bracts large, spathelike; flowers in basal and middle cincinni of panicles bisexual, others male.",
      "Inflorescence terminal, broomlike, with extremely numerous small flowers; capsule small, 2-valved, with 1 seed per valve",
      "Inflorescence terminal or not, not broomlike; capsule 3-valved, rarely 2-valved when fertile stamens 3.",
      "Involucral bracts spathelike (except in  Cyanotis axillaris, which has inflorescence enveloped in leaf sheath; fertile stamens 6; petals connate at middle).",
      "Petals connate, tubular, with 2 ends free; fertile stamens 6; bracts falcate-curved, imbricately arranged in 2 rows",
      "Flowers zygomorphic; fertile stamens 3, inserted on 1 side; antherodes 4-lobed, butterflylike; capsule usually 2-valved, posterior valve often indehiscent",
      "Inflorescence sessile or extremely shortly pedunculate, flowers nearly in axillary heads or fascicled; fertile stamens usually 6, less often 1--3.",
      "Petals white; filaments glabrous, connectives broad, square, deltoid, oblong, rarely narrow; stigma mostly penicillate",
      "Staminodes apically entire and sagittate, or 3-sect; fertile stamens 3 (sometimes 1 or 2 aborted), all inserted opposite sepals",
      "Staminodes apically dumbbell-shaped; fertile stamens 2 or 3, inserted in posterior or anterior position."
    ],
    "authors":"Deyuan Hong & Robert A. DeFilipps"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Costaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10224",
    "knowledge_content":[
      "Herbs perennial, terrestrial, not aromatic, with ± fleshy rhizomes. Stems usually simple, often long, terete, sometimes spirally contorted, leafy; secondary branches (if present) breaking through leaf sheaths. Leaves spirally arranged, simple, those toward base of stem usually bladeless; leaf sheath tubular, closed; ligule present; petiole short; leaf blade narrowly to broadly elliptic, rolled longitudinally in bud, glabrous or hairy, margin entire. Inflorescence a conelike spike, terminal on leafy shoots or on separate, short, leafless shoots arising from rhizomes; bracts imbricate, with linear, nectariferous callus below apex, 1- or 2-flowered; bracteoles tubular or folded. Flowers bisexual, epigynous, zygomorphic. Calyx tubular, 2- or 3-lobed or -toothed. Corolla proximally tubular, distally 3-lobed; lobes unequal, imbricate in bud. Staminodes 5, united into a labellum equaling or much longer than corolla, often ± 3-lobed with crisped margin, never deeply lobed. Fertile stamen 1; filament broad; anther borne below apex of filament or at apex with a connective crest, introrse, dehiscing by longitudinal slits. Ovary inferior, 2- or 3-loculed; ovules many per locule; placentation axile. Developed style 1, filiform, usually enclosed between anther locules; stigma with or without abaxial appendage. Stylodes 2, reduced to septal, hollow nectaries at apex of ovary, or absent. Fruit a capsule, 2- or 3-valved and dehiscing loculicidally, or indehiscent and breaking up irregularly, apex with persistent calyx. Seeds numerous, black, arillate.\r",
      "Four genera and ca. 120 species: pantropical with center of diversity in America; one genus and five species (two endemic) in China.",
      "Tsai Hsi-tao & Tong Shao-quan. 1981. Zingiberaceae subfam. Costoideae. In: Wu Te-lin, ed., Fl. Reipubl. Popularis Sin. 16(2): 148--152."
    ],
    "authors":"Delin Wu & Kai Larsen"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Dioscoreaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10280",
    "knowledge_content":[
      "Herbs twining or woody vines, rarely erect, small herbs. Rootstock rhizomatous or tuberous. Stem twining to left or right, pubescent or glabrous, sometimes prickly. Leaves alternate or opposite, petiolate, simple or palmately compound, basal veins 3--13, interstitial veins reticulate; leaflets of palmately compound leaves often ovate or lanceolate. Flowers usually unisexual (when plants dioecious, rarely monoecious), sometimes bisexual, solitary, clustered, or in cymules, these in a spike, raceme, or thyrse, these sometimes grouped into panicles. Male flowers: perianth lobes 6, in 2 whorls, basally connate or free; stamens 6, sometimes 3 reduced to staminodes or absent, inserted on perianth or receptacle; ovary rudimentary or absent. Female flowers: similar to male ones; staminodes 3, 6, or absent; ovary inferior, 3-loculed, ovules usually 2 per locule (more than 2 in a few small genera), placentation axile; styles 3, free. Fruit a capsule, berry, or samara. Seeds with a membranous wing or not; endosperm present; embryo small.\r",
      "About nine genera and 650 species: widely distributed in tropical and temperate regions, especially in tropical America; one genus and 52 species (21 endemic, two introduced) in China.",
      "Ting Chih-tsun, Chang Mei-chen & Ling Ping-ping. 1985. Dioscoreaceae.  In: Pei Chien & Ting Chih-tsun, eds., Fl. Reipubl. Popularis Sin. 16(1): 54--120."
    ],
    "authors":"Chih-chi Ting & Michael G. Gilbert"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Eriocaulaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10317",
    "knowledge_content":[
      "Herbs perennial or annual. Leaves in a rosette, grasslike, linear, occasionally thinly filiform, often thin and transparent, fenestrate, base sheathing. Inflorescences capitate, globose to ovoid; scapes thin, twisted, angled, base surrounded by a bladeless, tubular sheath. Flowers 2- or 3-merous, bracteate, with both sexes usually in same head. Male flowers: sepals 2 or 3, connate or free; petals 2 or 3, often inconspicuous; stamens 6. Female flowers: sepals 2 or 3, free or connate; petals absent to 4, free; ovary (1--)3-loculed; ovules 1 per locule, basal; style 1, 1--3-branched. Fruit a capsule, thin, loculicidal. Seeds small; testa usually reticulate and prickly; endosperm with abundant starch grains.\r",
      "Ten genera and ca. 1150 species: mainly in tropical and subtropical regions; one genus and 35 species (13 endemic) in China."
    ],
    "authors":"Wei-liang Ma, Zhixiang Zhang & Thomas Stützel"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Flagellariaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10344",
    "knowledge_content":[
      "Lianas high climbing, robust, glabrous. Rhizome sympodial, diffuse. Stems terete, solid, hard, apically usually equally branched; axillary buds absent. Leaves distichous, circinate; leaf sheath tubular, closed, connected with leaf blade by a short pseudopetiole; leaf blade grasslike, stomata paracytic, apex extended into tendril; tendril simple, involutely coiled, abaxially flattened, hard. Inflorescences terminal, paniculate. Flowers bisexual or rarely unisexual, sessile, actinomorphic, 3-merous, small; perianth segments 6, in 2 whorls, free, whitish, petaloid, membranous, persistent, 3 inner ones largest. Stamens 6, in 2 whorls, exserted; filaments filiform; anthers basifixed, linear-oblong to linear, sagittate, 2-loculed, latrorse, dehiscing by longitudinal slits; pollen grains ulcerate and similar to those of grasses. Ovary superior, obtusely 3-angled, 3-loculed; ovule 1 per locule; placentation axile. Style very short; stigmas 3, linear-clavate. Fruit drupaceous with 1(or 2) seeds. Seeds globose or ± flattened; endosperm copious, starchy; embryo minute.\r",
      "One genus and about four species: tropical Africa, Asia, Australia, Pacific Islands; one species in China."
    ],
    "authors":"Guofang Wu & Kai Larsen"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Iridaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10452",
    "knowledge_content":[
      "Herbs perennial (or shrubs or annuals), with rhizomes, bulbs, or corms. Leaves alternate, often 2-ranked, often oriented edgewise to aerial stem, usually sword-shaped to linear, parallel veined, base sheathing. Inflorescence sometimes a spike or reduced to a solitary flower, more often of monochasial, umbellate cymes, each enclosed in 2 opposed bracts (spathes) and termed a rhipidium, which may be solitary and terminal or numerous and variously arranged in racemes or panicles; bracts 1 to several. Flowers bisexual, showy, usually actinomorphic (often zygomorphic elsewhere). Perianth segments 6, in 2 whorls, inner and outer ones equal or differing in size and\/or color; tube filiform or trumpet-shaped. Stamens (2 or)3; anthers extrorse. Ovary inferior (or superior), 3-loculed; ovules few to many; placentation axile. Style with filiform, slender, or petaloid branches. Fruit a loculicidal capsule. Seeds with or without aril and wings.\r",
      "Between 70 and 80 genera and ca. 1800 species: nearly worldwide, especially S Africa, Asia, and Europe; three genera and 61 species (21 endemic, one introduced) in China.",
      "Zhao Yu-tang. 1985. Iridaceae.  In: Pei Chien & Ting Chih-tsun, eds., Fl. Reipubl. Popularis Sin. 16(1): 120--198."
    ],
    "authors":"Yu-tang Zhao, Henry J. Noltie & Brian F. Mathew"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Juncaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10462",
    "knowledge_content":[
      "Herbs, very rarely shrublike, perennial or annual, tufted or with erect or creeping rhizome. Stems erect, terete or laterally flattened. Leaves occasionally reduced to a bladeless or nearly bladeless sheath at base of stem (cataphyll); leaf sheath often shortly prolonged on both sides into a pair of auricles at leaf blade juncture; leaf blade of basal and cauline leaves usually linear or filiform, grasslike and flat, or terete, glabrous except for pilose margin on some grasslike blades. Inflorescence a panicle, corymb, or 1-flowered. Flowers bisexual or unisexual and plants dioecious, mostly wind pollinated, regular, usually small, usually 1- or 2-bracteolate at base. Perianth segments (3 or)6, in (1 or)2 whorls, free, usually greenish to brownish or blackish, rarely white or yellowish, glumelike. Stamens 3 or 6, if 6 then 3 opposite outer perianth segments; filaments thin; anthers basifixed, 2-loculed, dehiscing by longitudinal slits; pollen grains in tetrads. Ovary superior, 1-loculed, or divided by 3 septa and 3-loculed, or incompletely septate; ovules 3 and inserted at base of ovary, or numerous and biseriate on 3 parietal placentas. Stigmas 3, papillose. Fruit a capsule, 1--3-valved, loculicidal. Seeds globose, ovoid, or fusiform, small, sometimes appendaged; appendage caudate; embryo straight, minute, enclosed by fleshy endosperm.\r",
      "About eight genera and ca. 400 species: widely distributed in temperate and cold regions of both hemispheres, in tropical regions restricted to high elevations; two genera and 92 species (33 endemic) in China."
    ],
    "authors":"Guofang Wu & Steven E. Clemants"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Liliaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10507",
    "knowledge_content":[
      "Authors: Xinqi Chen, Prof. Song-Yun Liang, Jie-mei Xu, David E. Boufford, Michael G. Gilbert, Rudolf V. Kamelin, Shoichi Kawano, Tetsuo Koyama, Elena V. Mordak, Junko Noguchi, Victor G. Soukup, Hiroshi Takahashi, Kamilla G. Tamanian, Minoru N. Tamura & Nicholas J. Turland",
      "Herbs perennial, with a rhizome, bulb, or corm, rarely shrubby or treelike. Leaves basal and\/or cauline, alternate, opposite, or whorled, parallel or rarely reticulate veined. Inflorescence a raceme, panicle, spike, umbel, reduced panicle, or other, or flowers solitary. Flowers bisexual, rarely unisexual, actinomorphic, rarely zygomorphic; bracts present or absent; bracteoles present or absent. Perianth usually corollalike, 6-merous, rarely 4- or 8-merous, in 2 whorls; segments free (tepals) or united. Stamens 6, rarely 3, 4, or 8, inserted opposite perianth segments; filaments free or adnate to perianth, rarely connate into a corona; anthers usually 2-loculed, basifixed or dorsifixed and versatile, introrse, latrorse, or extrorse, dehiscing usually by vertical slits. Carpels usually connate for most or all of their length, rarely only at base; ovary superior, rarely semi-inferior, 3-loculed, rarely 2- or 4-loculed, with axile placentae, or rarely 1-loculed with a parietal placenta; ovules usually anatropous. Nectaries septal, perigonal, or absent. Fruit a capsule or berry. Seeds with abundant endosperm and small embryo.\r",
      "About 250 genera and 3500 species: worldwide, especially in temperate and subtropical regions; 57 genera (three endemic, two introduced) and 726 species (379 endemic, 11 introduced) in China.",
      "Wang Fa-tsuan & Tang Tsin, eds. 1978; 1980. Liliaceae. Fl. Reipubl. Popularis Sin. 15: 1--280; 14: 1--308.",
      "Bulb cylindric; inflorescence spicate; perianth segments partly united; plants with a strong, onionlike odor",
      "Bulb ovoid or globose; inflorescence racemose; perianth segments free; plants without a strong, onionlike odor",
      "Bulbs with fleshy, farinaceous scales; perianth segments each with a concave nectary near base adaxially",
      "Anthers dorsifixed and versatile; axis of seed moderately to strongly curved; leaves cauline or at least mostly so.",
      "Basal leaves not arising from bulb but from underground stem; bulb more than 1 cm in diam.; perianth more than 2 cm, deciduous after anthesis",
      "Basal leaves arising from bulb; bulb usually 4--5 mm in diam.; perianth less than 2 cm, persistent after anthesis.",
      "Bulb with a brown, scarious tunic; bulbels many, around roots; style 3-fid, apically recurved; seeds wingless",
      "Leaves reduced to scales; branchlets becoming leaflike (cladodes), needlelike or linear, 0.2--3 mm wide, numbering several hundred in a single plant",
      "Fruit bursting irregularly at an early stage and exposing seeds; seeds ellipsoid to globose, each resembling a berry or small drupe.",
      "Leaves subplicate veined, with transverse venation between main veins; filaments united into a ring nearly closing mouth of perianth",
      "Leaves parallel veined, without clear, transverse venation between main veins; filaments not forming a ring.",
      "Leaves longitudinally whitish striped; flowers ± nodding; ovary semi-inferior; filaments much shorter than anthers; seeds blue",
      "Leaves not whitish striped; flowers erect or suberect; ovary superior; filaments longer than or as long as anthers; seeds blackish",
      "Leaves usually 4--15 in 1 whorl; flowers 4-merous or more, inner perianth segments much narrower than outer ones",
      "Leaves 3 in a whorl; flowers 3-merous, inner perianth segments only a little narrower than outer ones",
      "Flowers unisexual; leaves reticulate veined between 3 or 5 main veins; plants mostly shrubby climbers.",
      "Stems ± woody and continuously thickened, with clear leaf scars in apical part; leaves usually crowded at or toward apex of stem or branches.",
      "Petiole 10--30 cm, leaf blade with veins essentially parallel but with lateral veins branching from midvein in proximal 1\/2; ovary with 2 to many ovules per locule",
      "Petiole absent to 8 cm, leaf blade with veins truly parallel from base, lateral veins absent; ovary with 1 or 2 ovules per locule",
      "Leaves laterally flattened, basally equitant, sword-shaped; bracteole cupular; pedicel glabrous; anthers ovate, with 2 separate locules",
      "Leaves not laterally flattened; bracteole absent; pedicel pubescent; anthers reniform, with confluent locules",
      "Inflorescence umbellate or umbellate-racemose; anthers dorsifixed, lanceolate, with locules separate or confluent only at apex",
      "Flowers several to 20, laxly arranged in a terminal panicle or occasionally a raceme; capsule usually broadly globose, 3-angled",
      "Inflorescence racemose with pedicels less than 6 mm or paniculate, axis elongate, ± ascending; stem simple; plants not stoloniferous",
      "Inflorescence usually 1-flowered or umbellate, rarely racemose with pedicels more than 1 cm, axis short, nodding; stem often branched; plants sometimes stoloniferous.",
      "Inflorescence only terminal, ± ascending, racemose or paniculate, pubescent; anthers positioned at perianth mouth or exserted from perianth; plants hemicryptophytic",
      "Inflorescences often both terminal and axillary, nodding, racemose or subumbellate, often 1- or 2-flowered, sometimes 3--6-flowered, glabrous; anthers included in perianth; plants epiphytic",
      "Leaves oblong to oblanceolate, 3--5 cm wide, basally tapered into a petiole; bracteole absent; anthers dorsifixed and versatile",
      "Perianth lobes spreading to inflexed; anthers ovate to suborbicular; rhizome usually stout, (2--)6--30 mm in diam.",
      "Anthers positioned higher than or as high as stigma; style short, 1(--3.5) mm, or absent; stigma small, 3-lobed",
      "Anthers positioned lower than stigma; style long, 4--12 mm; stigma large, 2--7 mm in diam., peltate to mushroom-shaped"
    ],
    "authors":"Xinqi Chen, Prof. Song-Yun Liang, Jie-mei Xu, David E. Boufford, Michael G. Gilbert, Rudolf V. Kamelin, Shoichi Kawano, Tetsuo Koyama, Elena V. Mordak, Junko Noguchi, Victor G. Soukup, Hiroshi Takahashi, Kamilla G. Tamanian, Minoru N. Tamura & Nicholas J. Turland"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Lowiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10521",
    "knowledge_content":[
      "Herbs rhizomatous. Stem very short. Leaves basal, distichous; petiole well developed, base sheathing; leaf blade lanceolate or oblong, with several pairs of longitudinal veins parallel to a distinct midvein. Inflorescence axillary or arising from rhizomes, cymose or reduced to a solitary flower, bracteate. Flowers bisexual, zygomorphic. Sepals 3, lanceolate. Petals 3, very unequal; middle petal enlarged to form a labellum; lateral petals small, apex often aristate. Stamens 5; filaments short; anthers 2-celled, dehiscing by longitudinal slits. Ovary inferior, 3-loculed, apex elongate; ovules numerous per locule; placentation axile. Style slender; stigmas 3, laciniate. Fruit a capsule, 3-valved, loculicidal. Seeds numerous, arillate; aril 3-lobed.\r",
      "One genus and ten species: Cambodia, China, Indonesia (Borneo), Laos, Malaysia, Vietnam; two species (endemic) in China.",
      "Wu Te-lin & Chen Sen-jen. 1981. Musaceae subfam. Lowioideae.  In: Wu Te-lin, ed., Fl. Reipubl. Popularis Sin. 16(2): 19--21."
    ],
    "authors":"Delin Wu & W. John Kress"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Marantaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10535",
    "knowledge_content":[
      "Herbs perennial, rhizomatous. Aerial stems present or absent. Leaves distichous, usually large; petiole sheathing at base, apex with a swollen pulvinus; leaf blade pinnately veined, lateral veins parallel, slightly S-shaped. Inflorescences terminal or axillary, borne on leafy shoots or occasionally on separate, leafless shoots from rhizomes, compound, headlike, spicate, or diffuse and much branched, bracteate; bracts each subtending a pair of flowers or a cincinus of paired flowers. Flowers bisexual, asymmetric, paired or rarely borne singly. Sepals 3, free. Corolla lobes 3, often slightly unequal, basally connate into a tube. Staminodes and stamen in 2 whorls: outer whorl with 1 or 2 petaloid staminodes, rarely absent; inner whorl with 1 hooded (cucullate) staminode enclosing terminal portion of pistil at anthesis and bearing a lateral appendage (trigger), 1 thickened and fleshy (callose) staminode, and 1 fertile stamen narrowly petaloid laterally; anther 1-loculed. Ovary inferior, 3-loculed, 1--3 locules fertile; ovules 1 per locule. Style cylindric, adnate to inside of corolla and staminode tube, free portion curved after explosive forward movement (tripping) when released Seeds 1--3, hard, usually arillate.from hooded staminode; stigma scoop-shaped or blunted and 3-cleft. Fruit a capsule, loculicidal, rarely indehiscent or berrylike.\r",
      "Thirty-one genera and ca. 525 species: pantropical but ca. 80% in America, absent from Australia; four genera (one introduced) and eight species (two endemic, one introduced) in China.",
      "Wu Te-lin & Chen Sen-jen. 1981. Marantaceae. In: Wu Te-lin, ed., Fl. Reipubl. Popularis Sin. 16(2): 158--169.",
      "Stems simple; cauline leaf 1 or absent; inflorescences capitate or spikelike; flower pairs subsessile; sepals and ovary not visible (covered by bracts); corolla tube proximally ± solid, not obviously hollow.",
      "Stems branched to much branched; cauline leaves (1 or)2 to numerous; inflorescences terminal on leafy shoots, racemose or paniculate; flower pairs exerted; sepals and ovary clearly visible; corolla tube obviously hollow throughout.",
      "Bracts numerous, spirally arranged, tan, red-purple, or green, leathery; cauline leaf 1, rarely absent; sepals slightly shorter than or longer than corolla tube",
      "Bracts 6--8, distichous, green, herbaceous; cauline leaves absent, all leaves basal; sepals less than 1\/3 as long as corolla tube",
      "Bracts numerous, deciduous; bracteoles present; sepals white, 2.5--4 mm; fruit globose, white to pale cream, indehiscent; plants 1.5--5 m tall, much branched above a basal, bamboolike cane; basal leaves absent",
      "Bracts 1--3, persistent; bracteoles absent; sepals green, 7--17 mm; fruit ellipsoid, green or tinged reddish brown, dehiscent; plants 0.4—1.3 m tall, once to moderately branched; basal leaves several, always present"
    ],
    "authors":"Delin Wu & Helen Kennedy"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Musaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10588",
    "knowledge_content":[
      "Herbs perennial or monocarpic, growing from sympodial rhizomes or a massive, sympodial corm. Pseudostems composed of closely packed leaf sheaths. Leaves spirally arranged, petiolate; leaf blade entire, pinnately veined. Inflorescence terminal or rarely axillary, cymose. Bracts spirally arranged, often brilliantly colored, spathelike, large. Flowers bisexual or unisexual by abortion, zygomorphic. Perianth in 2 whorls; 3 outer tepals and 2 inner ones united into a compound tepal; third inner tepal free. Stamens 5, free; anthers 2-loculed. Pistil 1; ovary inferior, 3-loculed; ovules numerous per locule, anatropous; placentation axile. Style simple or capitate. Fruit a berry, fleshy or leathery and dry, indehiscent. Seeds hard, not arillate; embryo straight, surrounded by a ± well-developed endosperm and a mealy perisperm.\r",
      "Three genera and ca. 40 species: tropical and subtropical regions of Africa and Asia; three genera (one endemic) and 14 species (four endemic, three introduced) in China.",
      "Li Hsi-wen. 1981. Musaceae subfam. Musoideae.  In: Wu Te-lin, ed., Fl. Reipubl. Popularis Sin. 16(2): 1--14.",
      "Herbs monocarpic, 1-stemmed; pseudostem often swollen at base; bracts green; seeds usually more than (5--)10 mm in diam.",
      "Herbs perennial, tufted; pseudostems not swollen at base; bracts variously colored; seeds usually less than 7 mm in diam.",
      "Pseudostems less than 60 cm; inflorescence terminal, or axillary near base of pseudostem, conical, dense; bracts yellow to yellow-orange; bracts and flowers persistent",
      "Pseudostems more than 60 cm; inflorescence terminal, not conical, lax; bracts green, brown, dull purple, or rarely yellow; bracts and flowers usually deciduous"
    ],
    "authors":"Delin Wu & W. John Kress"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Philydraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10676",
    "knowledge_content":[
      "Herbs, perennial, erect. Rhizome short. Leaves radical or crowded at stem base, basal and proximal cauline ones distichous, others smaller and spirally arranged; leaf sheaths equitant; leaf blade linear or ensiform, veins parallel, stomata paracytic. Inflorescence a spike, often branched; bracts spathelike. Flowers bisexual, sessile, zygomorphic. Perianth yellow or whitish; segments 4, in 2 whorls, petaloid, outer 2 larger than inner 2. Stamen 1, inserted at base of lower perianth segment; filament flattened, glabrous; anther basifixed, 2-loculed, dehiscing by longitudinal slits; pollen grains 2-nucleate. Ovary superior, 3-loculed and placentation axile or 1-loculed and placentation parietal; ovules numerous per locule, anatropous. Style simple; stigma capitate or obscurely 3-lobed. Fruit a 3-valved capsule, longitudinally dehiscent. Seeds numerous; testa helicoidally striate; endosperm developed; embryo straight.\r",
      "Four genera and five species: mainly in Australia, some species extending to W Pacific Islands and mainland SE Asia; one species in China."
    ],
    "authors":"Guofang Wu & Kai Larsen"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Pontederiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10722",
    "knowledge_content":[
      "Herbs annual or perennial, aquatic, floating or rooting in substrate. Roots fibrous. Vegetative stems short or creeping, thick. Leaves rosulate or distributed along stem, distichous; petiole mostly distinct, sometimes inflated; leaf sheath usually present; leaf blade emersed or submersed, broadly ovate, lanceolate, or broadly linear, sometimes completely reduced, stomata paracytic. Flowering stems erect, solid, terminating in a leaf, spathe, and inflorescence. Inflorescences paniculate, racemose, spicate, umbellate, or 1-flowered, subtended by a spathelike or tubular leaf sheath; bracts minute or absent. Flowers bisexual, mostly actinomorphic, sometimes zygomorphic. Perianth segments 6, in 2 whorls, petaloid, free or basally connate into a tube. Stamens usually 6 in 2 whorls, rarely 3 or 1, inserted on perianth, often unequal or dissimilar; filaments slender, free; anthers 2-loculed, introrse, dehiscing by longitudinal slits or rarely by pores; pollen grains 2- or 3-nucleate, colpi 1 or 2(or 3), distal or subequatorial. Ovary superior, 3-loculed and placentation axile or 1-loculed and placentation parietal; ovules numerous per locule or 1 and pendulous, anatropous. Style 1; stigma capitate or minutely 3-lobed. Fruit a 3-valved capsule or indehiscent. Seeds small, longitudinally ribbed or smooth; endosperm copious, mealy; embryo central in seed, straight, terete.\r",
      "Six genera and ca. 40 species: widespread in tropical and subtropical regions; two genera (one introduced) and five species (one introduced) in China.",
      "Wu Kuo-fang. 1997. Pontederiaceae.  In: Wu Kuo-fang, ed., Fl. Reipubl. Popularis Sin. 13(3): 134--141.",
      "Flowers distinctly pedicellate; perianth actinomorphic, segments free nearly to base, all essentially uniform in color; stamens 6, 1 usually longer than others; petiole not inflated",
      "Flowers sessile; perianth zygomorphic, segments basally united into a tube, apical lobe with a discolorous blotch; stamens 6, 3 much longer than others; petiole inflated"
    ],
    "authors":"Guofang Wu & Charles N. Horn"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Restionaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10761",
    "knowledge_content":[
      "Herbs perennial, mostly dioecious, rarely monoecious or hermaphroditic. Rhizomes usually covered with imbricate scales; scales glabrous or with various types of unicellular or multicellular hairs. Stem erect, simple or branched, terete, quadrangular, or compressed; nodes solid; internodes solid or hollow. Leaves alternate, mostly scattered along stem, usually reduced to an open leaf sheath with a rudimentary blade; leaf sheath closely appressed to stem or inflated; ligule usually obscure or absent, apex sometimes elongate. Male and female inflorescences sometimes dissimilar, of (1- to) many-flowered spikelets or much branched and occasionally with leafy bracts; bracteoles chaffy. Flowers mostly unisexual, small; male flowers sometimes with a pistillode; female flowers sometimes with staminodes. Perianth usually in 2 whorls, seldom reduced or absent; segments scalelike. Stamens (1--)3(or 4), inserted opposite inner perianth segments; filaments free or rarely connate; anthers 1(or 2)-loculed, introrse or seldom latrorse, dehiscing by longitudinal slits; pollen grains 2- or 3-nucleate, 1-porate. Ovary 1--3-loculed; ovule 1 per locule, pendulous, orthotropous. Styles 1--3, free or basally connate; stigma elongate, often plumose. Fruit a nut or loculicidal capsule, usually small. Endosperm copious, mealy; embryo biconvex, small.\r",
      "About 55 genera and 490 species: widely distributed in the S hemisphere, best developed in SW Africa and SW Australia: one species in China."
    ],
    "authors":"Guofang Wu & Kai Larsen"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Stemonaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10849",
    "knowledge_content":[
      "Subshrubs, vines, or herbs perennial, with tuberous roots or creeping rhizomes. Stems erect or climbing. Leaves whorled, opposite, or alternate, petiolate or sessile; main veins 3 or more, transverse veinlets numerous. Inflorescences racemes or cymes, 1- to few flowered; peduncle axillary or attached to petiole or leaf midvein. Flowers bisexual, actinomorphic. Perianth segments 4, in 2 whorls, petaloid, free. Stamens 4, subhypogynous; filaments free or basally connate in a ring, very short; anthers dorsifixed or basifixed, erect, linear, introrse; connective usually appendaged, appendage extending beyond apex of anther locule, perianthlike, linear-lanceolate, long. Ovary superior or subinferior, 1-loculed; ovules 2 or more, basally or apically attached to placenta. Stigma sessile, small. Capsule slightly compressed, 2-valved. Seed appendages on or near funicle, arillate; testa leathery; embryo hard, albuminous.\r",
      "Four genera and ca. 32 species: Asia, tropical Australia, one species in E North America; two genera and eight species (five endemic) in China.",
      "Plants with tuberous, fleshy roots; anther connective appendage present; ovules basally attached to placenta",
      "Plants with creeping rhizomes; anther connective appendage absent; ovules apically attached to placenta"
    ],
    "authors":"Zhanhe Ji & Brigitta E. E. Duyfjes"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Taccaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10865",
    "knowledge_content":[
      "Herbs perennial. Rhizomes cylindric to subcylindric or tubers globose to broadly ellipsoid-globose. Leaves radical; petiole erect, base sheathing; leaf blade entire to deeply lobed at margin. Flowering stem often a long scape. Inflorescences umbels; involucral bracts (2--)4--6(--12), in 2 whorls, elongate or broad. Flowers bisexual, actinomorphic; bracteoles linear, narrower than bracts. Perianth tube adnate to ovary, 6-lobed; lobes in 2 whorls, petaloid. Stamens 6, inserted on perianth lobes; filaments short, apex hooded or spatulate; anthers 2-loculed, introrse. Ovary inferior; ovules many, anatropous. Style short; stigma 3-lobed, usually petaloid, curved over style. Fruit a berry or rarely a 3-valved capsule. Seeds many; endosperm abundant; embryo small.\r",
      "Two genera and ca. 13 species: pantropical; two genera and six species (two endemic, one introduced) in China.",
      "Ling Ping-ping. 1985. Taccaceae.  In: Pei Chien & Ting Chih-tsun, eds., Fl. Reipubl. Popularis Sin. 16(1): 42--54.",
      "Fruit a berry; leaf blade 20--55(--60) × 7--21(--25) cm, base not elongate, stomatal apparatus mostly axillocytic",
      "Fruit a capsule; leaf blade 10--15(--25) × 4--6(--8) cm, base elongate, stomatal apparatus mostly anomocytic"
    ],
    "authors":"Chih-chi Ting & Kai Larsen"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Xyridaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10957",
    "knowledge_content":[
      "Herbs perennial or rarely annual. Roots fibrous. Leaves mostly basal, distichous or sometimes polystichous, sheathing; leaf blade ensiform, linear, or filiform. Scapes or peduncles usually numerous. Inflorescence terminal, a globose to cylindric head or dense spike; bracts conspicuous, spirally imbricate or decussate, persistent or sometimes caducous in fruit. Flowers bisexual, 3-merous. Sepals 3, sometimes median sepal reduced or absent, lateral sepals 2, chaffy-scarious, keeled. Corolla actinomorphic or rarely zygomorphic, usually ephemeral; petals 3, yellow, less often white or blue, free, base clawed or sometimes connate, or forming a long tube. Stamens usually 3, inserted opposite petals; filaments short, adnate to petals, rarely free; anthers 2-loculed, dehiscing longitudinally. Staminodes present or absent. Ovary superior. Style filiform, apex 3-branched or simple. Capsule oblong, 3-valved, loculicidal. Seeds with copious and ± mealy endosperm; embryo small.\r",
      "About five genera and ca. 300 species: widespread in tropical and subtropical regions; one genus and six species (one endemic) in China."
    ],
    "authors":"Guofang Wu & Robert Kral"
  },
  {
    "group_title":"Flagellariaceae through Marantaceae",
    "family":"Zingiberaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10960",
    "knowledge_content":[
      "Herbs perennial, terrestrial, rarely epiphytic, aromatic, with fleshy, tuberous or non-tuberous rhizomes, often with tuber-bearing roots. Stems usually short, replaced by pseudostems formed by leaf sheaths. Leaves distichous, simple, those toward base of plant usually bladeless and reduced to sheaths; leaf sheath open; ligule usually present; petiole present or not, located between leaf blade and sheath, cushionlike in  Zingiber; leaf blade suborbicular or lanceolate to narrowly strap-shaped, rolled longitudinally in bud, glabrous or hairy, midvein prominent, lateral veins usually numerous, pinnate, parallel, margin entire. Inflorescence terminal on pseudostems or on separate, short, sheath-covered shoots arising from rhizomes, cylindric or fusiform, sometimes globose, lax to dense, few to many flowered, sometimes with bracteolate cincinni in bract axils and then a thyrse, sometimes a raceme or spike; bracts and bracteoles present, often conspicuous, colored. Flowers bisexual, epigynous, zygomorphic. Calyx usually tubular, thin, split on 1 side, sometimes spathelike, apex 3-toothed or -lobed. Corolla proximally tubular, distally 3-lobed; lobes varying in size and shape. Stamens or staminodes 6, in 2 whorls. Lateral 2 staminodes of outer whorl petaloid, or forming small teeth at base of labellum, or adnate to labellum, or absent. Median staminode of outer whorl always reduced. Labellum formed from lateral 2 staminodes of inner whorl. Fertile stamen median, of inner whorl; filament long or short; anther locules 2, introrse, dehiscing by slits or occasionally pores; connective often extended basally into spurs and\/or apically into a crest. Ovary inferior, 3-loculed initially, 1- or 3-loculed when mature; ovules ± numerous per locule; placentation parietal, basal, or axile. Developed style 1, very thin, placed in a furrow in filament and between anther locules; stigma appearing above anther, funnelform, papillose, ± wet, margin often ciliate. Stylodes 2, reduced to nectaries at apex of ovary. Fruit a capsule, fleshy or dry, dehiscent or indehiscent, sometimes berrylike. Seeds few to many, arillate; aril often lobed or lacerate.\r",
      "About 50 genera and 1300 species: pantropical with center of diversity in S and SE Asia, some species in America and subtropical and warm-temperate Asia; 20 genera (one endemic) and 216 species (141 endemic, four introduced) in China.",
      "Wu Te-lin, Chen Sen-jen, Tsai Hsi-tao, Tong Shao-quan, Chen Pei-shan & Zhao Shi-wang. 1981. Zingiberaceae subfam. Zingiberoideae. In: Wu Te-lin, ed., Fl. Reipubl. Popularis Sin. 16(2): 22--148.",
      "Lateral staminodes forming small teeth at base of labellum, or adnate to labellum (forming a 3-lobed structure), or absent.",
      "Lateral staminodes adnate to labellum forming a 3-lobed structure; style extended well beyond fertile part of anther; anther connective crest elongate, wrapped around style",
      "Lateral staminodes forming small teeth at base of labellum or absent; style extended just beyond fertile part of anther; anther connective crest (if present) not wrapped around style.",
      "Labellum erect, narrowly spatulate, base adnate to filament; leaf blade subsagittate or cordate at base",
      "Base of labellum adnate to filament to form a distinct tube above lateral staminodes and corolla lobes; corolla tube shorter than or equaling labellum",
      "Ovary 1-loculed, placentation parietal; anther long; labellum adnate to filament to form a slender tube above lateral staminodes and corolla lobes",
      "Inflorescences conical; bracts connate laterally for ca. 1\/2 their length, forming basal pouches, each subtending a cincinnus of 2--7 flowers",
      "Ovary and capsule oblong, cylindric, or clavate; capsule late dehiscent; flowers purple or white, rarely yellow",
      "Leaves all basal or on very short pseudostems; inflorescences terminal on pseudostems or on separate shoots arising from rhizomes."
    ],
    "authors":"Delin Wu & Kai Larsen"
  },
  {
    "group_title":"Orchidaceae",
    "family":"Orchidaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10638",
    "knowledge_content":[
      "Authors: Xinqi Chen, Zhongjian Liu, Guanghua Zhu, Kai-yung Lang, Zhanhe Ji, Yi-Bo Luo, Xiaohua Jin, Phillip J. Cribb, Jeffrey J. Wood, Stephan W. Gale, Paul Ormerod, Jaap J. Vermeulen, Howard P. Wood, Dudley Clayton & Alexandra Bell",
      "Perennial, but sometimes short-lived, terrestrial, epiphytic, or lithophytic, autotrophic or rarely mycotrophic herbs (or rarely scrambling vines), with rhizomes, tubers, or rootstocks with mycorrhizal fungi in roots. Stems either sympodial or monopodial, usually leafy, but leaves sometimes reduced to bractlike scales, 1 or more internodes at base often swollen to form a \"pseudobulb\"; epiphytic species with aerial, photosynthesizing adventitious roots, often bearing 1 or more layers of dead cells (velamen). Leaves 1 to many, alternate or occasionally opposite, often distichous, sometimes terete or canaliculate, glabrous or very rarely hairy, frequently fleshy or leathery, base almost always sheathing, sometimes articulated, sometimes forming a false petiole, margin entire, apex often emarginate. Inflorescence basal, lateral, or terminal, erect to pendulous, racemose, spicate, subumbellate, or paniculate, 1- to many flowered, flowers rarely secund or distichously arranged. Flowers small to large, often quite showy, usually zygomorphic, very rarely ± actinomorphic, bisexual [very rarely monoecious and polymorphic], sessile or pedicellate, most often resupinate with pedicel and ovary twisted through 180°, occasionally not twisted or twisted through 360°. Ovary inferior, 1-locular, placentation parietal (or rarely 3-locular and placentation axile). Sepals usually free but sometimes variously adnate, median (dorsal) one often dissimilar to laterals, laterals sometimes adnate to a column foot to form a saccate, conic, or spurlike mentum. Petals free or rarely partly adnate to sepals, similar to sepals or not, often showy; lip entire, variously lobed or 2- or 3-partite, ornamented or not with calli, ridges, hair cushions, or crests, with or without a basal spur or nectary, margins entire to laciniate. Column short to long, with or without a basal foot, occasionally winged or with lobes or arms at apex or ventrally; anther mostly 1, less often 2 or 3, terminal or ventral on column, caplike or opening by longitudinal slits; pollen usually forming distinct pollinia, less often loose, pollinia 2, 4, 6, or 8, mealy, waxy, or horny, sectile or not, sessile or attached by stalks (caudicles or stipes) to 1 or 2 sticky viscidia; stigma 3-lobed, mid-lobe often modified to form a rostellum, other lobes either sunken on ventral surface of column behind anther or with 2 lobes porrect. Fruit a capsule, rarely berrylike, usually opening laterally by 3 or 6 slits. Seeds very numerous, dustlike, lacking endosperm, rarely winged.\r",
      "About 800 genera and ca. 25,000 species (some estimates as high as 30,000 species): worldwide, except for Antarctica, most numerous in the humid tropics and subtropics; 194 genera (11 endemic, one introduced) and 1,388 species (491 endemic, one introduced) in five subfamilies in China.",
      "Recent analyses of orchids incorporating data from DNA analyses have confirmed many aspects of the established classifications but have also provided some surprises for orchid taxonomists. First of all, the results have upheld the monophyly (evolutionary integrity, i.e., the group includes all the taxa derived from an ancestral species) of the orchid family, including the apostasioids and cypripedioids. They also suggest strongly that the orchids are an ancient group that evolved in the great southern continent of Gondwanaland before it split up to form the southern continents of Australia, Africa, and South America, the island of Madagascar, and the subcontinent of India. The subfamilies Apostasioideae, Cypripedioideae, and Orchidoideae (sensu Dressler, Phylogeny Classific. Orchid Fam. 1993) are all monophyletic. However, recent work clearly shows that Vanilla and its relatives form a separate and ancient clade (an evolutionary lineage including all the taxa derived from a single ancestral one) that deserves recognition as the subfamily Vanilloideae, that the Spiranthoideae nest within a more broadly defined Orchidoideae, and that Vandoideae are a specialized clade within a more broadly defined Epidendroideae.A detailed new classification of the orchid family is currently being produced under the title Genera Orchidacearum, of which four of the six volumes have been published and a fifth is near completion (Pridgeon et al., Gen. Orchid. 1-4(1). 1999-2005). Even when this work is completed, such is the speed with which new information and techniques are being developed and published, it will almost certainly require revision. However, we now have the broad bones of a more robust and predictive classification of the family that will be more satisfactory than the presently widely used systems that are based mainly upon morphological characters.The classification of the family is currently the subject of some debate, particularly the circumscription and the placement of certain tribes, subtribes, and genera. The classification of Chase et al. (in Dixon et al., Orchid Conservation, 69-89. 2003), elaborated in Pridgeon et al. (loc. cit.), which is strongly supported by recent molecular, embryological, and morphological analyses, is followed here. They recognize five subfamilies: Apostasioideae, Cypripedioideae, Vanilloideae, Orchidoideae, and Epidendroideae.Lang Kaiyong, Chen Singchi, Luo Yibo & Zhu Guanghua. 1999. Orchidaceae (1). In: Lang Kaiyong, ed., Fl. Reipubl. Popularis Sin. 17: 1-499; Chen Singchi, Tsi Zhanhuo, Lang Kaiyong & Zhu Guanghua. 1999. Orchidaceae (2). In: Chen Singchi, ed., Fl. Reipubl. Popularis Sin. 18: 1-412; Tsi Zhanhuo, Chen Singchi, Luo Yibo & Zhu Guanghua. 1999. Orchidaceae (3). In: Tsi Zhanhuo, ed., Fl. Reipubl. Popularis Sin. 19: 1-437.",
      "Flower rotate or subregular; lateral sepals free; lip petal-like, sometimes rather broad; column fused only at base of filaments; anthers 2 or 3, erect above lip; stigma terminal.",
      "Flower zygomorphic (bilaterally symmetrical); lateral sepals usually fused almost to apex; lip usually saccate or urceolate; column with 2 lateral anthers and a terminal usually shield-shaped staminode; stigma ventral, stalked.",
      "Plants usually terrestrial, growing from tubers or a horizontal fleshy rhizome; anther basifixed or not; pollinia segmented, comprising massulae, or mealy.",
      "Plants usually epiphytic or lithophytic, rarely terrestrial or lianalike, growing from cylindric stems or pseudobulbs, borne on woody or tough rhizomes; anther not basifixed; pollinia mealy or hard, often attached by a stalk to a sticky viscidium",
      "Plants lianalike or terrestrial, often heteromycotrophic and lacking green leaves; stems cylindric, never pseudobulbous; pollinia 2, powdery, as monads or tetrads, lacking a stipe and a distinct viscidium.",
      "Plants epiphytic, lithophytic, or less commonly terrestrial, rarely heteromycotrophic; stems cylindric to pseudobulbous; pollinia 2, 4, 6, or 8, usually hard, rarely sectile, often attached by 1 or 2 stipes to 1 or 2 distinct viscidia."
    ],
    "authors":"Xinqi Chen, Zhongjian Liu, Guanghua Zhu, Kai-yung Lang, Zhanhe Ji, Yi-Bo Luo, Xiaohua Jin, Phillip J. Cribb, Jeffrey J. Wood, Stephan W. Gale, Paul Ormerod, Jaap J. Vermeulen, Howard P. Wood, Dudley Clayton & Alexandra Bell"
  }
]