[
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Tropaeolaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10919",
    "knowledge_content":[
      "Herbs, annual or perennial. Roots sometimes tuberous. Stems ± succulent, often climbing. Stipules sometimes present especially in seedlings. Leaves alternate; petiole long; leaf blade peltate or palmately lobed or divided. Inflorescences indeterminate, racemose, elongate, and stemlike or condensed and umbellate, with each flower subtended by a single leaf. Flowers bisexual, solitary, zygomorphic, large, on a long axillary pedicel. Sepals 5, imbricate, adaxial 1(or 3) extended into a long slender nectariferous spur. Petals 5 or some aborted, yellow, orange, blue, or purple, clawed, imbricate, 2 upper petals larger and connate with spur, others usually smaller and inserted in opening of spur. Stamens 8, 2-verticillate, distinct, unequal; anthers 2-celled, dehiscent by longitudinal slits. Ovary superior, 3-loculed, placentation axile; ovule 1 per locule, pendulous from axile apex, anatropous; style 1, apical; stigma linear, 3-lobed. Fruits separating into 3 1-seeded mericarps, fleshy or dry. Seed without endosperm; embryo straight.\r",
      "Huang Chengchiu, Huang Baoxian & Xu Langran. 1998. Tropaeolaceae. In: Xu Langran & Huang Chengchiu, eds., Fl. Reipubl. Popularis Sin. 43(1): 90-92."
    ],
    "authors":"Quanru Liu & Lihua Zhou"
  },
  {
    "group_title":"Oxalidaceae through Aceraceae",
    "family":"Zygophyllaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10963",
    "knowledge_content":[
      "Shrubs, shrublets, or perennial herbs, rarely annuals. Stipules distinct or connate, often persistent. Leaves opposite or sometimes alternate, simple or pinnate, often fleshy. Inflorescences axillary or terminal, solitary, racemose, or cymose. Flower bisexual, actinomorphic or zygomorphic. Sepals 4 or 5, imbricate or valvate. Petals 4 or 5, imbricate or valvate. Stamens 4 or 5 or up to 3 × as many as petals, with or without appendages. Ovary usually (2 or)3-5(-12)-locular. Fruit a drupe, capsule, or schizocarp, leathery or fragile.\r",
      "Twenty-six genera and ca. 284 species: temperate, tropical, and subtropical areas of Africa, America, Asia, Australia, and Europe; three genera (one endemic) and 22 species (three endemic) in China.",
      "Liou Yingxin. 1998. Zygophyllaceae (excluding Nitraria and Peganum). In: Xu Langran & Huang Chengchiu, eds., Fl. Reipubl. Popularis Sin. 43(1): 116-145."
    ],
    "authors":"Yingxin Liu & Lihua Zhou"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Actinidiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10011",
    "knowledge_content":[
      "Trees, shrubs, or woody vines. Leaves alternate, simple, shortly or long petiolate, not stipulate. Flowers bisexual or unisexual or plants polygamous or functionally dioecious, usually fascicled, cymose, or paniculate. Sepals (2 or 3 or)5, imbricate, rarely valvate. Petals (4 or)5, sometimes more, imbricate. Stamens 10 to numerous, distinct or adnate to base of petals, hypogynous; anthers 2-celled, versatile, dehiscing by apical pores or longitudinally. Ovary superior, disk absent, locules and carpels 3-5 or more; placentation axile; ovules anatropous with a single integument, 10 or more per locule; styles as many as carpels, distinct or connate (then only one style), generally persistent. Fruit a berry or leathery capsule. Seeds not arillate, with usually large embryos and abundant endosperm.\r",
      "Three genera and ca. 357 species: Asia and the Americas; three genera (one endemic) and 66 species (52 endemic) in China.",
      "Economically, kiwifruit (Actinidia chinensis var. deliciosa) is an important fruit, which originated in central China and is especially common along the Yangtze River (well known as yang-tao). Now, it is widely cultivated throughout the world.For additional information see the paper by X. W. Li, J. Q. Li, and D. D. Soejarto (Acta Phytotax. Sin. 45: 633-660. 2007).Liang Chou-fen, Chen Yong-chang & Wang Yu-sheng. 1984. Actinidiaceae (excluding Sladenia). In: Feng Kuo-mei, ed., Fl. Reipubl. Popularis Sin. 49(2): 195-301, 309-334.",
      "Ovary 15-30-loculed and -styled, styles distinct; fruit a berry without a ridge; seeds numerous; stamens 15-130.",
      "Ovary 5-loculed and -styled, styles connate; fruit berrylike or a dry leathery capsule, 5-ridged; seeds usually 5; stamens 10."
    ],
    "authors":"Jianqiang Li, Xinwei Li & D. Doel Soejarto"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Balsaminaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10092",
    "knowledge_content":[
      "Herbs annual or perennial [rarely epiphytic or subshrubs]. Stems erect or procumbent, usually succulent, often rooting at lower nodes. Leaves simple, alternate, opposite, or verticillate, not stipulate, or sometimes with stipular glands at base of petiole, petiolate or sessile, pinnately veined, margin serrate to nearly entire, teeth often glandular-mucronate. Flowers bisexual, protandrous, zygomorphic, resupinate to through 180° in axillary or subterminal racemes or pseudo-umbellate inflorescences, or not pedunculate, fascicled or solitary. Sepals 3(or 5); lateral sepals free or connate, margins entire or serrate; lower sepal (lip) large, petaloid, usually navicular, funnelform, saccate, or cornute, tapering or abruptly constricted into a nectariferous spur broadly or narrowly filiform, straight, curved, incurved, or ± coiled, swollen at tip, or pointed, rarely 2-lobed, rarely without spur. Petals 5, free, upper petal (standard) flat or cucullate, small or large, often crested abaxially, lateral petals free or united in pairs (wing). Stamens 5, alternating with petals, connate or nearly so into a ring surrounding ovary and stigma, falling off in one piece before stigma ripens; filaments short, flat with a scalelike appendage inside; anthers 2-celled, connivent, opening by a slit or pore. Gynoecium 4- or 5-carpellate, syncarpous; ovary superior, 4- or 5-loculed, each locule with 2 to many anatropous ovules; style 1, very short or ± absent; stigmas 1-5. Fruit an indehiscent berry, or a 4- or 5-valved loculicidal fleshy capsule, usually dehiscing elastically. Seeds dispersed explosively from opening valves, without endosperm; testa smooth or tuberculate.\r",
      "Two genera and more than 900 species: mainly in tropical and subtropical Africa, some species in temperate Asia, Europe, and North America; two genera and 228 species (187 endemic, two introduced) in China; three additional species (all endemic) are of uncertain placement.",
      "All but one of the species in the family belong to Impatiens. The unispecific Hydrocera is confined to India and SE Asia.Chen Yiling. 2001. Balsaminaceae. Fl. Reipubl. Popularis Sin. 47(2): ii-vii, 1-243."
    ],
    "authors":"Yilin Chen, Shinobu Akiyama & Hideaki Ohba"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Bombacaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10113",
    "knowledge_content":[
      "Trees, usually large, often deciduous; trunks sometimes spiny, often buttressed; bark fibrous, with mucilaginous exudates; indumentum usually stellate or tufted. Leaves alternate, spiral; stipules inconspicuous, caducous; petiole pulvinate; leaf blade often palmately compound (simple and lobed in Ochroma), margin often entire. Inflorescences axillary, 1(or 2)-flowered, rarely many-flowered. Flowers bisexual, actinomorphic, large and showy. Epicalyx of 3 bracts, inconspicuous and caducous. Calyx shortly cylindrical, truncate, or irregularly 3-5-lobed, sometimes splitting. Petals 5, joined at base with androecium and falling as one unit, imbricate. Stamens usually very many (3-15 in Ceiba); filaments usually united in lower half into a filament tube around style, tube sometimes lobed, with stamens in 5 groups with completely united filaments and sessile anthers; anthers usually 1-celled, apparently 2-celled and non-septate in Ceiba, sometimes many anthers united into an apparent many-celled \"super-anther\"; pollen usually spheroidal, ± smooth, reticulate; staminodes absent. Ovary superior, syncarpous, carpels usually 5; ovules 2 to many per locule, axile, anatropous; style 5-lobed. Fruit a 5-valved capsule, or hard and indehiscent (e.g., Adansonia), many-seeded with seeds often embedded in endocarp hairs (kapok), less often fruit winged or juicy and few-seeded. Seeds sometimes winged.\r",
      "About 30 genera and ca. 250 species: found widely in tropics, especially tropical America; three genera (two introduced) and five species (two introduced) in China.",
      "See the comments under the Malvaceae (p. 264) for the relationships of the Bombacaceae.Durio Adanson was at one time associated with this family but has always been regarded as anomalous and molecular data show it to be most closely related to the Helicteroideae (Sterculiaceae) but so distinct morphologically that it might better be placed in its own family or subfamily. Fruits of Durio zibethinus Murray (榴莲 liu lian, durian) are often available in S China, but attempts to cultivate it in China have not been successful and all fruits are imported from SE Asia.Adansonia digitata Linnaeus (African baobab tree, 猴面包树 hou mian bao shu) and Ochroma pyramidale (Cavanilles ex Lamarck) Urban (O. lagopus Swartz, 轻木 qing mu, noteworthy as the source of the extremely lightweight timber, balsa) are only found in botanical gardens and do not merit full treatments.Li Hen. 1984. Bombacaceae. In: Feng Kuo-mei, ed., Fl. Reipubl. Popularis Sin. 49(2): 102-112.",
      "Leaf blade palmately veined, dentate; capsule without spines; seeds surrounded by dense wool Ochroma (see note above)",
      "Leaf blade pinnately veined, entire; capsule with robust spines; seeds surrounded by strongly scented edible flesh. ------ Durio",
      "Stamens in many fascicles, each fascicle with 7-10 stamens; calyx truncate, adaxially glabrous; seeds 2.2-2.5 cm, not immersed in hairs; trees to 5 m; leaflets subsessile or with petiolule less than 0.4 cm.",
      "Stamens not in fascicles or in 5 fascicles, each with more than 10 stamens; calyx toothed, adaxially hairy; seeds to 0.5 cm, immersed in hairs; trees to 25 m; leaflets with petiolule 1-4 cm."
    ],
    "authors":"Ya Tang, Michael G. Gilbert & Laurence J. Dorr"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Dilleniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10277",
    "knowledge_content":[
      "Trees, shrubs, or woody climbers, rarely herbs; hairs sclerified and\/or silicified, sometimes fasciculate. Leaves simple, rarely pinnatisect or pinnately compound, usually spirally arranged, rarely opposite, petiolate; stipules absent; petiole sometimes winged; leaf blade leathery, herbaceous, or membranous, margin entire or serrate. Flowers bisexual, rarely unisexual, actinomorphic, occasionally zygomorphic, solitary or in racemes, panicles or cymes. Sepals (3 or)4-5(-18), imbricate, persistent, usually leathery or fleshy, sometimes accrescent in fruit. Petals (2 or)3-5(-7), white, yellow, or red, imbricate, crumpled in bud. Stamens numerous (or 1-10), developing centrifugally, free or united basally and then in fascicles; staminodes often present; anthers basifixed, dehiscing by longitudinal slits, apical clefts, or apical pores. Gynoecium (1 or)2-7(-20)-carpellate, superior; carpels free or hemisyncarpous; stylodia free, apically stigmatic; ovules 1 to numerous, anatropous; placentation submarginal, or basal when ovules 1 or 2. Fruit a follicle, polyfollicle, berry, or capsule, or indehiscent and enclosed by fleshy sepals. Seeds 1 to numerous; endosperm copious, oily; embryo very small, straight, achlorophyllous.\r",
      "Ten genera and ca. 500 species: pantropical and extending into warm-temperate Australia; two genera and five species in China.",
      "Chang Hung-ta. 1984. Dilleniaceae. In: Feng Kuo-mei, ed., Fl. Reipubl. Popularis Sin. 49(2): 190-195.",
      "Woody climbers; flowers small; sepals thinly leathery, not accrescent; anther connective conspicuously expanded laterally; carpels 1-5, on flat receptacle.",
      "Trees; flowers large, solitary or in racemes; sepals fleshy, often accrescent; anther connective narrow, linear; carpels 4-20, adnate to conical receptacle."
    ],
    "authors":"Zhixiang Zhang & Klaus Kubitzki"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Elaeocarpaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10299",
    "knowledge_content":[
      "Trees or shrubs, evergreen or semi-evergreen. Leaves alternate or rarely opposite, stipulate or not, petiolate, simple, pinnately veined. Inflorescence axillary or terminal, racemose, corymbose, paniculate, or sometimes fascicled or solitary flowers. Flowers bisexual or polygamous, 4- or 5-merous, actinomorphic, with or without bracts. Sepals 4 or 5, basally connate or free, usually valvate. Petals 4 or 5, sometimes absent, valvate or imbricate, margin laciniate or rarely entire. Stamens 8 to numerous; filaments free and borne on disks; anthers 2-celled, dehiscent by apical or longitudinal slits, awned or tipped with hairs at apices. Disk circular or glandularly lobed. Ovary superior, 2- to several loculed; placentation axile; ovules 2 to several per locule; style connate or free. Fruit a drupe or capsule. Seeds with copious endosperm; embryo flat.\r",
      "About 12 genera and ca. 550 species: primarily in tropical to subtropical regions of both hemispheres, excluding Africa; two genera and 53 species (21 endemic) in China.",
      "The two genera in China are of economic value (i.e., medicine, food, and timber).Chang Hung-ta. 1989. Elaeocarpaceae. In: Chang Hung-ta, ed., Fl. Reipubl. Popularis Sin. 49(1): 1-46."
    ],
    "authors":"Ya Tang & Chamlong Phengklai"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Hippocastanaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10412",
    "knowledge_content":[
      "Trees or shrubs, usually deciduous [evergreen in Billia Peyritsch]. Bark gray to brown, smooth or rough. Branchlets brown, green, or purplish, terete, glabrous, or puberulent to densely villous when young, covered with white to yellow lenticels. Winter buds terminal or axillary, with imbricate scales [without scales in Billia]. Leaves opposite, long petiolate, exstipulate; leaf blade palmately 5-11-foliolate [3-foliolate in Billia]; leaflets sessile or petiolulate; leaflet blades often unequal (middle ones larger), lanceolate to oblanceolate or oblong, abaxially glabrous or hairy, adaxially glabrous, base cuneate to cordate, margin crenate to serrate or compoundly so, or entire, apex acute to caudate. Inflorescence a terminal thyrse, usually erect, cylindric to conic; branches simple or compound; bracts subulate, small, absent in Aesculus. Flowers often rather large and showy, somewhat zygomorphic, bisexual or many of them (especially upper ones) functionally male. Sepals 4 or 5, nearly free or connate to form a tubular to campanulate calyx tube. Petals 4 or 5, free, imbricate, ± equal to unequal. Nectary disk small, annular, often unilateral, slightly divided or not. Stamens 5-8, hypogynous, inserted on inner side of disk, free, unequal, exceeding petals, inner whorl of 5, complete, outer whorl incomplete; filament arcuate distally; anther dehiscing longitudinally. Ovary superior, (2 or)3(or 4)-loculed; ovules 2 per locule, placentation axile; style 1, terminal, long and slender or short; stigma entire to 3-lobed. Fruit a loculicidal capsule, depressed globose to pyriform, with a long gynophore in Handeliodendron, often functionally 1-valved and 1-seeded by abortion, apex often mucronate; pericarp leathery, sometimes thickly so, usually smooth, often dotted, rarely verrucose or prickly. Seeds depressed globose to pyriform, often large; testa brown or glossy black, hard leathery; hilum large, pale, or an arillode in Handeliodendron; embryo large, curved, often starchy; endosperm absent.\r",
      "Three genera and 15 species: Asia (Himalayas to Japan), SE Europe, North America, also Central and South America (Billia); two genera (one endemic) and five species (two endemic, two introduced) in China.",
      "The Hippocastanaceae, together with the Aceraceae, have recently been treated within the Sapindaceae by some authors, e.g., Stevens, Angiosperm Phylogeny Website (2001 onward).Fang Wen-pei. 1981. Hippocastanaceae. In: Fang Wen-pei, ed., Fl. Reipubl. Popularis Sin. 46: 274-289; Lo Hsien-shui & Chen Te-chao. 1985. Handeliodendron. In: Law Yuh-wu & Lo Hsien-shui, eds., Fl. Reipubl. Popularis Sin. 47(1): 61-62.",
      "Capsule with a long (1-1.5 cm) gynophore; seeds 0.8-1.1 cm, with a 2-layered arillode occupying ca. 1\/2 of seed; leaflet blades with sparsely scattered, conspicuous, brown or dark red glands, margin entire; thyrse branches compound; sepals connate only at base.",
      "Capsule without a gynophore; seeds 2-7 cm, with a large, pale hilum occupying 1\/3-1\/2 of seed; leaflet blades without scattered, conspicuous glands, margin crenate to serrate or compoundly so; thyrse branches simple; sepals connate to form a tubular to campanulate calyx tube."
    ],
    "authors":"Nianhe Xia, Nicholas J. Turland & Paul A. Gadek"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Leeaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10484",
    "knowledge_content":[
      "Shrubs, small trees, scramblers, or rarely large perennial herbs. Stems unarmed or with rows of prickles; tendrils absent. Leaves 1-4-pinnate to 3-foliolate or simple; stipules sheathing petiole margins with conspicuous, persistent or caducous stipular wings; leaflets glabrous to pubescent with simple hairs, crenate to serrate to dentate at margin, teeth with small glandular apex, lower surface usually with specialized multicellular, stellate or globular caducous \"pearl\" glands. Inflorescences paniculate, often corymbiform, terminal or axillary, erect or pendulous. Flowers hermaphroditic, (4 or)5-merous. Calyx campanulate with triangular lobes and glandular tips. Petals valvate, apically often cucullate, reflexed at anthesis, basally connate, adnate to staminodial tissue and lower portion of floral disk; floral disk tubular, intrastaminal. Stamens 4 or 5, antepetalous, alternating with lobes of floral disk; anthers tetrasporangiate and 2-locular, introrse and sometimes appearing extrorse. Ovary superior but sometimes partly sunken in disk, 2-3(-5)-carpellate but with a secondary septum in each carpel and 4-6(-10)-locular; ovule 1 per locule, anatropous, bitegmic and crassinucellate; style elongate; stigma discoid and capitate. Fruit a berry, rather dry, depressed subglobose, purple, black, or orange. Seeds endotestal; endosperm ruminate with roughly 5 ingrowths; embryo linear. 2n = 24 or 48 (rarely 20, 22, or 28).\r",
      "One genus and ca. 34 species; widespread in tropical and subtropical Asia, extending into the Himalayan region and Australia, two species in Africa and Madagascar; ten species (two endemic) in China."
    ],
    "authors":"Prof. Zhiduan Chen & Jun Wen"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Malvaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10534",
    "knowledge_content":[
      "Herbs, shrubs, or less often trees; indumentum usually with peltate scales or stellate hairs. Leaves alternate, stipulate, petiolate; leaf blade usually palmately veined, entire or various lobed. Flowers solitary, less often in small cymes or clusters, axillary or subterminal, often aggregated into terminal racemes or panicles, usually conspicuous, actinomorphic, usually bisexual (unisexual in Kydia). Epicalyx often present, forming an involucre around calyx, 3- to many lobed. Sepals 5, valvate, free or connate. Petals 5, free, contorted, or imbricate, basally adnate to base of filament tube. Stamens usually very many, filaments connate into tube; anthers 1-celled. Pollen spiny. Ovary superior, with 2-25 carpels, often separating from one another and from axis; ovules 1 to many per locule; style as many or 2 × as many as pistils, apex branched or capitate. Fruit a loculicidal capsule or a schizocarp, separating into individual mericarps, rarely berrylike when mature (Malvaviscus); carpels sometimes with an endoglossum (a crosswise projection from back wall of carpel to make it almost completely septate. Seeds often reniform, glabrous or hairy, sometimes conspicuously so.\r",
      "About 100 genera and ca. 1000 species: tropical and temperate regions of N and S Hemisphere; 19 genera (four introduced) and 81 species (24 endemic, 16 introduced) in China.",
      "Molecular studies have shown that the members of the Bombacaceae, Malvaceae, Sterculiaceae, and Tiliaceae form a very well-defined monophyletic group that is divided into ten also rather well-defined clades, only two of which correspond to the traditional families Bombacaceae and Malvaceae. Some of the remaining groups are included entirely within either of the remaining families but others cut across the traditional divide between the Sterculiaceae and Tiliaceae. A majority of authors, most notably Bayer and Kubitzki (Fam. Gen. Vasc. Pl. 5: 225-311. 2003), has favored including everything within a greatly enlarged Malvaceae, and treating the individual clades as subfamilies. The alternative view is that the individual clades should be treated as a series of ten families: Bombacaceae (Bombacoideae), Brownlowiaceae (Brownlowioideae), Byttneriaceae (Byttnerioideae), Durionaceae (Durionoideae), Helicteraceae (Helicteroideae), Malvaceae (Malvoideae), Pentapetaceae (Dombeyoideae), Sparrmanniaceae (Grewioideae), Sterculiaceae (Sterculioideae), and Tiliaceae (Tilioideae) (Cheek in Heywood et al., Fl. Pl. Fam. World. 201-202. 2007). For the present treatment, we prefer to retain the familiar, traditional four families, so as to maintain continuity with the treatments in FRPS, and to await a consensus on the two alternative strategies for dealing with the very widely accepted clades.The traditional Malvaceae coincides exactly with one of the major clades. The only possible problem is the relationship with the Bombacaceae, which also has primarily 1-loculed anthers, and some authorities have suggested that the Bombacaceae should be included within the Malvaceae.Members of the Malvaceae are important as fiber crops (particularly cotton, Gossypium). Young leaves of many species can be used as vegetables, and species of Abelmoschus and Hibiscus are grown as minor food crops. Many species have attractive flowers and an ever-increasing selection is grown as ornamentals. Several have been cultivated for a very long time, particularly species of Hibiscus, and some of these are not known in the wild.Feng Kuo-mei. 1984. Malvaceae. In: Feng Kuo-mei, ed., Fl. Reipubl. Popularis Sin. 49(2): 1-102.",
      "Fruit a loculicidal capsule; ovary with 3-5(or 10) fused carpels; style branches as many as ovary locules; filament tube with anthers inserted along length, apex 5-toothed or truncate, very rarely with anthers",
      "Fruit a schizocarp, sometimes berrylike (Malvaviscus), carpels separating into separate mericarps; filament tube with anthers inserted along length or only at apex",
      "Epicalyx lobes 10-11, very slender; style branches 6-10; capsule valves both loculicidal and septicidal, falling off at maturity; seeds 1 per locule.",
      "Epicalyx lobes 4, leaflike; style with 10 sessile stigmas; capsule valves loculicidal only, persistent; seeds several per locule.",
      "Style branched; epicalyx 5-12(-20)-lobed, rarely absent (Hibiscus lobatus); seeds reniform, rarely globose",
      "Calyx splitting asymmetrically at anthesis, caducous; capsule long and sharp-angled; seeds glabrous and smooth.",
      "Calyx symmetrically 5-lobed or 5-toothed, persistent; capsule usually cylindrical to globose, rarely winged (H. yunnanensis); seeds hairy or glandular verrucose.",
      "Herbs or shrubs, usually conspicuously gland-dotted; epicalyx lobes 2-5 cm, triangular to ovate-cordate in outline, persistent.",
      "Filament tube with anthers inserted along sides, apex 5-dentate or truncate; style branches ca. 2 × as many as carpels",
      "Epicalyx 7-12-lobed; petals 2.5-5 cm, crimson red; mature fruit smooth, berrylike, breaking up into mericarps when dry.",
      "Mature mericarps not swollen, apex rounded, acute, or 2-fid, wall leathery; petals usually more than 1 cm (ca. 0.6 cm in A. guineense var. forrestii).",
      "Fruit dehiscent at least when old, epicalyx lobes not spreading; carpels (5-)8-25; herbs or subshrubs, 0.25-3 m",
      "Panicles 20-30-flowered; flowers unisexual; petals reddish or light purple; style branches 3; fruit dehiscent.",
      "Panicles 2-5-flowered; flowers bisexual; petals white or yellow; style branches 2; fruit indehiscent."
    ],
    "authors":"Ya Tang, Michael G. Gilbert & Laurence J. Dorr"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Ochnaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10620",
    "knowledge_content":[
      "Trees and shrubs, rarely herbs. Leaves alternate, simple, rarely pinnately compound, petiolate; stipules entire or sometimes lacerate, persistent or caducous; leaf blade margin dentate, serrate or rarely entire; veins pinnate. Inflorescences terminal or axillary, cymose or racemose, rarely 1-flowered. Flowers generally bisexual, actinomorphic or more rarely zygomorphic, bracteate; pedicels articulated. Sepals (2-4)5(10-15), free or more rarely united, imbricate or valvate. Petals (3-)5(-8), mostly free, clawed to sessile, contorted or imbricate. Stamens 5-10 or numerous; filaments generally free and persistent, or anthers sessile; anthers basifixed, longitudinally dehiscent or poricidal; staminodes present or not, sometimes persistent, awl-shaped, spatulate, or petaloid, sometimes connected into a tube. Gynoecium (2 or)3-5(-15)-carpellate, gynophore present or rarely absent; ovary superior, entire or deeply lobed, generally long styled; placentation basal, axile or parietal, rarely laminar; ovules 1 or 2 or numerous per locule; stigma entire or sometimes shortly divided at apex. Fruit fleshy or non-fleshy, generally a septicidal capsule, rarely a nut with accrescent sepals or a drupe, or separating into up to 15 blackish drupelets on a colored accrescent receptacle. Seeds endospermic or non-endospermic, winged or not; germination phanerocotylar or cryptocotylar; embryo usually straight, more rarely curved.\r",
      "About 27 genera and ca. 500 species: tropical zones, mainly in the Neotropics; three genera and four species (one endemic) in China.",
      "Stipules lacerate, more or less persistent; sepals not enclosing mature floral bud, margins ciliate-glandular; stamens 5, anthers longitudinally dehiscent, staminodes numerous; ovary 3-carpellate, entire, 1-locular, ovules numerous; fruit a septicidal capsule.",
      "Stipules entire, soon deciduous; sepals completely enclosing floral bud, margins entire; stamens 10 or numerous, anthers poricidal, staminodes absent; ovary deeply lobed, 5-15-locular, ovule 1 per locule; fruit separating into drupelets on an accrescent receptacle",
      "Stamens numerous, 2- or more whorled, filaments conspicuous; stigma slightly lobed; secondary veins not joining in a submarginal vein.",
      "Stamens 10, 1-whorled, anthers sessile; stigma punctiform; secondary veins joining in a conspicuous submarginal vein."
    ],
    "authors":"Zhixiang Zhang & Maria do Carmo E. Amaral"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Pentaphylacaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10662",
    "knowledge_content":[
      "Shrubs or trees, evergreen. Stipules persistent. Leaves simple, alternate. Flowers axillary, bisexual, actinomorphic, arranged into pseudospikes or pseudoracemes along branchlets below apex. Bracteoles 2, persistent, close to calyx. Sepals 5, persistent, unequal, imbricate. Petals 5, white, imbricate in bud, basally slightly connate. Stamens 5, inflexed in bud, alternate with petals, shorter than petals; anthers small, 2-celled, dehiscing by apical pores. Ovary superior, 5-loculed; ovules 2 per locule, collateral, pendulous from locule apex; style simple, apically 5-lobed. Capsule 5-loculed, loculicidal. Seeds 2 per locule; embryo U-shaped; endosperm very thin.\r",
      "This family is sometimes included in the subfamily Ternstroemioideae within the Theaceae.Ming Tien lu. 1980. Pentaphylacaceae. In: Cheng Mien & Ming Tien lu, eds., Fl. Reipubl. Popularis Sin. 45(1): 135-138."
    ],
    "authors":"Tianlu Min & Bruce Bartholomew"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Rhamnaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10763",
    "knowledge_content":[
      "Deciduous or evergreen, often thorny trees, shrubs, woody climbers, or lianas, rarely herbs. Leaves simple, petiolate, alternate or opposite, pinnately veined or 3-5-veined, entire to serrate, sometimes much reduced; stipules small, caducous or persistent, sometimes transformed into spines. Flowers yellowish to greenish, rarely brightly colored, small, bisexual or unisexual, rarely polygamous, (4 or)5-merous, hypogynous to epigynous, in mostly axillary, sessile or pedunculate cymes, or reduced to few in fascicles. Calyx tube patelliform or hemispherical to tubular, sometimes absent, at rim with calyx, corolla, and stamens; sepals 4 or 5, valvate in bud, triangular, erect or ± recurved during anthesis, adaxially often distinctly keeled, alternate with petals. Petals 4 or 5, rarely absent, usually smaller than sepals, concave or hooded, rarely nearly flat, often shortly clawed. Stamens 4 or 5, antepetalous and often ± enclosed by petals; filaments thin, adnate to bases of petals; anthers minute, versatile or not, 2(or 4)-celled, dehiscing by longitudinal slits, usually introrse. Disk intrastaminal, nectariferous, thin to ± fleshy, entire or lobed, glabrous or rarely pubescent, free from ovary or tightly surrounding it, or adnate to calyx tube. Ovary superior to inferior, (1 or)2-4-loculed, with 1(or 2) ovules per locule; ovules anatropous, basal and erect; styles simple or ± deeply 3-lobed or 3-cleft. Fruit either an indehiscent, rarely explosively dehiscent, sometimes winged, schizocarpic capsule, or a ± fleshy drupe with 1-4 indehiscent, rarely dehiscent, pyrenes (stones). Seeds with thin, oily albumen, sometimes exalbuminous; embryo large, oily, straight or rarely bent.\r",
      "About 50 genera and more than 900 species: almost cosmopolitan, mainly in subtropical to tropical areas; 13 genera and 137 species (82 endemic, one introduced) in China.",
      "Former classifications usually placed Rhamnaceae in the Rhamnales, together with Vitaceae and Leeaceae (Suessenguth in Engler & Prantl, Nat. Pflanzenfam., ed. 2, 20d. 1953), or together with Elaeagnaceae (Thorne, Bot. Rev. 58: 225-348. 1992). Orders such as Celastrales, Urticales, and Euphorbiales have often been considered as closely related groups. Recent analyses of DNA sequences strongly supported including the family in the Rosales, beside the closest relatives Barbeyaceae and Dirachmaceae (see Angiosperm Phylogeny Group II, Bot. J. Linn. Soc. 141: 399-436. 2003). Suessenguth (loc. cit.) grouped the family into five tribes, mainly characterized by fruit characters. Richardson et al. (Kew Bull. 55: 311-340. 2000; Amer. J. Bot. 87: 1309-1324. 2000) revised this tribal classification on the basis of a phylogenetic analysis using rbcL and trnL-F sequences of the plastid genome. Now 11 tribes are recognized, of which four are represented in the Flora area.Microrhamnus bodinieri H. Léveillé (Fl. Kouy-Tchéou, 341. 1914-1915) is a synonym of Nyssa sinensis Oliver in the Nyssaceae (see Fl. China 13: 302. 2007).The bark, leaves, and fruit of several species of Rhamnus have been used as laxatives, notably R. cathartica and R. frangula. Diverse Old World species of Rhamnus provide yellow and green dyes as well as drugs. Timber of Alphitonia, Colubrina, Hovenia, and Ziziphus species is used for construction, fine furniture, carving, lathework, and musical instruments. Many Ziziphus species yield edible fruit; among them, Z. jujuba (Chinese jujube) and Z. mauritiana (Indian jujube) are cultivated on a commercial scale. Hovenia dulcis is also grown for its edible, fleshy inflorescence stalks. Species of Hovenia, Paliurus, and Rhamnus are cultivated as ornamentals.Chen Yi-ling & Chou Pan-kai. 1982. Rhamnaceae. In: Chen Yi-ling, ed., Fl. Reipubl. Popularis Sin. 48(1): i-vi, 1-169.",
      "Ovary 3-loculed; fruit a capsule with longitudinal wings; tendrils present; endosperm present (Gouanieae).",
      "Ovary 2-loculed; fruit a samara with apical appendages; tendrils absent; endosperm absent (Ventilagineae).",
      "Petals deeply obcordate or bilobed; flowers always bisexual; plants mostly armed, but seeds never furrowed."
    ],
    "authors":"Yilin Chen & Carsten Schirarend"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Sabiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10783",
    "knowledge_content":[
      "Trees, shrubs, or woody climbers, deciduous or evergreen. Leaves alternate, simple or odd pinnately compound; stipules absent. Inflorescences axillary or terminal, usually in cymes or panicles, or sometimes solitary axillary flowers. Flowers bisexual or polygamous-dioecious, actinomorphic or zygomorphic, small or minute. Sepals (4 or)5[or 3, 6, or 7], free or united at base, imbricate, equal or unequal. Petals (4 or)5(or 6)[or 7], imbricate, equal or inner 2 much smaller than outer 3. Stamens (4 or)5, opposite petals, attached to petals at base or free, all fertile or outer 3 infertile; anthers 2-celled, with narrow connectives or with thick cupular connectives. Disk cupular or annular, small. Ovary superior, sessile, 2(or 3)-loculed, with 1 or 2 half-anatropous ovules per locule. Fruit a drupe or schizocarp, consisting of 1 or 2 mature carpels, 1(or 2)-loculed, indehiscent. Seed 1; endosperm (if present) reduced to a very thin layer; cotyledons duplicate, radicle curved.\r",
      "Three genera and ca. 80 species: tropical and E Asia, Central and South America; two genera and 46 species (17 endemic) in China.",
      "Wu Young-fen & Law Yuh-wu. 1985. Sabiaceae. In: Law Yuh-wu & Lo Hsien-shui, eds., Fl. Reipubl. Popularis Sin. 47(1): 72-132.This family was recently treated by Kubitzki (Fam. Gen. Vasc. Pl. 9: 413-417. 2007).",
      "Woody climbers or scandent shrubs; stamens 5, fertile, equal; flowers actinomorphic, solitary or in few flowered axillary cymes or panicles; leaves simple.",
      "Trees or shrubs, erect; stamens 2, staminodes 3; flowers zygomorphic, in usually large, many flowered, terminal panicles; leaves compound or simple."
    ],
    "authors":"Lixiu Guo & Anthony R. Brach"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Sapindaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10792",
    "knowledge_content":[
      "Trees or shrubs (or woody vines with tendrils in Cardiospermum and allied genera), rarely herbaceous climbers. Indumentum usually of simple hairs, often glandular on young parts, buds, and inflorescences. Leaves alternate, usually estipulate; leaf blade pinnate or digitate, rarely simple; leaflets alternate to opposite, entire or dentate to serrate. Inflorescence a terminal or axillary thyrse; bracts and bracteoles small. Flowers unisexual, rarely polygamous or bisexual, actinomorphic or zygomorphic, usually small. Sepals 4 or 5(or 6), equal or unequal, free or connate at base, imbricate or valvate. Petals 4 or 5(or 6), sometimes absent, free, imbricate, usually clawed, often with scales or hair-tufted basal appendages. Disk conspicuous, fleshy, complete or interrupted, lobed or annular, rarely absent. Stamens 5-10(-74), usually 8, rarely numerous, variously inserted but usually within disk, often exserted in male flowers; filaments free, rarely connate; anthers dorsifixed, longitudinally dehiscent, introrse; staminodes sometimes present in carpellate flowers, but filaments shorter and anthers with a thick wall, indehiscent. Ovary superior, (1-)3(or 4)-loculed; ovules 1 or 2(or several) per locule, placentation axile, rarely parietal, anatropous, campylotropous, or amphitropous; style usually apical (terminal), semigynobasic in Allophylus [gynobasic in Deinbollia Schumacher & Thonning]; stigma entire or 2 or 3(or 4)-lobed, usually rudimentary in male flowers. Fruit a loculicidal capsule, berry, or drupe, or consisting of 2 or 3 samaras, often 1-seeded and 1-loculed by abortion. Seeds 1(or 2 or more) per locule; testa black or brown, hard, often with a conspicuous fleshy aril or sarcotesta; embryo curved, plicate, or twisted, oily and starchy; endosperm usually absent. 2n = 20-36.\r",
      "One hundred thirty-five genera and ca. 1500 species: widely distributed in tropical and subtropical regions, especially well represented in tropical SE Asia; 21 genera (one endemic) and 52 species (16 endemic, one introduced) in China.",
      "There is some variation in the circumscription of Sapindaceae in taxonomic treatments, particularly with regard to the inclusion of genera from the closely related, predominately temperate families Aceraceae and Hippocastanaceae. Several studies including Müller and Leenhouts (in Ferguson & Müller, Evolutionary Significance Exine: 407-445. 1976), and more recently those based on molecular data (Stevens, Angiosperm Phylogeny Website, 2001 onward; Harrington et al., Syst. Bot. 30: 366-382. 2005), supported the recognition of a broadly defined Sapindaceae incorporating Aceraceae and Hippocastanaceae. Harrington et al. (loc. cit.) proposed four subfamilies or clades, comprising Sapindoideae (including Koelreuteria and Ungnadia Endlicher), Dodonaeoideae, Hippocastanoideae (including taxa previously referred to Aceraceae and Hippocastanaceae, plus Handeliodendron), and a monotypic \"Xanthoceratoideae\". Within Hippocastanoideae, Acer Linnaeus and Dipteronia Oliver comprise a monophyletic group and are treated in this Flora as Aceraceae. Similarly, Aesculus Linnaeus, Billia Peyritsch, and the Chinese endemic Handeliodendron Rehder form a monophyletic group and are treated here as Hippocastanaceae. There is some support for \"Xanthoceratoideae\" being the first lineage to diverge within the broadly defined Sapindaceae assemblage; consequently, Xanthoceras is treated separately from genera in Sapindoideae and Dodonaeoideae in the following account of Sapindaceae s.s. The sequence of genera reflects Müller and Leenhouts (loc. cit.) as modified by recent analyses based on molecular and morphological data, rather than following the order developed by Radlkofer (Sitzungsber. Math.-Phys. Cl. Königl. Bayer. Akad. Wiss. München 20: 105-379. 1890; and in Engler, Pflanzenreich 98a-h(IV. 165): 1-1539. 1931-1934), which was previously followed in FRPS.The main economic uses of this family include (1) timber: Amesiodendron chinense, Dimocarpus longan, D. confinis, Litchi chinensis, Pavieasia kwangsiensis, and Pometia pinnata; (2) fruit: Dimocarpus longan, Litchi chinensis, and Nephelium lappaceum; (3) medicine: Dimocarpus longan (arillode), Litchi chinensis (seeds), and Sapindus saponaria (roots); (4) oil: Amesiodendron chinense, Delavaya toxocarpa, and Xanthoceras sorbifolium. Saponins occur widely in the family, commonly used as a fish poison and for their detergent properties.Lo Hsien-shui & Chen Te-chao. 1985. Sapindaceae (excluding Handeliodendron). In: Law Yuh-wu & Lo Hsien-shui, eds., Fl. Reipubl. Popularis Sin. 47(1): 1-72.",
      "Leaves pinnate, sessile, first pair leaflets inserted at base of leaf axis like a pair of stipules; fruit without spines and tubercles",
      "Leaves paripinnate, leaflets serrate; fruit lobed into 2 schizocarps, usually only 1 developed, longer than 2 cm.",
      "Testa osseous, hilum linear; petals 4 or 5, rarely 6, with 2 earlike scales or 1 large scale; deciduous trees.",
      "Seeds with arillode; fruit parted into schizocarps, usually only 1 or 2 developed, abaxially usually with various tubercles or spines, glabrous or sparsely hairy",
      "Sepals imbricate; leaflets abaxially with naked glands in lateral vein axils, if without naked glands then inflorescences with stellate hairs.",
      "Leaves digitate, leaflets 3; exocarp leathery or nearly woody; seeds without arillode; petals 5, with scales.",
      "Fruit pearlike or clavate; stamens 8; ovary 3-loculed; leaflets with naked glands in lateral vein axils.",
      "Fruit transversely ellipsoid or subglobose; stamens 5; ovary 2-loculed; leaflets without naked glands in lateral vein axils.",
      "Fruit with dense, short spines, 1-loculed, 1-seeded; petals ca. 1 mm, white, scaly; disk lobes without appendages; evergreen trees.",
      "Fruit without spines, 3-loculed, with several seeds per locule; petals ca. 1.7 cm, base red or yellow, without scales; disk lobes with appendages; deciduous shrubs or small trees."
    ],
    "authors":"Nianhe Xia & Paul A. Gadek"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Sladeniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20287",
    "knowledge_content":[
      "Trees, evergreen. Stipules absent. Leaves simple, spiral, petiolate; leaf blade secondary veins pinnate, margin serrate or entire. Inflorescences axillary, dichasial cymes; bracts lanceolate, caducous. Flowers bisexual, pedicellate; bracteoles 2, caducous, inserted at base of calyx. Sepals 5, persistent, imbricate, scarious. Petals 5, white, basally slightly connate. Stamens (8-)10(-13), in 1 whorl, inserted at base of corolla; filaments short, basally thickened, apically constricted and introrsely flexed; anthers introrse, basifixed, pilose, basally sagittate, apically 2-cleft, dehiscing by apical pores; pollen grains uniform, tricolpate. Ovary superior, conic, glabrous, 3-loculed, apically tapering into an elongated slightly 3-parted style; ovules 2 per locule, pendulous, anatropous. Fruit grayish, long conic to flask-shaped, with 8-10 vertical striations, 3-loculed with 2 seeds per locule. Seeds suspended from apex, elongately subtriangular when fresh, irregularly winged when dry; testa transparent, finely reticulate; embryo elongate; endosperm absent.\r",
      "The E African genus Ficalhoa Hiern is sometimes included in Sladeniaceae.Wang Yu-sheng. 1984. Sladenia. In: Feng Kuo-mei, ed., Fl. Reipubl. Popularis Sin. 49(2): 302."
    ],
    "authors":"Tianlu Min & Bruce Bartholomew"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Sterculiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10850",
    "knowledge_content":[
      "Trees or shrubs, rarely herbs or liana; young growth usually stellately hairy; bark mucilaginous and rich in fibers. Leaves alternate; stipules usually present caducous; leaf blade simple, rarely palmately compound, entire, serrate, or parted. Inflorescence axillary or rarely terminal, paniculate, corymbose, racemose, or cymose, rarely solitary. Flowers unisexual, bisexual or polygamous. Sepals (3-)5, ± connate, rarely free, valvate. Petals 5 or lacking, free or adnate to base of androecium, convolutely imbricate. Androgynophore usually present; filaments usually connate into a single tube; staminodes 5, tonguelike or filiform, opposite to sepals, sometimes lacking; anthers 2-celled, longitudinally dehiscent. Pistil consisting of 2-5(or 10-12) ± connate carpels, or a single carpel; ovary superior, 2-5(or 10-12)-loculed; ovules 2 or more per locule; style 1 or as many as carpels. Fruit usually a capsule or follicle, dehiscent or indehiscent, very rarely a berry or nut. Seeds with abundant endosperm or endosperm lacking; embryo straight or curved.\r",
      "About 68 genera and ca. 1100 species: tropics and subtropics of both hemispheres, a few in temperate regions; 19 genera (two introduced) and 90 species (39 endemic, three introduced) in China.",
      "The Chinese genera fit into four distinct clades which can be treated as subfamilies of an enlarged Malvaceae or as distinct families. These are Sterculioideae\/Sterculiaceae s.s. (genera 1-4), Helicteroideae\/Helicteraceae (genera 5 and 6), Byttnerioideae\/Byttneriaceae (genera 7-13), and Dombeyoideae\/Pentapetaceae (genera 14-19).The record of Hildegardia Schott & Endlicher in China (Bayer & Kubitzki, Fam. Gen. Vasc. Pl. 5: 265. 2003) was based on H. major (W. W. Smith) Kostermans, which is here included within Firmiana.Hsue Hsiang-hao. 1984. Sterculiaceae. In: Feng Kuo-mei, ed., Fl. Reipubl. Popularis Sin. 49(2): 112-189.",
      "Flowers without petals, unisexual or polygamous; fruit apocarpous with separate follicles (Sterculioideae)",
      "Follicles not dehiscent, with wing or prominent keel, 1-seeded; leaf blade abaxially with dense silver-white or yellow-brown scales.",
      "Capsule more or less woody, never membranous, not inflated; seeds 2 or more in each cell (Helicteroideae)",
      "Trees or large shrubs, 6-25 m tall; seeds 1 or 2 per locule, with obvious membranous wing, more than 20 mm; inflorescences terminal; anthers sessile on filament tube or nearly so.",
      "Shrubs or subshrubs, 0.45-2 m tall; seeds many per locule, without wing, less than 4 mm; inflorescences axillary; anthers with distinct free filaments.",
      "Trees or shrubs; calyx 10-30 mm; stamens 40-50; capsule 3-5 cm, woody or thickly leathery (Dombeyoideae)",
      "Flowers cauliflorous, in fascicles on trunk or bases of main branches; fruit fleshy, not dehiscent; seeds without wing (Byttnerioideae).",
      "Stamens (10 or)15(or 20), in 5 fascicles of (2 or)3(or 4), alternating with staminodes (mostly Dombeyoideae)",
      "Lianas; staminodes obtuse at tip, lower half connate into tube; capsule with robust and rigid spines, loculicidal into 5 valves.",
      "Capsule 5-winged; staminodes broadly spatulate, emarginate and with grooves at tip, hairy; ovules many per cell (Byttnerioideae)."
    ],
    "authors":"Ya Tang, Michael G. Gilbert & Laurence J. Dorr"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Theaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10882",
    "knowledge_content":[
      "Shrubs or trees, evergreen or rarely deciduous, usually bisexual, rarely dioecious (Eurya) or androdioecious (Ternstroemia). Stipules absent. Leaves simple, alternate, petiolate or rarely sessile; leaf blade secondary veins pinnate, margin usually serrate or rarely entire. Flowers axillary or subterminal, solitary or sometimes to 3(-10 or more) in a cluster or raceme, pedicellate or subsessile. Bracteoles 2-8 or rarely more, persistent or caducous, sometimes undifferentiated from sepals. Sepals 5(or 6) or rarely more, persistent. Corolla white, red, or yellow; petals 5 or rarely more, basally connate or rarely distinct, adnate to androecium. Stamens numerous, in 1-6 whorls; outer filaments basally ± connate; anthers dorsifixed or basifixed, 2-loculed, laterally and longitudinally dehiscent. Gynoecium 3-5-carpellate. Carpels connate or rarely incompletely connate to nearly distinct. Ovary superior, rarely half inferior, 3-5-loculed, placentation axile or rarely nearly basal; ovules 2-5(to ca. 100) or more per locule; styles distinct to basally connate, rarely completely united. Fruit a loculicidal capsule or indehiscent and drupaceous or baccate, with 1 to many seeds per locule; pericarp woody, leathery, or fleshy; columella persistent or ± degenerating. Seeds globose, semiglobose, compressed oblong, ovoid, or reniform, winged or wingless; testa bony, leathery, or sometimes with a fleshy red outer layer or sarcotesta (in Anneslea and Ternstroemia), smooth or honeycombed; hilum umbilicate or linear; endosperm present or absent; embryo large or small; cotyledons fleshy or thin.\r",
      "About 19 genera and 600 species: tropical and subtropical Africa, tropical America, E, S, and SE Asia, SE North America, Pacific islands; 12 genera (two endemic) and 274 species (204 endemic) in China.",
      "The greatest species diversity of Theaceae is in S China and adjacent SE Asia.The two subfamilies of Theaceae used here are sometimes treated as separate families (Theaceae and Ternstroemiaceae).Chang Hungta & Ren Shanxiang. 1998. Theaceae (Theoideae). In: Chang Hungta, ed., Fl. Reipubl. Popularis Sin. 49(3): ii-xiii, 1-281; Ling Laikuan. 1998. Theaceae (Ternstroemioideae). Fl. Reipubl. Popularis Sin. 50(1): ii-vi, 1-213.\r",
      "Shrubs. Branchlets slender; terminal buds glabrous. Petiole 3–8 mm, glabrous; leaf blade narrowly lanceolate, 3.5–7.5 × 0.4–0.7 cm, both surfaces glabrous, midvein elevated on both surfaces, secondary veins 6–9 on each side of midvein, base narrowly cuneate, margin entire and revolute, apex acuminate and with a black mucro. Flowers solitary. Pedicel 2.4–2.7 cm; bracteoles 2, ovate, ca. 2 mm. Sepals ovate, 3–4 × 2–3 mm, margin ciliate, apex obtuse. Petals white, obovate-oblong, 9–19 × 5–7 mm, apex acute. Stamens ca. 25, in 3 whorls, 6–7 mm; filaments 4–5 mm; anthers ca. 2 mm, with filiform trichomes, apex mucronate. Ovary ovoid-globose, glabrous; style ca. 5.5 mm, simple, glabrous. Fruit and seeds unknown. Fl. Apr.\r",
      "The stamens in three whorls and a simple style place this species in Adinandra rather than in Cleyera. However, the seeds of the two genera are quite different and need to be examined when appropriate material becomes available.",
      "Flowers bisexual, 0.8-12 cm in diam.; stamens numerous, in 2-6 whorls; anthers dorsifixed, ovate, connective not exserted; fruit usually capsular, dehiscent, or rarely drupaceous and indehiscent (in some Pyrenaria).",
      "Flowers bisexual or unisexual, less than 2 cm in diam.; stamens in (1 or)2 whorls (1-5 whorls in Adinandra); anthers basifixed, oblong, connective exserted; fruit baccate, indehiscent, or sometimes dehiscent (in Anneslea and Ternstroemia)."
    ],
    "authors":"Tianlu Min & Bruce Bartholomew"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Tiliaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10898",
    "knowledge_content":[
      "Trees, shrubs, or herbs. Leaves simple, alternate or rarely opposite, basally veined, entire or serrate, sometimes lobed; stipule, when present, caducous or persistent. Inflorescences cymose or cymose-paniculate. Flowers bisexual or unisexual (plants dioecious), actinomorphic. Bracts caducous or sometimes large and persistent. Sepals (4 or)5, free or sometimes basally connate, valvate. Petals as many as sepals, sometimes absent, free, usually glandular on adaxial surface. Androgynophore present or absent. Stamens numerous, rarely 5, free or connate into fascicles at base; anthers 2-loculed, dehiscence longitudinal or apical; petaloid staminodes alternating with petals or absent. Ovary superior, 2-6-loculed, sometimes more; ovules 1 to many per locule; placentation axile; style simple, sometimes free; stigma acute or peltate, usually lobed. Fruit usually a drupe, capsule, or schizocarp, sometimes a berry or samara, 2-10-loculed. Seeds without aril; endosperm copious; embryo erect; cotyledons flat.\r",
      "About 52 genera and ca. 500 species: primarily in tropical and subtropical areas; 11 genera and 70 species (32 endemic) in China.",
      "Molecular data have shown that the members of the Tiliaceae as here defined fall clearly into four clades that can either be treated as subfamilies within an enlarged Malvaceae or as families in their own right. In this view the Tiliaceae\/Tilioideae is restricted to Tilia and Craigia, along with the Central American Mortoniodendron Standley & Steyermark; Colona, Corchorus, Grewia, Microcos, and Triumfetta are placed in the Sparrmanniaceae\/Grewioideae; Berrya and Diplodiscus are placed in the Brownlowiaceae\/Brownlowioideae; and Burretiodendron and Excentrodendron form a basal group of uncertain placement, possibly most closely allied to the Pentapetaceae\/Dombeyoideae which includes mostly genera here placed in the Sterculiaceae.Plagiopteron Griffith, included in the Tiliaceae in FRPS (49(1): 48-50. 1989), is now regarded as either a member of the Celastraceae or a separate family, Plagiopteraceae (see Fl. China 11).Chang Hung-ta & Miau Ru-huai. 1989. Tiliaceae. In: Chang Hung-ta, ed., Fl. Reipubl. Popularis Sin. 49(1): 47-123.",
      "Each inflorescence with a single large, persistent, band-shaped bract partially connate with peduncle."
    ],
    "authors":"Ya Tang, Michael G. Gilbert & Laurence J. Dorr"
  },
  {
    "group_title":"Hippocastanaceae through Theaceae",
    "family":"Vitaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10946",
    "knowledge_content":[
      "Woody climbers, sometimes vines, rarely small succulent trees, hermaphroditic or polygamo-monoecious to polygamo-dioecious. Stems unarmed, sometimes with conspicuous lenticels, or bark sometimes shredding (in most species of Vitis); branches often swollen at 3-7-lacunar nodes; pith continuous or interrupted by diaphragms at nodes; tendrils simple, bifurcate to trifurcate, or 4-12-branched (in Parthenocissus), usually leaf-opposed, rarely tendrils absent. Raphide sacs present in parenchymatous tissues. Leaves simple, lobed or unlobed, or digitately or pedately compound to 1-3-pinnately compound, alternate, distichous, variously toothed, commonly with multicellular, stalked, caducous spherical structures known as \"pearl\" glands; stipules 2 or rarely absent, often caducous. Flowers small, with prophylls, in panicles, corymbs, or rarely spikes, often leaf-opposite, pseudo-terminal, or axillary (in Cayratia and Tetrastigma), actinomorphic, hypogynous, 4- or 5(-7 as in Rhoicissus)-merous. Calyx with 4 or 5(-7) small teeth or lobes or a continuous ring. Petals valvate, 4 or 5(-7), free or basally connate, or distally connate forming a calyptra (e.g., in Vitis). Stamens 4 or 5(-7), antepetalous; anthers introrse, dehiscing longitudinally, tetrasporangiate or rarely bisporangiate. Floral disk intrastaminal, ring-shaped, cupular, or gland-shaped. Ovary superior, 2-loculed; ovules 2 per locule; placentation axile, appearing nearly basal, apotropous or anatropous, bitegmic, crassinucellar; style simple, connate; stigma discoid or capitate, rarely 4-lobed (Tetrastigma), not papillate. Fruit a berry, 1-4-seeded. Seeds endotestal, with an abaxial chalazal knot and an adaxial raphe with 2 furrows, one on each side; embryo straight, small; endosperm oily, proteinaceous, copious, ruminate.\r",
      "About 14 genera and ca. 900 species: worldwide, but mostly in tropical and subtropical regions; eight genera and 146 species (87 endemic, two introduced) in China.",
      "Li Chaoluan. 1998. Vitaceae (excluding Leea). In: Li Chaoluan, ed., Fl. Reipubl. Popularis Sin. 48(2): ii-vii, 1-3, 12-208.The family is important for grapes, wine, and raisins (especially Vitis vinifera, and several other species and hybrids of Vitis). There are a few ornamental climbers in the genera Ampelopsis, Cissus, Parthenocissus, and Tetrastigma, of which Parthenocissus tricuspidata of China and Japan and P. quinquefolia of eastern North America are well-known examples. Some plants (e.g., Ampelopsis japonica, Cissus quadrangularis, and Tetrastigma hemsleyanum) are highly regarded medicines.",
      "Disk inconspicuous; inflorescence a compound dichasium, without reduced inflorescence appearing on tendrils.",
      "Disk well developed, 5-lobed; inflorescence a corymbose cyme, reduced inflorescence often appearing at tip of tendrils.",
      "Inflorescence usually axillary or pseudo-axillary, rarely leaf-opposed; seeds with 1 or 2 conspicuous ventral cavities nearly as long as seeds",
      "Ampelocissus  PlanchonAmpelopsis  MichauxCayratia  JussieuCissus  LinnaeusParthenocissus  PlanchonTetrastigma  (Miquel) PlanchonVitis  LinnaeusYua  C. L. Li"
    ],
    "authors":"Prof. Zhiduan Chen, Hui Ren & Jun Wen"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Alangiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10022",
    "knowledge_content":[
      "Trees or shrubs, deciduous, sometimes spiny. Leaves alternate, simple, estipulate, bases often oblique. Flowers bisexual, actinomorphic, often bracteate, in axillary cymes. Calyx lobes 4-10, toothlike or obsolete. Petals as many as calyx lobes, valvate, linear to lorate, sometimes basally coherent. Stamens as many as petals or 2-4 × as many, distinct, arising from an enlarged disk; anthers 2-celled, dehiscing longitudinally. Ovary inferior, commonly 1- or rarely 2-loculed; ovule solitary, pendulous; style and stigma simple, or 2- or 3-lobed. Fruit a drupe, crowned with persistent calyx and disk. Seeds 1 or 2, with straight embryo and copious endosperm.\r",
      "One genus and ca. 21 species: tropical and subtropical regions from Africa east to Australia and Fiji; 11 species (four endemic) in China.",
      "Alangiaceae are treated here as separate from the Cornaceae, into which they have sometimes been placed. See the discussion under Cornaceae in Fl. China (14: 206. 2005).Fang Wen-pei, Soong Tze-pu & Su He-yi. 1983. Alangiaceae. In: Fang Wen-pei & Chang Che-yung, eds., Fl. Reipubl. Popularis Sin. 52(2): 160-179."
    ],
    "authors":"Haining Qin & Chamlong Phengklai"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Ancistrocladaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10039",
    "knowledge_content":[
      "Lianas or scandent shrubs climbing by hooked apices of sympodial branches; juvenile growth erect, shrubby, monopodial; plants externally glabrous. Leaves alternate; juvenile leaves crowded in terminal rosettes; adult leaves distributed along stems and clustered terminally on branches; stipules absent or tiny and caducous; petiole absent, though leaves often appearing pseudopetiolate due to long attenuate base of blade; leaf blade simple, entire, both surfaces with sparsely to moderately distributed small pits, each pit containing a single trichome that secretes a waxy substance. Flowers small, bisexual, in extra-axillary or apparently terminal dichotomously branched panicles with higher order branches sometimes becoming racemiform or spiciform, regular except for often unequal sepals. Bracts tiny, subtending axes and pedicels. Sepals (4 or)5, seated on middle or upper part of ovary, imbricate, equal or unequal, accrescent and winglike in fruit. Petals (4 or)5, distinct or slightly connate at base, imbricate, convolute, and\/or intermediate in bud. Stamens 10, in 1 or 2 whorls, equal or 5 somewhat larger than others, or seldom 8 or only 5; filaments equal or unequal in length, somewhat connate at base and adnate to base of petals; anthers basifixed, tetrasporangiate and dithecal, introrse, opening by longitudinal slits. Gynoecium of 3 carpels united to form a compound, 1-loculed ovary; ovary inferior or partially inferior; ovule solitary, basilateral, hemitropous, bitegmic; styles 1 or usually 3, thickened, oblong; stigmas 3. Fruit a nut surrounded by corky hypanthium and crowned by often unequal sepals. Seed with hard, starchy, ruminate endosperm; embryo short, straight.\r",
      "Ku Tsuechih. 1999. Ancistrocladaceae. In: Ku Tsuechih, ed., Fl. Reipubl. Popularis Sin. 52(1): 270-271."
    ],
    "authors":"Yinzheng Wang & Roy E. Gereau"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Araliaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10058",
    "knowledge_content":[
      "Trees or shrubs, sometimes woody vines with aerial roots, rarely perennial herbs, hermaphroditic, andromonoecious or dioecious, often with stellate indumentum or more rarely simple trichomes or bristles, with or without prickles, secretory canals present in most parts. Leaves alternate, rarely opposite (never in Chinese taxa), simple and often palmately lobed, palmately compound, or 1-3-pinnately compound, usually crowded toward apices of branches, base of petiole often broad and sheathing stem, stipules absent or forming a ligule or membranous border of petiole. Inflorescence terminal or pseudo-lateral (by delayed development), umbellate, compound-umbellate, racemose, racemose-umbellate, or racemose-paniculate, ultimate units usually umbels or heads, occasionally racemes or spikes, flowers rarely solitary; bracts usually present, often caducous, rarely foliaceous. Flowers bisexual or unisexual, actinomorphic. Pedicels often jointed below ovary and forming an articulation. Calyx absent or forming a low rim, sometimes undulate or with short teeth. Corolla of (3-)5(-20) petals, free or rarely united, mostly valvate, sometimes imbricate. Stamens usually as many as and alternate with petals, sometimes numerous, distinct, inserted at edge of disk; anthers versatile, introrse, 2-celled (or 4-celled in some non-Chinese taxa), longitudinally dehiscent. Disk epigynous, often fleshy, slightly depressed to rounded or conic, sometimes confluent with styles. Ovary inferior (rarely secondarily superior in some non-Chinese taxa), (1 or)2-10(to many)-carpellate; carpels united, with as many locules; ovules pendulous, 2 per locule, 1 abortive; styles as many as carpels, free or partially united, erect or recurved, or fully united to form a column; stigmas terminal or decurrent on inner face of styles, or sessile on disk, circular to elliptic and radiating. Fruit a drupe or berry, terete or sometimes laterally compressed, occasionally vertically compressed, exocarp fleshy; pyrenes cartilaginous or membranous, often laterally compressed. Seeds 1 per pyrene, embryo small, endosperm uniform or ruminate.\r",
      "About 50 genera and 1350 species: widespread in tropical and subtropical regions of both hemispheres, much less diverse in temperate areas; 23 genera (two endemic, one introduced) and 180 species (82 endemic, seven introduced) in China.",
      "The two endemic genera are Sinopanax and Tetrapanax.Chinese genera of economic importance include Aralia, Eleutherococcus, Heteropanax, Panax, and Tetrapanax (medicinal), Hedera (ornamental), Fatsia and Schefflera (medicinal and ornamental), and Kalopanax (timber).Recent phylogenetic studies (Plunkett and Lowry, Molec. Phylogen. Evol. 19: 259-276. 2001; Wen et al., Syst. Bot. 26: 144-167. 2001; Chandler and Plunkett, Bot. J. Linn. Soc. 144: 123-147. 2004; Mitchell and Wen, Taxon 53: 29-41. 2004; Plunkett et al., S. Afr. J. Bot. 70: 371-381. 2004) have shown that Hydrocotyle Linnaeus belongs to Araliaceae, despite being traditionally included in Apiaceae (see Fl. China 14: 14-18. 2005).Diplopanax Handel-Mazzetti was at one time placed in Araliaceae but is now regarded as a member of Mastixiaceae (see Fl. China 14: 231-232. 2005).Hoo Gin & Tseng Chang-jiang. 1978. Araliaceae. Fl. Reipubl. Popularis Sin. 54: i-ix, 1-210.",
      "Inflorescence developing from specialized floral buds, usually surrounded by numerous persistent bracts at base; plants unarmed.",
      "Inflorescence developing from mixed buds also producing leaves, without persistent bracts at base; plants armed or unarmed.",
      "Pedicels articulate below ovary; ovary 5-8-carpellate; cultivated plants usually with pungent aromatic odor.",
      "Pedicels not articulate below ovary; ovary 2-carpellate; native plants without pungent aromatic odor.",
      "Leaves palmately compound or trifoliolate, never simple, leaflets 3-5, petiole shorter than 12 cm, petiolules 0-1 cm; styles distinct or united at base.",
      "Leaves simple (entire or palmately lobed) or palmately compound, leaflets (3 or)4-9(-11), petiole longer than 12 cm, petiolules usually longer than 1.5 cm; styles united into a column.",
      "Ovary (4 or)5-11-carpellate; margin of leaflets usually entire, rarely remotely serrate; branches with long shoots only (short shoots absent).",
      "Ovary 2(-4)-carpellate; margin of leaflets usually serrulate; branches with both short and long shoots (the latter not always preserved on specimens)",
      "Inflorescence a large, corymbose panicle of umbels; petals and stamens 5; ovary 2-carpellate, styles united into a column.",
      "Inflorescence small, a simple or compound panicle of umbels; petals and stamens 4(or 5); ovary 2-4(or 5)-carpellate; styles free at least apically.",
      "Fruit red-yellow at maturity; calyx with 2 spinelike lobes; inflorescence with dense, stiff prickles throughout; shrubs.",
      "Fruit black or bluish black at maturity; calyx 5-toothed; inflorescence glabrous or with scattered to fairly dense prickles; shrubs or trees",
      "Deciduous trees, hermaphroditic; styles united at base, with free arms; endosperm smooth; leaves clustered on short shoots and alternate on long shoots.",
      "Evergreen shrubs or small trees, andromonoecious or hermaphroditic; styles completely united into a column; endosperm ruminate or uniform; short shoots lacking, leaves borne only on long shoots.",
      "Petiole basally pectinate or fimbriate-lacerate; inflorescence trifid, with a central umbel of sterile bacciform flowers (\"pseudo-fruit\").",
      "Petiole basally not pectinate or fimbriate-lacerate; inflorescence a panicle of umbels, or a simple or compound umbel",
      "Leaves entire or 2- or 3(-5)-lobed, margin entire or with scattered irregular teeth; ovary (3-)5-carpellate.",
      "Leaves red or yellow glandular punctate, glabrous, margin entire or with few narrow triangular teeth.",
      "Inflorescences either terminal or axillary; styles completely united into a column; disk conspicuous, convex."
    ],
    "authors":"Qibai Xiang & Porter P. Lowry"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Begoniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10099",
    "knowledge_content":[
      "Perennial succulent herbs, very rarely subshrubs. Stem erect, frequently rhizomatous, or plants tuberous and either acaulescent or shortly stemmed, rarely lianoid or climbing with adventitious roots, or stoloniferous. Leaves simple, rarely palmately compound, alternate or all basal, petiolate, stipules usually deciduous; blade often oblique and asymmetric, rarely symmetric, margin irregularly serrate and divided, occasionally entire, venation usually palmate. Flowers unisexual, plants monoecious, rarely dioecious, (1 or)2-4 to several, rarely numerous in dichotomous cyme, sometimes in panicles, with pedicel and bracts. Staminate flower: tepals 2 or 4 and decussate, usually outer ones larger, inner ones smaller; stamens usually numerous; filaments free or connate at base; anthers 2-celled, apical or lateral. Pistillate flower: tepals 2-5(-10), usually free, rarely connate at base; ovary nodding, pendulous, or ascending, 1-3-, rarely 4-8-loculed; placentae axile or parietal; styles 2 or 3(or more), free or fused at base, forked once or more; stigma turgid, spirally twisted-tortuous or U-shaped, capitate or reniform and setose-papillose. Capsule dry, sometimes berrylike, unequally or subequally 3-winged, rarely wingless and 3- or 4-horned; seeds very numerous, minute, oblong, testa pale brown, reticulate.\r",
      "Two or three genera and more than 1400 species: widely distributed in the tropical and subtropical regions of the world; one genus and 173 species (141 endemic) in China."
    ],
    "authors":"Cuizhi Gu, Ching-I Peng & Nicholas J. Turland"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Bixaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10104",
    "knowledge_content":[
      "Shrubs or small trees. Young branches and leaves with peltate scales. Leaves alternate; stipules small, sheathing bud, fugacious; petiole swollen at base and apex; leaf blade simple, palmately veined. Inflorescence a terminal panicle. Flowers bisexual, actinomorphic. Sepals 5, free, imbricate, with basal, abaxial glands, fugacious. Petals 5, imbricate, large and conspicuous. Stamens many, free or slightly united at base; anthers oblong, with 2 inverted, U-shaped thecae, dehiscing by short, apical slits on bend. Ovary superior, 1-loculed; ovules many on 2 parietal placentas; style slender; stigmas 2-lobed. Fruit a capsule, loculicidally 2-valved, usually spiny. Seeds many; testa red, slightly fleshy; embryo large; cotyledons broad, incurved at apex; endosperm copious.\r",
      "One genus and five species: native to tropical America; one species widely cultivated in tropical regions, including China.",
      "Molecular data suggest that the genus Diegodendron Capuron, endemic to Madagascar, is related to Bixa and could be included within the Bixaceae.Zhang Pengyun & Zhang Yaojia. 1990. Bixaceae. In: Li Hsiwen, ed., Fl. Reipubl. Popularis Sin. 50(2): 180."
    ],
    "authors":"Qiner Yang & Michael G. Gilbert"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Cactaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10141",
    "knowledge_content":[
      "Fleshy perennials, shrubs, trees or vines, terrestrial or epiphytic. Stems jointed, terete, globose, flattened, or fluted, mostly leafless and variously spiny. Leaves alternate, flat or subulate to terete, vestigial, or entirely absent; spines, glochids (easily detached, small, bristlelike spines), and flowers always arising from cushionlike, axillary areoles (modified short shoots). Flowers solitary, sessile, rarely clustered and stalked (in Pereskia), bisexual, rarely unisexual, actinomorphic or occasionally zygomorphic. Receptacle tube (hypanthium or perianth tube) absent or short to elongate, naked or invested with leaflike bracts, scales, areoles, and hairs, bristles, or spines; perianth segments usually numerous, in a sepaloid to petaloid series. Stamens numerous, variously inserted in throat and tube; anthers 2-loculed, dehiscing longitudinally. Ovary (pericarpel) inferior, rarely superior, 1-loculed, with 3 to many parietal (rarely basal) placentas; ovules usually numerous; style 1; stigmas 2 to numerous, papillate, rarely 2-fid. Fruit juicy or dry, naked, scaly, hairy, bristly, or spiny, indehiscent or dehiscent, when juicy then pulp derived from often deliquescent funicles (except in Pereskia). Seeds usually numerous, often arillate or strophiolate; embryo curved or rarely straight; endosperm present or absent; cotyledons reduced or vestigial, rarely leaflike.\r",
      "About 110 genera and more than 1000 species: temperate and tropical America; Rhipsalis baccifera (J. S. Mueller) Stearn native in tropical Africa, Madagascar, Comoros, Mascarenes, and Sri Lanka; some species of other genera now extensively naturalized in the Old World through human agency; more than 60 genera and 600 species cultivated as ornamentals or hedges in China, of which four genera and seven species more or less naturalized.",
      "Plants terrestrial; stems not producing aerial roots; leaves present; flowers diurnal, rotate, without elongated tube; ovary (pericarpel) superior to inferior",
      "Plants epiphytic, climbing, or scrambling; stems often producing aerial roots; leaves absent; flowers nocturnal, funnelform or salverform, with elongated tube; ovary (pericarpel) inferior",
      "Areoles without glochids; leaves broad and flat, pinnately nerved, ± persistent; flowers solitary or in inflorescences, mostly stalked; ovary (pericarpel) superior to inferior; seeds black, not arillate.",
      "Areoles with glochids; leaves usually small, terete to subulate, nerveless, caducous; flowers solitary, sessile; ovary (pericarpel) inferior; seeds encased in a white, bony aril."
    ],
    "authors":"Zhen-yu Li & Nigel P. Taylor"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Caricaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10161",
    "knowledge_content":[
      "Trees small, palmlike, or shrubs, rarely vines, often prickly, monoecious, dioecious, andromonoecious, gynomonoecious, or polygamomonoecious. Stem stout, unbranched, rarely branched, with a terminal cluster of leaves, with flowing, latexlike exudate. Leaves alternate, long petiolate, usually estipulate, large; stipules when present, spiny; leaf blade palmate or palmatifid, rarely entire or pinnatifid. Inflorescences axillary; male flowers aggregated in cymose panicles; female flowers usually solitary or aggregated in corymbose cymes, large. Calyx 5-lobed; lobes small, connate basally. Corolla 5-lobed; tube long in male flowers, short in female flowers. Stamens 5 or 10, 1- or 2-whorled, inserted in throat of corolla tube; filaments free, connate basally; anthers introrse, tetrasporangiate, dehiscing via longitudinal slits. Gynoecium in male flowers vestigial, or absent; in female flowers syncarpous, synovarious to synstylovarious; ovary superior, 1- or 5-loculed, placentation when 1-loculed parietal (placentas ± deeply intruded) or laminar-dispersed, when 5-loculed axile; ovules numerous, anatropous, bitegmic; styles 1 or 5, free to partly joined, apical; stigmas 5, papillate, dry. Fruit large, fleshy, indehiscent berry. Seeds numerous, surrounded by mucilage; endosperm oily; embryo well differentiated; cotyledons 2, broad, flat. n = 9.\r",
      "Six genera and 34 species: Central and South America, one genus of two species (Cylicomorpha Urban) in tropical Africa, one genus (Carica) widely introduced and cultivated in tropical areas of the world, including China."
    ],
    "authors":"Yinzheng Wang & Nicholas J. Turland"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Cistaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10194",
    "knowledge_content":[
      "Herbs, subshrubs, or shrubs. Leaves usually opposite, rarely alternate, stipulate or estipulate; leaf blade simple. Inflorescence 1-flowered or cymose, sometimes racemelike or paniclelike. Flowers bisexual, actinomorphic. Sepals 5; outer 2 smaller, sometimes absent. Petals (3 or)5, white, pink, yellow, or orange, sometimes with ± black blotches at base, crumpled in bud, caducous. Stamens many; filaments free, unequal in length, inserted in elongated or discoid torus; anthers 2-thecate, longitudinally dehiscent. Gynoecium of 3-5(-10) carpels; ovary superior, 1-loculed or imperfectly 3-5-loculed; placentas parietal; ovules 2 to many, orthotropous, rarely anatropous; style 1; stigmas 3. Capsule leathery or woody, loculicidal. Seeds small, often angled and coarse on surface. Embryo often curved, or circinate; cotyledons narrow; endosperm powdery or cartilaginous.\r",
      "Eight genera and ca. 170 species: N Africa, SW Asia, and Europe, mostly in the Mediterranean region, extending to E Africa (Somalia) and C Asia, also in North and South America; one species in China.",
      "Zhang Pengyun & Zhang Yaojia. 1990. Cistaceae. In: Li Hsiwen, ed., Fl. Reipubl. Popularis Sin. 50(2): 178-179."
    ],
    "authors":"Qiner Yang & Michael G. Gilbert"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Clusiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10203",
    "knowledge_content":[
      "Trees, shrubs, or sometimes herbs containing resin or oil in schizogenous spaces or canals and sometimes black or red glands containing hypericin or pseudohypericin. Leaves simple, entire or rarely gland-fringed, opposite or sometimes whorled, nearly always estipulate. Flowers bisexual or unisexual, regular, hypogynous, solitary or in cymes or thyrses; bracteoles often inserted just beneath calyx and then not always easily distinguishable from sepals. Sepals (2-)4 or 5(or 6), imbricate or decussate or rarely wholly united in bud, inner ones sometimes petaloid. Petals [3 or]4 or 5[or 6], free, imbricate or contorted in bud. Stamens many to rarely few (9), in [3 or]4 or 5 bundles (fascicles) that are free and antipetalous or variously connate, with filaments variously united or apparently free and then sometimes sterile (staminodes); anther dehiscence longitudinal. Staminode bundles (fasciclodes) 3-5, free and antisepalous or variously connate or absent. Ovary superior, with 2-5(-12) connate carpels, 1-12-loculed, with axile to parietal or basal placentation; ovules 1 to many on each placenta, erect to pendulous; styles 1-5[-12], free or ± united or absent; stigmas 1-12, punctiform to peltate or, when sessile, radiate, surface papillate or smooth. Fruit a septicidal or septifragal, rarely loculicidal, capsule, berry, or drupe; seeds 1 to many, without or almost without endosperm [sometimes arillate].\r",
      "About 40 genera and 1200 species: mainly in tropical regions, except Hypericum and Triadenum, which are both mainly temperate in distribution; eight genera (one endemic) and 95 species (48 endemic, one introduced) in China.",
      "The Clusiaceae are here treated sensu lato. Some authors treat Hypericaceae (genera nos. 1-4 in this treatment: Hypericum, Lianthus, Triadenum, and Cratoxylum) separately from Clusiaceae sensu stricto (genera nos. 5-8: Mesua, Calophyllum, Mammea, and Garcinia).The Clusiaceae are a rather economically important family. Many species, such as Mesua ferrea and Garcinia paucinervis, have hard wood. Numerous species in Calophyllum, Clusia Linnaeus, and Garcinia produce valuable commercial resin or gum. Gamboge is produced from Garcinia morella Desrousseaux and other species. Garcinia mangostana and Mammea americana Linnaeus produce well-known edible fruits. Other species, such as Calophyllum inophyllum and Garcinia indica Choisy, have oily seeds. Hypericum is important in horticulture and medicine.Garcinia schefferi Pierre and Pentadesma butyracea Sabine are cultivated only to a minor degree in China and are therefore not treated here.Li Xiwen & Li Yan-hui. 1990. Guttiferae. In: Li Hsiwen [Xiwen], ed., Fl. Reipubl. Popularis Sin. 50(2): 1-112.",
      "Sepals completely united in bud, splitting into 2 at anthesis; stamens free or all basally united; fasciclodes absent; ovary 2-loculed, each locule 2-ovuled; leaf venation densely and prominently reticulate with translucent gland dots in areoles.",
      "Sepals free; stamens fascicled or united in central mass or sterile (female flowers); fasciclodes often present, free or variously united; ovary (1 or)2-12-loculed, each locule 1-ovuled; leaf venation dense to lax, but not or scarcely prominent, with brownish glandular canals beneath crossing the veins obliquely.",
      "Capsule loculicidal, seeds with large wing; stamen fascicles with many filaments united above middle.",
      "Capsule septicidal, seeds usually unwinged, or with keel or small; stamens free, or fascicles with filaments free nearly to base, or if up to 2\/3 united, then stamens 3",
      "Petals yellow, sometimes tinged red abaxially; fasciclodes (sterile stamen fascicles) absent; stamen fascicles [4 or]5, free or 1 or 2 pairs united (i.e., fascicles apparently 4 or 3); filaments united at base or apparently free; dark (black or red) glands sometimes present.",
      "Petals pink or white; fasciclodes 3, between fascicles; stamen fascicles 3; filaments united at base or to 1\/2 to 2\/3; dark glands absent",
      "Plant a suffrutex; stamens 11-15, filaments united at base; petals white; leaves with glandular dots and parallel lines.",
      "Plant a rhizomatous herb; stamens 9 (3 per fascicle), filaments united for 1\/2 or 2\/3 of their length; petals white or pink; leaves with glandular dots only.",
      "Calophyllum  LinnaeusCratoxylum  BlumeGarcinia  LinnaeusHypericum  LinnaeusLianthus  N. RobsonMammea  LinnaeusMesua  LinnaeusTriadenum  Rafinesque"
    ],
    "authors":"Xi-wen Li, Jie Li, Norman K. B. Robson & Peter Stevens"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Combretaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10211",
    "knowledge_content":[
      "Trees, shrubs, or woody lianas, evergreen or deciduous, rarely subherbaceous. Indumentum of simple hairs, glandular hairs, or multicellular hairs secreting calcium oxalate and forming scales or present beneath cuticle and making leaf blade surface verruculose and sometimes translucent dotted. Leaves opposite, subopposite, whorled, spiraled, or alternate, usually petiolate, estipulate; petiole sometimes persistent and thornlike; leaf blade simple, margin entire or subentire, sometimes toothed, glands often present between crenations of proximal margin and at base or on petiole. Inflorescences terminal, axillary, or extra-axillary, spikes, branched spikes, racemes, panicles, or sometimes capitula, bracteate. Flowers usually regular, rarely slightly zygomorphic, usually bisexual, sometimes bisexual and male flowers present in same inflorescence. Receptacle surrounding and adnate to ovary and extended into a short or long calyx tube dilated distally (together termed \"calyx tube\" in this treatment); lobes 4 or 5(-8), valvate in bud, persistent or deciduous, sometimes almost absent. Petals 4 or 5, inserted near mouth of calyx tube, imbricate or valvate in bud, conspicuous or not, or absent. Stamens usually 2 × as many as calyx lobes in 2 series, inserted inside distal part of calyx tube, included in or exserted from calyx tube; filaments incurved in bud; anthers dorsifixed, usually versatile, dehiscing longitudinally. Disk usually present, intrastaminal, hairy or glabrous. Ovary inferior, 1-loculed; ovules 2(-6), pendulous, anatropous, usually only 1 developing; style 1, simple, usually free from distal part of calyx tube, subulate to filiform; stigma capitate or inconspicuous. Fruit a pseudocarp, very variable in shape and size, fleshy or dry, 1-seeded, usually indehiscent, often longitudinally 2-5-winged, -ridged, or -angled; endocarp not or at least partly sclerenchymatous. Cotyledons convolute, folded, or twisted. Endosperm absent.\r",
      "About 20 genera and ca. 500 species: widespread in tropics and subtropics; six genera and 20 species (one endemic) in China.",
      "Tan et al. (J. Plant. Res. 115: 475-481. 2002) inferred a phylogeny of the Chinese genera from nuclear, plastid, and spacer sequences based on 16 species in 19 samples. The mangrove genera Lumnitzera and Laguncularia Gaertner were placed as sister taxa in a clade sister to the other genera in China plus Conocarpus Linnaeus. The latter group comprised two clades: one with Conocarpus sister to an unresolved grouping of Terminalia and Anogeissus; the other with Getonia sister to Quisqualis and Combretum.In this treatment, measurements of calyx tube length include the stipe (if any), the part surrounding the ovary, the tube above the ovary, and the lobes. Measurements of fruit include any ridges or wings.Hsu Ting-zhi. 1984. Combretaceae. In: Chen Cheih, ed., Fl. Reipubl. Popularis Sin. 53(1): 1-28.",
      "Woody lianas, or if non-climbing shrubs then leaf blade not cuneate and petals present although sometimes inconspicuous",
      "Petals absent; calyx tube without bracteoles; leaf blade oblong, elliptic, obovate, or orbicular, not fleshy",
      "Inflorescences pedunculate capitula; middle part of calyx tube persistent and beaklike at apex of fruit.",
      "Calyx tube (1.7-)5-9 cm; stamens not or scarcely exserted from calyx tube; style partly adnate to inside of calyx tube.",
      "Calyx tube usually shorter than 2 cm; stamens usually exserted from calyx tube; style not adnate to inside of calyx tube.",
      "Anogeissus  (Candolle) Wallich ex Guillemin et al.Combretum  LoeflingGetonia  RoxburghLumnitzera  WilldenowQuisqualis  LinnaeusTerminalia  Linnaeus"
    ],
    "authors":"Jie Chen & Nicholas J. Turland"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Crypteroniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10229",
    "knowledge_content":[
      "Trees or tall shrubs, evergreen, with quadrangular or flattened twigs, and accumulating aluminum. Leaves opposite, simple, entire, pinnately veined, secondary and reticulate veins prominent, with short petioles and minute or rudimentary stipules, or stipules absent. Inflorescence terminal or axillary, paniculate, racemose, or spicate. Flowers shortly pedicellate, bisexual or unisexual and plants dioecious, actinomorphic, often perigynous, very small; receptacle broadly campanulate. Sepals 4 or 5, mostly persistent, valvate. Petals ± rudimentary, sometimes absent. Stamens or staminodes as many as and alternating with calyx lobes. Ovary superior or inferior, 2-4(or 5)-carpelled, 1-6-loculed; ovules 1-3 or many per locule, anatropous on axile placentas; style 1; stigma 1. Fruit a papery or woody capsule, 2-6-loculicidally dehiscent, valves often held together apically by persistent style. Seeds few or many, small, flat, with membranous wing, endosperm absent; embryo straight.\r",
      "Three or four genera and about ten species: pantropical with three genera in Indo-Malesia, one unispecific genus in S Africa, and one genus in South America (Bolivia and Peru); one species in China.",
      "Phylogenetic and molecular studies support an early Tertiary dispersal of the family northward from India (Conti et al., Evolution 56: 1931-1942. 2002).Shia Zhen-dia. 1983. Crypteroniaceae. In: Fang Wen-pei & Chang Che-yung, eds., Fl. Reipubl. Popularis Sin. 52(2): 118-120."
    ],
    "authors":"Haining Qin & Anthony R. Brach"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Cynomoriaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10245",
    "knowledge_content":[
      "Herbs perennial, parasitic, reddish brown, without chloropyll, monoecious, rarely polygamous. Root fleshy. Stem simple or branched, cylindric. Leaves spiral, scalelike, caducous. Flowers densely gathered into a terminal, spadix, minute. Perianth lobes (1-)4-6(-8). Stamen 1. Ovary inferior, 1-loculed; ovule 1, pendulous; style simple, reduced to a nectary in male flowers. Fruit a nutlet.\r",
      "One genus and two species: from the Mediterranean region through SW and C Asia to Mongolia and NC China; one species in China."
    ],
    "authors":"Jiarui Chen & Michele Funston"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Dipterocarpaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10284",
    "knowledge_content":[
      "Trees, evergreen or semievergreen, rarely deciduous in dry season. Xylem with aromatic resin in intercellular resin canals. Branchlets with stipular scars, sometimes annular. Leaves simple, alternate; stipules persistent or caducous, large or small; leaf blade with lateral veins pinnate, margin entire or sinuate-crenate. Inflorescences few- or many-flowered, terminal or axillary racemes or panicles; flowers usually sweetly scented; bracts usually fugacious and minute, rarely persistent and large. Inflorescences, calyces, petals, ovary, and other parts usually with stellate, squamate, fascicled or free-standing hairs. Flowers bisexual, actinomorphic, contorted. Calyx lobes 5, free or united at base, imbricate in bud if not united. Petals 5, adnate or connate at base. Stamens (10-)15 to many, free from or connate to petals; filaments usually dilated at base; anthers 2-celled, with 2 pollen sacs per cell (Chinese species); connective appendages aristate, filiform or stout. Ovary superior, rarely semi-inferior, slightly immersed in torus, usually 3-loculed, each locule 2-, rarely many ovuled; ovules pendulous, lateral or anatropous. Fruit usually nutlike, sometimes capsular and 3-valved, 1(to many)-seeded, with persistent, variously accrescent calyx of which 2 or more lobes are usually developed into lorate wings. Seed exalbuminous; cotyledons fleshy, equal or unequal, applanate or ± folded or cerebriform, entire or laciniate; radicle directed toward hilum, usually included between cotyledons.\r",
      "About 17 genera and 550 species: tropical Africa, Asia, and South America (in Asia, most species and genera in NW Borneo); five genera and 12 species (one endemic, one introduced) in China.",
      "Tong Shaoquan & Tao Gouda. 1990. Dipterocarpaceae. In: Li Hsiwen, ed., Fl. Reipubl. Popularis Sin. 50(2): 113-131.",
      "Ovary with distinct stylopodium; 2 calyx segments enlarged into wings or all calyx segments not enlarged into wings.",
      "Fruit sepals subequal, imbricate; bark, crest of buttresses and bases of fissures prominently pale corky lenticellate.",
      "Fruit sepals unequal, 3 long, aliform; bark, crest of buttresses and bases of fissures scarcely lenticellate.",
      "Dipterocarpus  C. F. GaertnerHopea  RoxburghParashorea  KurzShorea  Roxburgh ex C. F. GaertnerVatica  Linnaeus"
    ],
    "authors":"Xi-wen Li, Jie Li & Peter S. Ashton"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Elaeagnaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10298",
    "knowledge_content":[
      "Trees or shrubs, deciduous or evergreen; most parts with distinctive silvery or brownish peltate scales and\/or stellate hairs, sometimes branches spine-tipped. Leaves alternate, opposite, or whorled; stipules absent; petiole usually present, sometimes short; leaf blade often leathery, simple, margin entire or subentire, abaxially densely stellate-hairy or peltate-scaly, pinnately veined. Flowers solitary or in clusters or short racemes, actinomorphic, bisexual, or unisexual (plants dioecious). Calyx in bisexual and female flowers tubular, 2-6(-8)-lobed, male flowers of Hippophaë of 2 membranous sepals. Petals absent. Stamens 4-8, free, adnate to calyx tube, in male flowers 2 × as many as the lobes, in bisexual flowers as many as the lobes and alternate with them. Ovary superior but tightly enclosed in differentiated basal part of calyx and apparently inferior, 1-loculed; style elongate, stigma lateral. Ovule 1, basal, anatropous. Fruit drupelike, indehiscent, enclosed in base of calyx tube and containing a single seed.\r",
      "Three genera and ca. 90 species: N temperate and tropical regions; two genera and 74 species (59 endemic) in China.",
      "The fruits of many members of this family are edible, and some species of both Elaeagnus and Hippophaë are widely utilized and sometimes cultivated as fruit trees. They are a particularly good source of Vitamin C. Several species are also grown as ornamental garden shrubs. The roots are able to fix atmospheric nitrogen making it possible for plants to grow well on very poor soils. For this reason, some species, most notably Elaeagnus angustifolia, have been used for land reclamation.Chang Che-yung. 1983. Elaeagnaceae. In: Fang Wen-pei & Chang Che-yung, eds., Fl. Reipubl. Popularis Sin. 52(2): 1-66.",
      "Flowers unisexual (plants dioecious); calyx minutely 2-lobed; stone with longitudinal groove on one side; leaves alternate, opposite, or whorled."
    ],
    "authors":"Haining Qin & Michael G. Gilbert"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Elatinaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10302",
    "knowledge_content":[
      "Herbs annual, perennial, or subshrubs, semiaquatic or terrestrial, dwarf. Leaves opposite or verticillate, petiolate; stipules paired; leaf blade simple, margin entire or serrate. Flowers solitary, clustered, or in axillary cymes, bisexual, actinomorphic, small. Sepals 2-5, imbricate, free or slightly united, thinly membranous or with nearly pellucid margins. Petals 2-5, imbricate in bud, free, membranous. Stamens 1 or 2 × as many as sepals, free; anthers dorsifixed, 2-loculed. Ovary superior, 2-5-loculed, many ovuled; placentation axile; styles 2-5, free, short; stigmas capitate. Fruit a septicidal capsule, membranous, leathery, or crustaceous. Seeds numerous, straight or curved, small; testa often rugose; endosperm absent.\r",
      "Zhang Pengyun & Zhang Yaojia. 1990. Elatinaceae. In: Li Hsiwen, ed., Fl. Reipubl. Popularis Sin. 50(2): 132-138."
    ],
    "authors":"Qiner Yang & Gordon C. Tucker"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Flacourtiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10343",
    "knowledge_content":[
      "Trees or shrubs, hermaphroditic, monoecious, dioecious, or polygamous, evergreen or deciduous; trunk, branches, and branchlets sometimes spiny; hairs simple, rarely T-shaped or stellate. Leaves simple, usually alternate, rarely opposite or verticillate, sometimes crowded at apices of branches; stipules usually small and caducous, sometimes larger, leaflike and persistent, rarely absent; petiole generally present, sometimes with apex 2-glandular and\/or with additional glands along petiole length; leaf blade usually pinnate-veined, sometimes 3-5-veined from base or palmate-veined, with or without pellucid dots or lines, sometimes with a pair of glands at junction of blade and petiole, margin entire or toothed, teeth glandular or not. Inflorescences axillary, terminal, or cauliflorous, of various forms: racemose, spicate, cymose, corymbose, or paniculate, sometimes flowers fasciculate, or solitary; pedicels often articulate; bracts and bracteoles usually small to minute. Flowers radially symmetric, bisexual or unisexual, hypogynous, perigynous, or epigynous; perianth cyclic, rarely spiral, in unisexual flowers remnants of opposite sex present or absent. Sepals imbricate or valvate, rarely spathaceous, mostly (2 or)3-6, rarely more, usually free or connate at base only, sometimes partly united into a tube, caducous or persistent, rarely accrescent. Petals 3-8, rarely more, often isomerous and alternating with sepals, free, imbricate or valvate, rarely contorted, similar to sepals or not, sometimes with a fleshy adaxial basal scale, or petals absent. Disk present, entire, lobed, or comprised of free or connate disk glands, these extrastaminal, interstaminal, or intrastaminal (bisexual or staminate flowers), or extragynoecial (pistillate flowers), or disk absent. Stamens 1 to many (ca. 100), 1- or many seriate, sometimes in epipetalous bundles, or on margin of cupular disk or rim of calyx tube; filaments free, rarely united into a column; anthers 2-thecate, usually longitudinally dehiscent, rarely opening by terminal pores, connective sometimes shortly projected or glandular. Ovary superior or semi-inferior, 1-loculed, with 2-9 parietal placentas, rarely incompletely 2-9(or more)-celled by placentas protruding deeply into locule; ovules 2 or more on each placenta, orthotropous, anatropous, or hemi-anatropous; styles isomerous with placentas, free or partly to completely united, rarely absent, stigmas small or large, capitate to flattened and branched. Fruit capsular or baccate, rarely a drupe, pericarp mostly smooth, sometimes winged or bristly. Seeds 1 to many, with or without a fleshy sometimes brightly colored sarcotesta and\/or aril, sometimes with long hairs, or broadly winged; endosperm usually copious and fleshy; embryo straight or curved; cotyledons usually broad, often cordate.\r",
      "About 87 genera and ca. 900 species: mostly in tropical and subtropical regions, some extending into the temperate zone; 12 genera (one endemic) and 39 species (nine endemic) in China; four additional species (all endemic) are poorly known (see Homalium).",
      "Ahernia glandulosa Merrill (Philipp. J. Sci. 4: 295. 1909), described from the Philippines, reportedly occurs in Hainan, but the present authors have seen no specimens from the Flora area. Flacourtia cavaleriei H. Léveillé (Repert. Spec. Nov. Regni Veg. 9: 457. 1911) and Xylosma dunniana H. Léveillé (loc. cit.: 455) were both described from Guizhou. After studying specimens at K from the type gathering (Cavalerie 3327 and Cavalerie 1151, respectively), it is not clear where they belong, and for the time being they must be regarded as species incertae sedis. Erythrospermum hypoleucum Oliver is the basionym of Celastrus hypoleucus (Oliver) Warburg ex Loesener in the Celastraceae (see Fl. China 11). Oncoba spinosa Forsskal and Dovyalis hebecarpa (Gardner) Warburg are occasionally cultivated.In some treatments, where the genera of Flacourtiaceae are completely transferred to other families, and Flacourtiaceae is treated as a synonym of Salicaceae sensu lato, Chinese genera have been reclassified as follows: two genera (Hydnocarpus and Gynocardia) moved to Achariaceae sensu lato, all others to Salicaceae sensu lato (Chase et al., Kew. Bull. 57: 141-181. 2002).Lai Shushen. 1999. Flacourtiaceae. In: Ku Tsuechih, ed., Fl. Reipubl. Popularis Sin. 52(1): 1-80.",
      "Calyx tube present, obconic, adnate to ovary for lower 1\/2-2\/3 (i.e., flowers epigynous), with free sepal lobes and petals spreading from rim, ovary semi-inferior, lower 2\/3 or more enclosed in adnate calyx tube.",
      "Calyx tube absent, calyx not adnate to ovary (i.e., flowers hypogynous), sepals free or partly fused, sometimes completely fused in bud, ovary when present free",
      "Flowers always bisexual; petals and sepals similar; petals ca. 4 mm or less, adaxial basal scale absent; disk glands present, small, in an extrastaminal row; stamens longer than sepals; style 1.",
      "Flowers unisexual or bisexual; petals and sepals distinct; petals ca. 5 mm or more, with scale at least 1\/4 as long as petal attached to inside at base; disk glands absent; stamens shorter than or equal to petals; styles 3-6",
      "Sepals in bud completely fused, calyx closed or with a small circular opening at apex, later shortly 3-5-truncate lobed, sometimes splitting more regularly to 3-5 sepals; stamens ca. 100 (staminate flowers); styles 5, stigmas small, cordate or peltate, erect or reflexed (pistillate flowers).",
      "Sepals in bud imbricate, free or connate at base only; stamens 5-30 (staminate flowers); styles 3-6, or nearly absent, stigmas conspicuous, broadly flattened, usually reflexed (pistillate flowers).",
      "Flowers bisexual, disk cuplike (cup sometimes very shallow), adnate to inside of calyx (but not adnate to ovary), with oblong to narrowly triangular hairy disk lobes in same row as stamens and alternating with them, lobes ca. 1\/2 as long as stamen filaments.",
      "Flowers unisexual, rarely bisexual, disk not cuplike nor with lobes alternating with stamens, nor adnate to inside calyx; instead disk a small fleshy annulus or comprising small, free or connate, fleshy glands, these in an extrastaminal (staminate and bisexual flowers) or extra-gynoecial (pistillate flowers) row, or disk consisting of free glands among stamen or staminode bases, or disk and disk glands completely absent",
      "Sepals imbricate; disk glands present, extrastaminal, extragynoecial, or among stamen or staminode bases",
      "Inflorescence more than 30-flowered, very densely pale-grayish tomentose throughout, indumentum obscuring rachis surface, bracts to 4 mm; sepals 4-5 mm, thickish in texture.",
      "Inflorescence less than 20-flowered, pubescent to tomentose but indumentum not obscuring rachis surface, bracts 5-30 mm; sepals more than 10 cm, papery.",
      "Leaves broadly ovate, base cordate or less often broadly rounded, petiole 6-12 cm or more, often with 1 or 2 large glands in lower half; sepals 5-6 mm, outside densely pubescent, hairs yellowish brown when dry.",
      "Leaves not as above, petiole usually less than 4 cm, if longer then without glands in lower half; sepals less than 4 mm, outside glabrous or only sparsely pubescent, hairs not yellowish when dry",
      "Flowers usually in terminal panicles 6-12 cm (sometimes shorter); stamen or staminode filaments with long hairs in lower half; disk glands free among filament bases.",
      "Flowers in short racemes or cymes to 5 cm, these axillary or terminating short lateral branches; stamen or staminode filaments glabrous, or with short hairs in lower half; disk annular or comprised of connate or free glands, in an extragynoecial or extrastaminal row, not dispersed among stamen or staminode bases. ..... 4. Flacourtia or 5. Xylosma"
    ],
    "authors":"Qiner Yang & Sue Zmarzty"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Frankeniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10349",
    "knowledge_content":[
      "Herbs, subshrubs, or shrubs. Leaves simple, small, opposite, petiolate [or sessile], with salt glands; paired leaves united at base by sheathing margins; leaf blade flattened [to subterete], margin entire, slightly to gradually [to strongly] revolute. Flowers hermaphroditic [rarely unisexual], small, actinomorphic, sessile, subtended by [2 or]4 leaflike floral bracts, solitary or clustered in terminal or axillary, simple or compound dichasia (frequently with some monochasial branching). Calyx persistent, tubular, ribbed, [4 or]5[-7]-dentate. Petals [4 or]5[-7], free, imbricate, with spreading limb, clawed at base, with a scalelike appendage or ligule present [rarely absent] on adaxial face of claw. Stamens [3-]6[to many]; filaments free or slightly united at base; anthers 2-thecate, extrose, longitudinally dehiscent. Pistil 1, consisting of (1-)3(or 4) carpels; ovary superior, 1-loculed; ovules numerous on parietal placentas [to fewer, rarely 1]; style solitary, slender; style branches [1-]3[or 4], as many as carpels. Capsule included in persistent calyx, loculicidally dehiscent. Seeds [1 to] numerous, small; testa thinly crustaceous; embryo immersed in endosperm.\r",
      "One genus and ca. 70 species: N and S Africa, C and SW Asia, Atlantic islands, Australia, Europe, North and South America; one species in China.",
      "Zhang Pengyun & Zhang Yaojia. 1990. Frankeniaceae. In: Li Hsiwen, ed., Fl. Reipubl. Popularis Sin. 50(2): 139-141."
    ],
    "authors":"Qiner Yang & Molly Whalen"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Haloragaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10394",
    "knowledge_content":[
      "Herbs perennial, rarely annual, aquatic or terrestrial, monoecious or dioecious. Stem creeping, ascending or erect, often rooting at lower nodes. Leaves estipulate, 2-4-whorled, decussate, or alternate, in terrestrial species always simple, in aquatic submersed species always pectinately lobed. Inflorescence an indeterminate or determinate spike of 1-5-flowered dichasia borne in axils of leaflike primary bracts; occasional lateral inflorescences simpler. Flowers minute, actinomorphic, epigynous, protandrous, anemophilous or entomophilous, bisexual or unisexual. Sepals (2-)4, but absent in female flowers of some Myriophyllum, mostly persistent. Petals alternisepalous, (2-)4, absent in female flowers of some Myriophyllum, imbricate, longer than sepals, often deciduous with stamens. Stamens 1 or 2 × as many as sepals; filaments short, slender; anthers basifixed, mostly oblong or linear, 4-loculed, dehiscing by slits, antisepalous anthers sometimes somewhat longer than antipetalous ones; pollen grains shedding at 3-celled stage. Ovary inferior, 1(or 2)- or 4-celled, septa solid or practically absent (present only at base and apex of ovary); styles as many (rarely half as many) as sepals, alternisepalous, free, mostly short, grading into globose or subulate stigmas, spreading in fruit; stigmatic papillae hairlike; ovules as many as styles, rarely 1, apical, pendulous, anatropous. Fruit nutlike or a drupe, variously ornamented with wings, ribs, and tubercles, indehiscent and 1-seeded or breaking up into (2-)4 1-seeded mericarps; pericarp membranous or endocarp woody; exocarp membranous or swollen and spongy. Seeds with thin testa; embryo cylindric, surrounded by thick, white albumen.\r",
      "About eight genera and ca. 100 species: mainly S hemisphere, particularly Australia, but Myriophyllum cosmopolitan and Proserpinaca Linnaeus confined to the N hemisphere; two genera and 13 species (one endemic, one introduced) in China.",
      "The spelling \"Haloragidaceae\" was used in FRPS, but the family name is conserved in Appendix IIB of the International Code of Botanical Nomenclature, where the spelling Haloragaceae is used.Wan Wenhao. 2000. Haloragidaceae [sic]. In: Chen Chiajui, ed., Fl. Reipubl. Popularis Sin. 53(2): 134-143.",
      "Herbs terrestrial; all flowers with petals; fruit 1-loculed (septa almost absent), 1-seeded; leaves opposite or alternate, simple, margin entire to crenate-serrate.",
      "Herbs aquatic (in China); at least female flowers lacking petals or inconspicuous; fruit splitting at maturity into (2-)4 1-seeded mericarps; leaves whorled, at least the lower (submersed) ones pinnately divided."
    ],
    "authors":"Jiarui Chen & Michele Funston"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Hippuridaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10414",
    "knowledge_content":[
      "Herbs aquatic, perennial, glabrous, with creeping rhizomes. Stems submerged or emergent, erect, simple, leafy. Leaves estipulate, whorled, sessile, simple, linear to ovate, margin entire. Flowers solitary in axils of upper leaves, sessile, minute, bisexual or unisexual, Perianth reduced to an entire rim on top of ovary. Stamen 1, epigynous. Ovary inferior, 1-loculed; ovule 1, pendulous, anatropous, micropyle closed; style filiform, with stigmatic papillae down one side. Fruit a small achene.\r",
      "One genus and two species: temperate regions worldwide, mainly in the N hemisphere; two species in China.",
      "Hippuris and Callitriche Linnaeus (to be treated in Callitrichaceae in Fl. China 11) are sister genera and, together with several genera already treated in the Scrophulariaceae (see Fl. China 18. 1998), are now regarded as belonging with Plantago Linnaeus in an expanded Plantaginaceae; see Olmstead et al. (Amer. J. Bot. 88: 348-361. 2001), who incorrectly used the name Veronicaceae for this group instead of Plantaginaceae.Wan Wenhao. 2000. Hippuridaceae. In: Chen Chiajui, ed., Fl. Reipubl. Popularis Sin. 53(2): 144-147."
    ],
    "authors":"Jiarui Chen & Michele Funston"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Lecythidaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10482",
    "knowledge_content":[
      "Trees or shrubs, evergreen. Leaves alternate, usually crowded toward apices of branchlets, shortly petiolate; stipules usually absent; leaf blade simple. Flowers showy, borne in short, bracteate racemes or spikes, actinomorphic or zygomorphic, bisexual. Calyx with a campanulate tube adnate to ovary; lobes 4-6, thick. Petals 4-6, free, rarely absent. Stamens many, united at base into several whorls, often several sterile, either monadelphous and equally arranged around disk, or diadelphous in 2 unequal bundles, outermost staminodial; anthers basifixed, 2-celled, opening by longitudinal slits. Disk sometimes lobed. Ovary inferior or semi-inferior, 2-6-loculed; ovules 1 to many per locule; placentation axile; style terminal, simple; stigma capitate. Fruit an indehiscent berry or operculate capsule, often crowned by persistent calyx lobes. Seed[s] 1 [to many]; endosperm absent.\r",
      "About 20 genera and 450 species: tropical regions of Africa, Asia, Australia, some Pacific islands, and South America; one genus and three species (one endemic) in China.",
      "Lo Hsien-shui. 1983. Lecythidaceae. In: Fang Wen-pei & Chang Che-yung, eds., Fl. Reipubl. Popularis Sin. 52(2): 121-125."
    ],
    "authors":"Haining Qin & Sir Ghillean (Iain) T. Prance"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Lythraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10529",
    "knowledge_content":[
      "Herbs, shrubs, or trees; young stems often quadrangular. Leaves opposite, often decussate, or whorled, rarely subalternate to alternate, simple, entire; pinnately veined, secondary veins typically joined in a series of intramarginal arches; stipules vestigial or absent. Inflorescences racemes, cymes, or panicles; flowers axillary or terminal, usually 4-, 6- or 8-merous, sometimes 3- or 5-merous, bisexual, regular or irregular. Floral tube perigynous, hemi-epigynous, or epigynous, persistent in fruit, membranous to leathery, often 6-12-ribbed; sepals valvate, equal to much shorter than floral tube, membranous to thickly leathery, persistent; epicalyx alternating with sepals or absent. Petals inserted at rim of floral tube, alternating with sepals, crinkled, clawed or not, frequently caducous, rarely absent. Stamens usually biseriate and 2 × as many as sepals, sometimes uniseriate, inserted near base of floral tube or higher, or numerous, multiseriate, with at least some inserted at floral rim just below sepals (Punica, Sonneratia, and some Duabanga); anthers versatile [rarely basifixed]. Ovary superior, half-inferior, or inferior, 2-6- or multi-loculed, with many ovules per locule; style simple; stigma capitate, conic-peltate, or punctiform; placentation axile, sometimes free central at fruit maturity. Fruit partly or completely surrounded by persistent floral tube, loculicidally dehiscent or irregularly dehiscent capsules, infrequently indehiscent, leathery, or berrylike. Seeds usually numerous, without endosperm; embryo straight, cotyledons flat or convolute.\r",
      "About 31 genera and 625-650 species: widespread in tropical regions, less common in temperate regions; ten genera and 43 species (ten endemic, four introduced) in China.",
      "From the morphological standpoint, the Lythraceae sensu lato (including Trapaceae) have a very generalized morphology, without a single unique, defining character, i.e., there is no morphological synapomorphy that defines the family. At the same time, the genera are distinct. The position of the ovary in Duabanga, Punica, Sonneratia, and Trapa is variable: superior to partly inferior in Sonneratia; partly inferior in Duabanga; and partly, nearly, or completely inferior in Punica and Trapa. Several other features ally these genera to the Lythraceae sensu stricto, including opposite and simple leaves, commonly held wood anatomical characters (true for the Myrtales generally), development of a persistent floral tube, valvate sepals, 4- or 6-merous flowers, introrse and versatile anthers, axile placentation, and seeds without endosperm. Of the four genera, Trapa is the most divergent, but still sufficiently similar to the Lythraceae and Onagraceae to have been considered for membership within either family, or as a closely related family (as has been done in the present Flora). The inclusion of Sonneratia, Duabanga, and Punica in the Lythraceae adds some additional derived features to the definition of the family, but at the same time, brings together taxa that we know, from molecular sequence data, represent a single historical lineage. That knowledge of evolutionary relationship is lost if the genera are maintained as separate families, whereas the taxonomic utility of the Flora is not affected by their inclusion in an expanded Lythraceae.The molecular data from four genes (three chloroplast and one nuclear) unquestionably place not only Duabanga, Punica, and Sonneratia, but also Trapa, within the Lythraceae. Punica is well supported as a member of a clade of genera that includes Capuronia Lourteig, Galpinia N. E. Brown, and Pemphis (from East Africa and Madagascar). Duabanga and Lagerstroemia are sister genera, and Sonneratia and Trapa, as unlikely as it may seem morphologically, are also sister genera. Duabanga, Lagerstroemia, Sonneratia, and Trapa together form one of seven clades in the family.In addition to the species described below, several species have been recorded as introduced or cultivated in China. Cuphea carthagenensis (Jacquin) J. F. Macbride (C. balsamona Chamisso & Schlechtendal), of South American origin, is an introduced weed in many places in the Pacific, although it has never been cultivated. Cuphea viscosissima Jacquin (C. petiolata (Linnaeus) Koehne 1882, not Pohl ex Koehne 1877), native to the E United States, has never been cultivated but misidentifications of cultivated C. lanceolata in botanical gardens as C. viscosissima (or C. petiolata) have put its name in records of cultivated plants. Several other species have been recorded as cultivated in China, including C. hookeriana Walpers, C. hyssopifolia Kunth, C. ignea A. Candolle (C. platycentra Lemaire, 1846, not Bentham, 1839), C. lanceolata W. T. Aiton, C. micropetala Kunth, and C. procumbens Ortega, as well as Heimia myrtifolia Chamisso & Schlechtendal, Lafoensia vandelliana Chamisso & Schlechtendal, and Lawsonia inermis Linnaeus. Of these, however, only C. hyssopifolia, C. ignea, and L. inermis (henna) are really widely grown as ornamentals.Lee Shu-kang & Lau Lan-fang; Ko Wan-chueng; Lo Hsien-shui. 1983. Lythraceae; Sonneratiaceae; Punicaceae. In: Fang Wen-pei & Chang Che-yung, eds., Fl. Reipubl. Popularis Sin. 52(2): 67-111; 111-118; 120-121.",
      "Floral tubes elongate, cylindric, ca. 2 × longer than wide or more; capsules enclosed within floral tube; perennials to 1 m tall.",
      "Floral tubes campanulate to globose; capsules equaling or extending beyond floral tube; annuals ca. 50 cm tall or less",
      "Flowers usually 6-merous, solitary, axillary; sepals and alternating epicalyx segments longer than floral tube, epicalyx segments linear-subulate.",
      "Flowers 4- or 5(or 6)-merous, solitary, axillary or in racemes or cymes; sepals and epicalyx segments much shorter than floral tube, epicalyx sometimes absent",
      "Capsule wall transversely finely striated (10 × magnification), dehiscence septicidal; flowers usually solitary, axillary.",
      "Stamens all or in part inserted at rim of floral tube just below sepals; stamens usually many, seldom as few as 12",
      "Stamens all inserted at or near base of floral tube or somewhat above, but never at rim of floral tube; stamens usually 4-12, seldom numerous",
      "Floral tubes epigynous, orange-red or yellow, completely enveloping fruit; fruit red or yellow, leathery, berrylike, crowned by persistent sepals; seeds with translucent, juicy sarcotesta.",
      "Floral tubes perigynous or hemi-epigynous, green, half-enveloping fruit or flattened, saucer-shaped; seeds dry",
      "Flowers 1-3(-5), in terminal clusters; petals narrowly lanceolate, very small, or absent; fruit indehiscent, globose, leathery berries; seeds irregularly angular or falcate.",
      "Flowers (3-)5 to many, in lax terminal corymbs; petals oblong to ovate; fruit loculicidally dehiscent capsules; seeds 2-tailed, filiform.",
      "Leaves abaxially black glandular and tomentose; floral tube elongate, cylindric, red-orange; petals small or absent.",
      "Leaves abaxially without black glands, glabrous or pubescent to tomentose; floral tube turbinate or campanulate, green; petals present",
      "Flowers in panicles; stamens 6-100+, usually 18 or more; capsule loculicidally dehiscent; seeds unilaterally winged.",
      "Ammannia  LinnaeusDuabanga  Buchanan-HamiltonLagerstroemia  LinnaeusLythrum  LinnaeusPemphis  J. R. Forster & G. ForsterPeplis  LinnaeusPunica  LinnaeusRotala  LinnaeusSonneratia  Linnaeus f.Woodfordia  Salisbury"
    ],
    "authors":"Haining Qin, Shirley A. Graham & Michael G. Gilbert"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Melastomataceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10554",
    "knowledge_content":[
      "Herbs, shrubs, or trees (to 20 m tall), erect, climbing, or rarely epiphytic. Stipules lacking. Leaves simple, commonly opposite and decussate with one of a pair slightly smaller than other, rarely verticillate or alternate by abortion of one of a pair, usually 1-4(or 5) secondary veins on each side of midvein, originating at or near base and anastomosing apically, tertiary veins numerous, parallel, and connecting secondary veins and midvein but in Memecylon secondary veins pinnate and tertiary veins reticulate. Inflorescences cymose, umbellate, corymbose, in paniculate clusters, or a cincinnus, rarely flowers single, fascicled, or born on a spike; bracts sometimes conspicuous and persistent. Flowers bisexual, actinomorphic but androecium often slightly zygomorphic, usually (3 or)4- or 5(or 6)-merous, perianth biseriate, perigynous; bracteoles opposite, usually caducous. Hypanthium funnel-shaped, campanulate, cyathiform, or urceolate. Calyx lobes (3-)5(or 6), valvate (rarely connate, but not in Chinese species). Petals (3-)5(or 6), equal to number of sepals, distinct, imbricate. Stamens usually twice as many as petals and in 2 whorls, rarely as many as petals by loss of 1 whorl, isomorphic or dimorphic; filaments distinct, often geniculate, inflexed in bud; anthers typically 2-celled, introrse, basifixed, dehiscent by 1 or 2 apical pores or by short longitudinal slits (Astronia, Memecylon); connective often variously appendaged. Pistil and style 1; stigma minute, capitate or truncate. Ovary commonly inferior or semi-inferior, locules usually (3 or)4 or 5(or 6) with numerous anatropous ovules, rarely 1-loculed and ovules ca. 9 (Memecylon); placentation axillary, parietal (Astronia and, outside China, Pternandra Jack), or free central (Memecylon). Fruit a dry or fleshy capsule or a berry, loculicidally dehiscent or indehiscent. Seeds (when 3-6-loculed) usually small, curved through half a circle (cochleate) or wedge-shaped (cuneate), in Memecylon seeds large and ovoid; endosperm absent.\r",
      "Between 156 and 166 genera (150-160 in Melastomataceae sensu stricto and six in Memecylaceae here considered part of Melastomataceae) and ca. 4500 species (ca. 4050 in Melastomataceae sensu stricto and 450 in Memecylaceae [Olisbeoideae if considered a subfamily of Melastomataceae]): primarily in tropical and subtropical regions; 21 genera (five endemic) and 114 species (72 endemic) in China.",
      "Pternandra caerulescens Jack reported in FRPS (53(1): 282. 1984) from Hainan is a mistake. The northernmost limit of this genus is S Thailand (see Maxwell, Gard. Bull. Singapore 34: 1-90. 1981).Driessenia sinensis H. Léveillé is a synonym of Gonostegia hirta (Blume ex Hasskarl) Miquel in the Urticaceae (see Fl. China 5: 178. 2003).Chinese genera of economic value include Osbeckia (medicine) and Melastoma (wild fruit and ornamental flowers).Chen Cheih. 1984. Melastomataceae. In: Chen Cheih, ed., Fl. Reipubl. Popularis Sin. 53(1): 135-293.",
      "Leaf blade with secondary veins pinnate and tertiary veins reticulate; ovary 1-celled, with free central placentation; ovary 1-celled with 6-12 ovules, placentation free central; mature seed 1, to 5 mm in diam.; embryo large.",
      "Leaf blade with 1-4(or 5) pairs of secondary veins originating at or near blade base and anastomosing apically, tertiary veins perpendicular to secondary veins and parallel to each other; ovary (2-)4- or 5(or 6)-celled, with numerous ovules, placentation parietal or axillary; seeds numerous, ca. 1 mm in diam.; embryo small",
      "Anthers shorter than 4 mm, longitudinally dehiscent; ovules with parietal placentation near base of ovary.",
      "Anthers longer than 4 mm, if shorter than 4 mm (Sarcopyramis napalensis, S. bodinieri, Sonerila erecta) then opening by a single terminal pore; ovules with axillary placentation",
      "Stamen whorls equal or subequal in length and shape, connective not lengthened; fruit a dry capsule (not a fleshy capsule bursting irregularly).",
      "Stamen whorls unequal in length and shape, connective of longer stamen lengthened below anthers and slightly curved; fruit a fleshy capsule, bursting irregularly, rarely a berry (M. intermedium).",
      "Leaves abaxially with a stellate indumentum; stamen whorls strongly dimorphic, or inner or outer whorl staminodial.",
      "Ovary apex conic or truncate, lacking a membranous crown; hypanthium often as long as fruit, usually contracted at or near apex",
      "Ovary apex usually with a membranous crown, crown margin often setose and exserted from calyx; hypanthium not contracted at or near apex",
      "Stamens 4; abaxial leaf surface, petioles, and hypanthia usually with minute yellow transparent peltate glands.",
      "Plants usually less than 1 m tall shrublets; inflorescence an umbellate corymb, variable in size and structure, but flowers usually clustered.",
      "Inflorescences umbellate or cymose panicles, rarely capitate, never scorpioid, usually with few relatively large flowers",
      "Capsule turbinate, usually obtusely 4-sided, thick-walled to woody, apex truncate but with crown usually exserted from calyx."
    ],
    "authors":"Jie Chen & Susanne S. Renner"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Myrtaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10599",
    "knowledge_content":[
      "Trees or shrubs, evergreen, usually with essential oils-containing cavities in foliage, branchlets, and flowers. Stipules absent or small and caducous. Leaves opposite, occasionally alternate, occasionally ternate or pseudo-whorled; leaf blade with secondary veins pinnate or basal, often with intramarginal veins near margin, margin usually entire. Inflorescences axillary or terminal, cymose but variously arranged, 1- to many-flowered. Flowers bisexual, sometimes polygamous, actinomorphic. Hypanthium usually adnate to ovary and prolonged above it. Calyx lobes (3 or)4 or 5 or more, distinct or connate into a calyptra. Petals 4 or 5, sometimes absent, distinct or connate into a calyptra, sometimes coherent and pseudocalyptrate. Stamens usually numerous, in 1 to several whorls; filaments distinct or connate into 5 bundles opposite petals; anthers 2-celled, dorsifixed or basifixed, dehiscing longitudinally or rarely terminally; connectives usually terminating in 1 or more apical glands. Ovary inferior, semi-inferior, or very rarely superior, carpels 2 to more, locules 1 to many, pseudoseptum sometimes present, placentation usually axile but occasionally parietal; ovules 1 to several per locule. Style single; stigma single. Fruit a capsule, berry, drupaceous berry, or drupe, 1- to many-seeded. Seeds without endosperm or endosperm sparse and thin; testa cartilaginous or thinly membranous, sometimes absent; embryo straight or curved.\r",
      "About 130 genera and 4500-5000 species: Mediterranean region, sub-Saharan Africa, Madagascar, tropical and temperate Asia, Australia, Pacific islands, tropical and South America; 10 genera (five introduced) and 121 species (50 endemic, 32 introduced treated here) in China.",
      "The classification adopted here is that of Wilson et al. (Pl. Syst. Evol. 251: 3-19. 2005). The conventional classification of Myrtaceae sensu stricto in which the primary division is into two subfamilies based on the fruit being dry or fleshy (e.g., Niedenzu in Engler & Prantl, Nat. Pflanzenfam. 3(7): 57-105. 1893) results in an association of genera that is less natural than that proposed by Wilson et al.Many Myrtaceae are cultivated garden ornamentals, street trees, or plantation trees. Some members of tribe Syzygieae are grown as fruit crops. In addition to the cultivated members of the family treated here, some others grown in China include Acca sellowiana (O. Berg) Burrett (Feijoa sellowiana (O. Berg) O. Berg), Myrtus communis Linnaeus, and Syncarpia glomulifera (Smith) Niedenzu.Myrtus chinensis Loureiro is a synonym of Symplocos paniculata (Thunberg) Miquel in the Symplocaceae (see Fl. China 15: 252. 1996).Chang Hung-ta & Miau Ru-hwai. 1984. Myrtaceae. In: Chen Chieh, ed., Fl. Reipubl. Popularis Sin. 53(1): 28-135.",
      "Embryo with cotyledons much smaller than the hypocotyl; leaves small, often ericoid (tribe Chamelaucieae).",
      "Leaf venation usually longitudinal, sometimes pinnate and inflorescences then brushlike; floral units sessile, variously arranged in spikes or clusters (tribe Melaleuceae).",
      "Plants usually glabrous, rarely with multicellular trichomes; vascular supply to ovary axial; seeds usually 1; cotyledons massive relative to hypocotyl (tribe Syzygieae).",
      "Plants with 1- or few-celled trichomes on at least some organs; vascular supply to ovary trans-septal; seeds usually numerous; cotyledons usually small but sometimes massive relative to hypocotyl (tribe Myrteae)",
      "Baeckea  LinnaeusDecaspermum  J. R. Forster & G. ForsterEucalyptus  L’HéritierEugenia  LinnaeusLophostemon  SchottMelaleuca  LinnaeusPsidium  LinnaeusRhodamnia  JackRhodomyrtus  (Candolle) ReichenbachSyzygium  P. Browne ex Gaertner"
    ],
    "authors":"Jie Chen & Lyn A. Craven"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Nyssaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10619",
    "knowledge_content":[
      "Trees or shrubs, dioecious or polygamo-monoecious. Leaves alternate, simple, estipulate. Flowers 5-merous, ± regular, subtended by 1-5 bracts; male ones in heads, racemes, or umbels; female and hermaphroditic ones solitary or in 2-12-flowered heads. Calyx tube adnate to ovary in bisexual or female flowers; lobes small or obsolete. Petals usually 5-10 (or absent). Stamens in male flowers usually 10 or more in 2 ± distinct whorls around a nectariferous disk. Ovary inferior, 1-8-loculed, with 1 pendulous, apotropous ovule per locule. Fruit a drupe; each locule of stone opening at apical part by a ± triangular abaxial valve at germination. Seeds 1-5; embryo straight; endosperm copious.\r",
      "Five genera and about 30 species: mostly in temperate regions of E Asia and E North America; three genera (two endemic) and ten species (eight endemic) in China.",
      "Recent studies suggest that this family can alternatively be treated as part of the Cornaceae (Xiang et al., Amer. J. Bot. 85: 285-297. 1998).Fang Wen-pei. 1983. Nyssaceae. In: Fang Wen-pei & Chang Che-yung, eds., Fl. Reipubl. Popularis Sin. 52(2): 144-159.",
      "Drupe 3-4 cm, 1.5-2 cm in diam., usually solitary; ovary 6-10-loculed; bracts white, 7-16 × 3-5 cm, larger one pendulous.",
      "Drupe to 2 cm, to 1 cm in diam., usually several in a cluster; ovary 1- or 2-loculed; bracts yellowish or greenish, smaller than above."
    ],
    "authors":"Haining Qin & Chamlong Phengklai"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Onagraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10630",
    "knowledge_content":[
      "Annual or perennial herbs, or shrubs, rarely trees to 30 m tall, often with epidermal oil cells, usually with internal phloem. Leaves simple, spirally arranged, opposite, or occasionally whorled, entire or toothed to pinnatifid; stipules present and usually caducous, or absent. Flowers perfect and hermaphroditic or occasionally unisexual, actinomorphic or zygomorphic, (2-)4(-7)-merous, axillary, in leafy spikes or racemes or solitary, or occasionally in panicles, all but Ludwigia with distinct floral tube, nectariferous within. Sepals green or colored, valvate. Petals as many as sepals or rarely absent, variously colored, imbricate or convolute and occasionally clawed. Stamens as many as sepals in one series or 2 × as many as sepals in 2 series [in Lopezia Cavanilles reduced to 2 or 1 plus 1 sterile staminode]; anthers versatile or basifixed, dithecal, sometimes cross-partitioned, opening by longitudinal slits; pollen grains almost always united by viscin threads, shed as monads, tetrads, or polyads. Ovary inferior, with as many carpels and locules as sepals, septa sometimes thin or absent at maturity; placentation axile or parietal, ovules 1 to many per locule, in 1 or several rows or clustered, anatropous, bitegmic; style 1; stigma with as many lobes as sepals or clavate to globose. Fruit a loculicidal capsule or indehiscent nut or berry. Seeds small, smooth or variously sculptured, sometimes with a coma [or wing], with straight oily embryo, endosperm lacking.\r",
      "Seventeen genera and ca. 650 species: widespread in temperate and subtropical areas, but best represented in W North America; six genera (two introduced), 64 species (11 endemic, 11 introduced), and five natural hybrids (two endemic) in China.",
      "Onagraceae are a well-defined, monophyletic family in the order Myrtales, with a sister relationship to Lythraceae. Within the order Myrtales, the Onagraceae are distinguished by a number of features including (1) a distinctive 4-nucleate embryo sac; (2) abundant raphides in vegetative cells; (3) paracrystalline beaded pollen ektexine; and (4) pollen with viscin threads.Some species of Oenothera are grown for the oil in their seeds, which contains gamma linolenic acid (GLA), used for medicinal purposes. Several species of Onagraceae also are cultivated in China for their horticultural value, including species of Fuchsia Linnaeus (generally distinguished by having large, tubular, red or orange flowers and fleshy berries) and Clarkia Pursh (distinguished by having stigmas with commissural lobes with dry, unicellular papillae, and dry, elongate capsules similar to those of Epilobium but lacking comas on the seeds). The most commonly cultivated Fuchsia is F. ×hybrida Hort. and the related F. magellanica Lamarck in F. sect. Quelusia (Vandelli) Candolle from South America; F. triphylla Linnaeus, in F. sect. Fuchsia, from Hispaniola, is known from only one gathering in Fujian. Similarly, Clarkia amoena (Lehmann) A. Nelson & J. F. Macbride is widely cultivated in China, whereas C. pulchella Pursh is known from only one gathering in Xizang; both species are native to W North America. There are no naturalized species of either Clarkia or Fuchsia in China.Chen Chiajui, Lu Shangzhi & Li Yibin. 2000. Onagraceae. In: Chen Chiajui, ed., Fl. Reipubl. Popularis Sin. 53(2): 27-133.",
      "Leaves spirally arranged or alternate; floral tube absent; flowers slightly zygomorphic; petals entire; stamens subequal in a single whorl; stigma deeply 4-lobed.",
      "Leaves opposite at least below inflorescence; floral tube present; flowers actinomorphic; petals cleft or emarginate; stamens in two unequal whorls; stigma entire or 4-lobed.",
      "Sepals persistent after anthesis; floral tube not prolonged beyond ovary; flowers (3 or)4 or 5(-7)-merous.",
      "Sepals deciduous after anthesis (often with floral tube); floral tube prolonged, often well beyond ovary; flowers (3 or)4-merous",
      "Chamerion  (Rafinesque) Rafinesque ex HolubCircaea  LinnaeusEpilobium  LinnaeusGaura  LinnaeusLudwigia  LinnaeusOenothera  Linnaeus"
    ],
    "authors":"Jiarui Chen, Peter C. Hoch, Peter H. Raven, David E. Boufford & Warren L. Wagner"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Passifloraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10656",
    "knowledge_content":[
      "Climbing herbs or lianas with axillary tendrils, rarely shrubs or trees, vegetative ramification through a supra-axillary bud. Leaves alternate (rarely subopposite), spirally arranged, simple or rarely compound, stipulate or not, petiolate, petiole or base of blade often with 1 to many glands; leaf blade entire or lobed, venation pinnate or palmate, often with glands on margin and abaxial surface. Inflorescence cymose, axillary, sessile or pedunculate, primary axis often a tendril, secondary axis often reduced; bracts minute to foliaceous, sometimes glandular. Pedicels articulate distal to bracts. Flowers mostly actinomorphic, bisexual, functionally unisexual, or polygamous; perianth persistent, segments free or partially fused at base. Sepals (3-)5(or 6). Petals (3-)5(or 6), imbricate. Corona inserted on hypanthium, composed of filaments or hairs often in multiple series. Stamens (4 or)5(-60), inserted on androgynophore or at base of hypanthium; filaments free to base or sometimes partially fused; anthers dorsifixed, 2-celled, dehiscing via longitudinal slits, sometimes with apical appendage. Ovary (1-)3(-5)-carpellate, superior, 1-loculed, sessile or stipitate on elongate androgynophore; placentation parietal; ovules many, anatropous; styles (1-)3(-5), free to partially fused at base; stigmas globose, capitate, papillate, or divided. Fruit a berry or loculicidally 3(-5)-valved capsule. Seeds numerous, compressed, often beaked, enclosed by fleshy aril; testa reticulate or pitted; endosperm copious, oily; embryo straight; cotyledons foliaceous.\r",
      "About 16 genera and 660 species: mainly in tropical and subtropical areas, particularly diverse in the New World tropics; two genera and 23 species (seven endemic, seven introduced) in China.",
      "Androgynophore absent or short; flowers small, unisexual or polygamous; inner corona lacking, outer corona reduced; fruit a capsule."
    ],
    "authors":"Yinzheng Wang, Shawn E. Krosnick, Peter Møller Jørgensen & David Hearn"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Rhizophoraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10767",
    "knowledge_content":[
      "Trees or shrubs, evergreen, without spines, often with aerial roots. Stem nodes swollen. Stipules interpetiolar, sheathing terminal bud, caducous. Leaves simple, opposite or distichous, petiolate; leaf blade leathery, usually glabrous, margin entire, serrulate near apex, or completely serrulate. Inflorescences axillary, dense cymes. Flowers bisexual, actinomorphic; hypanthium present [or absent]. Calyx lobes 4-16, inserted on rim of hypanthium, free or scarcely connate a base, valvate, persistent in fruit. Petals usually as many as sepals, free, usually caducous, margin entire, lacerate, or 2-cleft. Stamens twice as many as calyx lobes; anther locules 4 to many, dehiscing longitudinally or by an adaxial valve. Hypogynous disk present or absent. Ovary inferior or half-inferior; carpels 2-5(-20), 2-8-loculed; ovules usually 2 per locule, pendulous; style 1; stigma entire, capitate, or lobed. Fruit pulpy or leathery, indehiscent. Seeds 1 to few, viviparous; seedling (propagule) 7-80 cm when shed (except in Carallia and Pellacalyx).\r",
      "About 17 genera and 120 species: tropics and subtropics; six genera and 13 species (three endemic) in China.",
      "Ko Wan-cheung. 1983. Rhizophoraceae. In: Fang Wen-pei & Chang Che-yung, eds., Fl. Reipubl. Popularis Sin. 52(2): 125-143.",
      "Trees or shrubs of coastal mangrove ecosystems; seeds germinating and hypocotyls growing from fruit while attached to parent plant",
      "Stipules flat, free; free part of calyx tubular, lobed only apically; stamens attached to mouth of calyx tube.",
      "Calyx lobes 4; petals entire, lanceolate; anther locules many, opening by adaxial valve; trunk with stilt roots",
      "Calyx lobes 5-16; petals 2-lobed, many-cleft, or with apical appendages; anther locules 4, opening by lengthwise slits; trunk without stilt roots",
      "Bruguiera  SavignyCarallia  RoxburghCeriops  ArnottKandelia  (Candolle) Wight & ArnottPellacalyx  KorthalsRhizophora  Linnaeus"
    ],
    "authors":"Haining Qin & David E. Boufford"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Stachyuraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10844",
    "knowledge_content":[
      "Shrubs or small trees, sometimes climbing, deciduous or evergreen; branchlets conspicuously pithy, most often glabrous, occasionally puberulous when young. Winter buds small, with 2-4 scales. Leaves simple, alternate; stipules caducous, linear-lanceolate; leaf blade membranous to leathery, margin serrate. Racemes or spikes axillary, erect or nodding. Flowers small, regular, bisexual, or plant dioecious, shortly pedicellate or sessile; bracteoles connate at base. Sepals 4, imbricate. Petals 4, imbricate. Stamens 8 in 2 series; filaments subulate; anthers versatile, introrsely longitudinally dehiscent. Ovary superior, 4-loculed; ovules numerous on intrusive-parietal placentae; style short; stigma capitate, shallowly 4-lobed. Fruit a berry, pericarp leathery. Seeds numerous, small, with soft arils; endosperm fleshy; embryo straight; cotyledons elliptic; radicle short. 2n = 24.\r",
      "Although the familial status of the Stachyuraceae has been generally accepted, its systematic position has been long controversial. It was considered related to Actinidiaceae, Clethraceae, Crossosomataceae, Flacourtiaceae, Hamamelidaceae, Staphyleaceae, Theaceae, or Violaceae by different authors based on evidence from embryology, seed anatomy, wood anatomy, palynology, or rbcL sequence data.The reader may also wish to refer to two other recent studies of the family, by Chen (Acta Bot. Yunnan. 3: 125-137. 1981) and Tang et al. (Acta Phytotax. Sin. 21: 236-253. 1983).Shan Hanrong. 1999. Stachyuraceae. In: Ku Tsuechih, ed., Fl. Reipubl. Popularis Sin. 52(1): 81-96."
    ],
    "authors":"Qiner Yang & Peter Stevens"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Tamaricaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10868",
    "knowledge_content":[
      "Shrubs, subshrubs, or trees. Leaves small, mostly scale-like, alternate, estipulate, usually sessile, mostly with salt-secreting glands. Flowers usually in racemes or panicles, rarely solitary, usually hermaphroditic, regular. Calyx 4- or 5-fid, persistent. Petals 4 or 5, free, deciduous after anthesis or sometimes persistent. Disk inferior, usually thick, nectarylike. Stamens 4, 5, or more numerous, usually free, inserted on disk, rarely united into fascicle at base, or united up to half length into a tube. Anthers 2-thecate, longitudinally dehiscent. Pistil 1, consisting of 2-5 carpels; ovary superior, 1-loculed; placentation parietal, rarely septate, or basal; ovules numerous, rarely few; styles short, usually 2-5, free, sometimes united. Capsule conic, abaxially dehiscent. Seeds numerous, hairy throughout or awned at apex; awns puberulous from base or from middle; endosperm present or absent; embryo orthotropous.\r",
      "Three genera and ca. 110 species: steppe and desert regions of the Old World; three genera and 32 species (12 endemic) in China.",
      "Myrtama has been placed alternatively in Myricaria, Tamarix, or treated as a separate genus (see Gaskin et al., Ann. Missouri Bot. Gard. 91: 402-410. 2004; Zhang et al., Acta Bot. Boreal.-Occid. Sin. 20: 421-431. 2000).Zhang Pengyun & Zhang Yaojia. 1990. Tamaricaceae. In: Li Hsiwen, ed., Fl. Reipubl. Popularis Sin. 50(2): 142-177.",
      "Dwarf shrubs or subshrubs; flowers solitary on main branch or at apices of shortened lateral branches, with 2 appendages inside petals; seeds hairy throughout, apex awnless, with endosperm.",
      "Larger shrubs or trees; flowers clustered into racemes or spikes, without appendages inside petals; seeds with hairy awns at apex, without endosperm",
      "Stamens 4 or 5, as many as and ca. as long as petals, equal in length, filaments separate; styles 3 or 4, short; awns at apex of seeds shorter, villous at base; leaves scale-like, very small, 1-7 mm.",
      "Stamens 10, ca. 2 × as long as petals, unequal in length, filaments united into tube at base or in lower half; styles absent; awns at apex of seeds villous only in upper half; leaves compressed-flat, oblong or linear, to 1.5 cm."
    ],
    "authors":"Qiner Yang & John Gaskin"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Tetramelaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20312",
    "knowledge_content":[
      "Trees deciduous [or evergreen], large, often buttressed, with soft wood, dioecious. Leaves alternate, long-petiolate; leaf blade simple, pubescent [or glabrous], lepidote, palmately 3-5-veined, margin entire or dentate. Inflorescences long, pendent spikes clustered at stem apices, male ones mostly branched, female ones usually simple [or axillary, solitary, simple spikes]. Bracts deciduous. Male flowers: calyx lobes 4-8, equal or unequal; petals absent [or 6-8, erect, greenish, narrowly triangular]; stamens 4-8, antesepalous; filaments elongate, somewhat flattened subulate; anthers basifixed, introrse or extrorse, incurved in bud, relatively short and ovoid, or if larger and ± oblong then conspicuously recurved; sterile ovary present or sometimes absent. Female flowers: calyx lobes 4-8, free or connate below ovary; petals and staminodes absent; ovary inferior, 1-loculed, with 4-8 parietal placentas; ovules numerous; styles 4-8, antesepalous, short, stout, with large, capitate or obliquely oblong-decurrent stigmas. Fruit a capsule, dehiscing apically between persistent styles [or shedding exocarp and dehiscing longitudinally]. Seeds numerous, ovoid or fusiform, tiny.\r",
      "Two genera and two species: from India and Nepal through tropical SE Asia to Australia and the Solomon Islands; one species in China.",
      "The other genus, Octomeles Miquel, comprises the single species O. sumatrana Miquel (O. moluccana Teijsmann & Binnendijk ex Hasskarl), which occurs in Indonesia, Malaysia (Sabah), New Guinea, the Philippines, and the Solomon Islands. It is a large tree like Tetrameles, but differs in the features enclosed in square brackets in the above description, as well as in having (5 or)6-8-merous flowers (vs. 4(or 5)-merous flowers in Tetrameles).In the past, Octomeles and Tetrameles have been included together with Datisca Linnaeus to comprise the Datiscaceae. However, that group would be paraphyletic unless Begoniaceae were included. Therefore, two families are recognized here: Datiscaceae, comprising Datisca only, and Tetramelaceae, comprising the other two genera. Zhang et al. (Molec. Phylogen. Evol. 39: 305-322. 2006) placed Tetramelaceae as sister to Datiscaceae + Begoniaceae, although the latter clade had less than 50% support. The same authors placed Tetramelaceae + Datiscaceae + Begoniaceae as sister to Cucurbitaceae.Datisca comprises two species: D. glomerata (C. Presl) Baillon, from W North America, and D. cannabina Linnaeus (including D. nepalensis D. Don). Datisca cannabina is a large, perennial, dioecious herb with pinnate leaves, and is distributed from the E Mediterranean (Crete) to the Himalayas, including countries adjoining W China from Kazakhstan to Nepal. It grows in moist places, often by streams in forests, and might yet be found in SW Xinjiang or SW Xizang.Li Yanhui. 1999. Tetramelaceae. In: Ku Tsuechih, ed., Fl. Reipubl. Popularis Sin. 52(1): 123-125."
    ],
    "authors":"Yinzheng Wang & Nicholas J. Turland"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Thymelaeaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10894",
    "knowledge_content":[
      "Shrubs or small trees, rarely herbs, evergreen or deciduous. Bark tough and fibrous. Leaves opposite or alternate, rarely some ternate, estipulate; blade simple, entire, pinnately veined, articulate at base. Plants mostly bisexual, sometimes dioecious. Inflorescences terminal or subterminal, less often axillary, sometimes on brachyblasts, sessile or pedunculate, basically racemose, sometimes capitate, spicate, umbelliform, or fascicled. Flowers usually actinomorphic, bisexual or unisexual (plants then mostly dioecious), bracteate (sometimes bracts forming an involucre) or ebracteate, sessile or pedicellate. Calyx tubular, campanulate, or infundibuliform, usually corollalike, 4- or 5(or 6)-merous, mostly caducous, sometimes circumscissile, or persistent; lobes imbricate. Petals absent or represented by 4-12 scales, inserted at or near throat of calyx tube (Aquilaria). Stamens 2 to many, usually as many as calyx lobes and opposite them or twice as many. Hypognous disk usually present at base of ovary, scalelike, annular or cup-shaped, sometimes absent. Ovary superior, 1- or 2-loculed, sessile or shortly stipitate; ovules solitary in each locule, pendulous, anatropous; style filiform, caducous, sometimes very short or obscure, terminal or eccentric; stigma capitate, globose, subglobose, subclavate, or pyramidal, sometimes papilose. Fruit mostly indehiscent, dry or fleshy, sometimes a loculicidal capsule (Aquilaria). Seeds with or without endosperm, embryo straight.\r",
      "About 48 genera and ca. 650 species: widely distributed in both hemispheres; nine genera and 115 species (89 endemic) in China.",
      "The phloem contains very strong fibers, which make the bark of many species very suitable for the manufacture of high-quality paper such as that used for bank notes. The stems are extremely supple and difficult to break and are used as a substitute for string. Most species are poisonous and some are important medicinally.\"Stellera formosana\" (H. L. Li, Woody Fl. Taiwan, 619. 1963) and \"Daphne formosana\" (Halda, Genus Daphne, 83. 2001) were not validly published because they were based on \"Chamaejasme formosana\" (Hayata, Icon. Pl. Formosan. 6 [Gen. Ind. Fl. Formos.]: 64. 1917), which was itself not validly published because it lacked a description or diagnosis. The illustrations suggest that this plant is a species of Daphne. It was described as having a circumscissile calyx, which, if true, would exclude it from Daphne, and 4-merous flowers not enclosed in any bracts, which would place it in Diarthron. The specimens listed by Hayata proved to be Daphne arisanensis, but the material described and illustrated by Li and Halda is clearly not that species nor any of the other species recorded from Taiwan. This apparently distinctive endemic must remain effectively nameless until authentic material can be located to serve as a type and a validating description can be published in the appropriate genus.Huang Shuchung & Zhang Zerong. 1999. Thymelaeaceae. In: Ku Tsuechih, ed., Fl. Reipubl. Popularis Sin. 52(1): 287-400.",
      "Calyx with petaloid appendages adnate to or inserted in throat; ovary 2-loculed; fruit a loculicidal capsule; trees.",
      "Calyx without petaloid appendages; ovary 1-loculed; fruit an indehiscent berry, drupe, or nut; shrubs, subshrubs, or herbs, sometimes a small tree",
      "Annual herbs, mainly branched well above base, roots not thickened; hypogynous disk very reduced or absent; inflorescence terminal, lax, elongated, spikelike; calyx tube 2-4 mm.",
      "Perennials, if herbaceous or suffrutescent then with stems rarely branched above base and roots often thickened; hypogynous disk present; inflorescence a compact raceme, spike, or head, sometimes grouped into panicles, or axillary fascicles subtended by normal leaves; calyx tube (2-)5-20 mm",
      "Inflorescence sessile, or if pedunculate, flower buds not enclosed within an involucre; calyx lobes spreading at anthesis",
      "Inflorescences long pedunculate, flower buds enclosed in conspicuous calyxlike involucre; calyx lobes erect at anthesis",
      "Hypogynal disk of distinct scales, inflorescences racemose, paniculate, or spicate, less often capitate; leaves opposite or alternate.",
      "Hypogynal disk annular and oblique or cup-shaped, margins entire or lobed to parted or developed on one side, inflorescences capitate or fascicled, rarely spicate or racemose; leaves usually alternate, rarely opposite.",
      "Inflorescence a panicle of many terminal and subterminal (3 or)4(-7)-flowered heads, calyx red within.",
      "Aquilaria  LamarckDaphne  LinnaeusDiarthron  TurczaninowEdgeworthia  MeisnerEriosolena  BlumeRhamnoneuron  GilgStellera  LinnaeusThymelaea  MillerWikstroemia  Endlicher"
    ],
    "authors":"Yinzheng Wang, Michael G. Gilbert, Brian F. Mathew, Christopher Brickell & Lorin I. Nevling"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Trapaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10904",
    "knowledge_content":[
      "Herbs annual, aquatic, rooted or floating. Stem submerged, slender, unbranched, internodes elongate; adventitious roots developing from leaf scars, highly dissected, leaflike, photosynthetic. Leaves dimorphic; stipules deeply cleft; submerged leaves opposite, sessile, simple, linear, caducous; floating leaves crowded terminally into a rosette, petiolate; petiole inflated about the middle; leaf blade rhombic to deltoid, distal half of margin coarsely dentate. Flowers solitary in upper leaf axils, flowering at water surface, bisexual, 4-merous, actinomorphic. Floral tube (hypanthium) developed, partly epigynous. Sepals 4, valvate, persistent as hardened horns of fruit. Petals 4, white or lilac, deciduous. Stamens 4, antesepalous; anthers introrse, versatile. Ovary surrounded by a coronary disk, partly inferior, becoming inferior in fruit, 2-loculed; ovules anatropous, pendulous, 1 per locule, 1 ovule undeveloped after anthesis; placentation axile. Stigma capitate, deciduous. Fruit indehiscent, (0-)2-4-horned, turbinate, cup-shaped, or elongate rhombic, exocarp succulent, ephemeral, endocarp stony, with a thin to prominent crest between and along horns, fruit topped by a dome-shaped or tetragonal to rounded crown, crown apex a pointed beak or tuft of hairs. Seed 1; cotyledons unequal, 1 large, starchy, retained in fruit, 1 small, scalelike, germinating from fruit apex, through pore of stylar canal; endosperm absent.\r",
      "One genus and two species: subtropical and temperate regions of Africa, Asia, and Europe; introduced in Australia and North America; two species in China.",
      "Trapa is allied morphologically to the Lythraceae by the partly inferior position of the ovary together with a host of other features, including basically opposite, simple leaves, development of the floral tube which persists in fruit, valvate sepals, 4-merous flowers, introrse and versatile anthers, axile placentation, and seeds without endosperm. Trapa is sufficiently similar to the Lythraceae and Onagraceae to have been considered for membership within either family or, as has been done here, as a closely related family. Molecular evidence suggests the closest relative is Sonneratia (Lythraceae).Dimensions for the fruit body are described as height × width × thickness.Wan Wenhao. 2000. Trapaceae. In: Chen Chiajui, ed., Fl. Reipubl. Popularis Sin. 53(2): 1-26."
    ],
    "authors":"Jiarui Chen, Bingyang Ding & Michele Funston"
  },
  {
    "group_title":"Clusiaceae through Araliaceae",
    "family":"Violaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10944",
    "knowledge_content":[
      "Herbs annual or perennial, shrubs, or subshrubs, sometimes scandent, rarely small trees. Leaves simple, usually alternate, sometimes opposite, with small or leaflike stipules, petiolate, margin entire, serrate, or dissected. Flowers bisexual or unisexual, rarely polygamous, actinomorphic or zygomorphic, solitary or in axillary or terminal, spicate, paniculate, or racemose inflorescences, 2-bracteolate, sometimes cleistogamous. Sepals 5, equal or unequal, imbricate, persistent. Petals 5, imbricate or convolute, unequal, anterior one usually larger than others, saccate, gibbous or spurred at base. Stamens 5; anthers erect, free or connivent or connate, connectives often dilated into membranous appendages; filaments very short or absent, anterior 2 stamens with spurlike nectary at base. Ovary superior, 1-loculed, 3-5-carpelled, syncarpous, with 3-5 parietal placentae each with 1 to many anatropous ovules; style simple; stigmas variously shaped. Fruit a loculicidal capsule, usually with elastic and abaxially carinate valves, rarely baccate. Seeds often carunculate; testa hard, nitid, often with oily bodies, sometimes alate; endosperm copious, fleshy; embryo erect.\r",
      "Twenty-two genera and 900-1000 species: worldwide, but particularly in tropical regions; three genera and 101 species (36 endemic, three introduced) in China.",
      "Shrubs or trees; inflorescences mostly more than 5-flowered; flowers actinomorphic, not spurred, not cleistogamous.",
      "Herbs or subshrubs; inflorescences 1-3-flowered; flowers distinctly zygomorphic (lowest petal spurred), or cleistogamous"
    ],
    "authors":"Yousheng Chen, Qiner Yang, Hideaki Ohba & Vladimir V. Nikitin"
  },
  {
    "group_title":"Apiaceae through Ericaceae",
    "family":"Apiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10052",
    "knowledge_content":[
      "Authors: Menglan She, Fading Pu, Zehui Pan, Mark Watson, John F. M. Cannon, Ingrid Holmes-Smith, Eugene V. Kljuykov, Loy R. Phillippe & Michael G. Pimenov",
      "Herbs, annual or perennial, rarely woody at base. Caulescent or acaulescent, stem hollow or solid. Leaves alternate, rarely opposite or basal; petiole usually sheathing at base; stipules absent (except in subfam. Hydrocotyloideae); leaf blade compound or sometimes simple, usually much incised or divided, pinnatifid to pinnatisect, or ternate-pinnately decompound. Flowers epigynous, small, bisexual or staminate (unisexual male), regular, in simple or compound umbels; umbellules few to many-flowered; rays often subtended by bracts forming a involucre; umbellules (sometimes called umbellets) usually subtended by bracteoles forming an involucel. Pedicels long, short or obsolete (then forming a capitate umbellule). Calyx tube wholly adnate to the ovary; calyx teeth (sometimes called sepals) small or obsolete, forming a ring around the top of the ovary. Ovary inferior, 2-celled, with one anatropous ovule in each locule. Styles 2, usually swollen at the base forming a stylopodium which often secretes nectar. Fruit dry, of two mericarps united by their faces (commissure), and usually attached to a central axis (carpophore), from which the mericarps separate at maturity; mericarps are variously flattened dorsally, laterally or terete; each mericarp has 5 primary ribs, one down the back (dorsal rib), two on the edges near the commissure (lateral ribs), and two between the dorsal and lateral ribs (intermediate ribs), occasionally with four secondary ribs alternating with the primary, the ribs filiform to broadly winged, thin or corky; vittae (oil-tubes) usually present in the furrow (intervals between the ribs sometimes called the valleculae) and on the commissure face, rarely also in the pericarp, sometimes obscure. Each mericarp 1-seeded, splitting apart at maturity. Seed face (commissural albumen) plane, concave to sulcate.\r",
      "Between 250 and 440(–455) genera and 3300–3700 species: widely distributed in the temperate zone of both hemispheres, mainly in Eurasia and especially in C Asia; 100 genera (ten endemic) and 614 species (340 endemic) in China.",
      "Although many members of this family have distinctive vegetative and floral features, providing a useful key to identify the many genera in China presents several difficulties. First, the classification of genera and generic groupings has been largely based on the morphology and anatomy of the fruit. Thus, to construct a “good” dichotomous key with equal leads, rather than “chipping off” individual genera using unique characteristics, the use of fruit macro- and microscopic characters is unavoidable. This is even more acute when dealing with large numbers of genera. Another major problem is that several of the large genera are heterogeneous, with diffuse generic boundaries and broad patterns of variation. To try and cope with these difficulties two types of identification tool are presented here. The first is a dichotomous key that emphasizes the traditional fruit characters, and the second is a multi-access key that allows easy comparison of ten characteristics across all genera. The multi-access key is particularly useful for incomplete material, but it is worth stressing that specimens without at least developing fruit are usually very difficult to identify.\r",
      "The ten genera endemic to China are Chaerophyllopsis, Changium, Chuanminshen, Cyclorhiza, Dickinsia, Harrysmithia, Melanosciadium, Nothosmyrnium, Notopterygium, and Sinolimprichtia.\r",
      "Chinese genera of economic importance include Angelica, Bupleurum, Centella, Changium, Cnidium, Ferula, Glehnia, Heracleum, Hydrocotyle, Ligusticum, Notopterygium, and Peucedanum (medicinal); Anethum, Coriandrum, Cuminum, Foeniculum, and Pimpinella (flavoring); and Apium, Daucus, Oenanthe, and Petroselinum (vegetables).",
      "Chang Ho-tseng, Fu Kun-tsun, Ho Yeh-chi, Hsü Lon-jan, Li Yin, Liou Shou-lu, Pu Fa-ting, Shan Ren-hwa, Sheh Meng-lan, Shen Kuan-mien, Wang Tieh-seng, Yuan Chang-chi. 1979; 1985; 1992. Umbelliferae. In: Shan Ren-hwa & Sheh Meng-lan, eds., Fl. Reipubl. Popularis Sin. 55(1): 1–300; 55(2): 1–268; 55(3): 1–255.",
      "The following dichotomous key reflects the traditional classification of the genera of the Apiaceae into subfamilies, tribes, and subtribes. This classification relies heavily on characters of fruit morphology and anatomy, many of which are subject to convergent evolution (e.g., for fruit dispersal strategies). The long-held understanding that this gives rise to artificial, heterogeneous assemblages has been verified by recent molecular studies of DNA sequences. For this reason tribes and subtribes are not formally recognized in the following account; however, they are indicated in the dichotomous key and the traditional order of genera is largely retained. It is worth noting that the generic grouping within the three subfamilies is well supported by molecular evidence, the exception being Hydrocotyle and Centella which are most likely derived, herbaceous members of the Araliaceae and not Hydrocotyloideae (the residue of this subfamily is restricted to the S hemisphere).",
      "Stem creeping or ascending, rarely erect; leaves simple; leaf blade reniform or rounded-cordate; umbels simple; endocarp woody; vittae obscure or distinct, borne in the ribs, not in the furrow (subfam. Hydrocotyloideae).",
      "Stem usually erect, sometimes reduced, not creeping; leaves compound or simple; umbels compound, rarely simple or subracemous-branched to capitate; endocarp not woody; vittae distinct to obscure, borne in the primary ribs or furrows.",
      "Leaves simple, usually palmately divide to shallowly lobed; umbels simple or compound, occasionally capitate; fruit covered with scales, tubercles or prickles, rarely glabrous; styles elongate (subfam. Saniculoideae).",
      "Leaves compound, rarely simple; umbels compound, very rarely simple (acaulescent plants with sessile terminal umbel appearing simple); rays numerous, well developed; fruit glabrous or pubescent, sometimes fine-prickly or spiny; styles short or long (subfam. Apioideae).",
      "Basal leaves orbicular, rounded-cordate or cordate-pentagonal, usually palmately lobed; flowers polygamous, umbels in racemous, cymous or corymbose inflorescences.",
      "Basal leaves long-elliptic, lanceolate or oblanceolate, undivided; flowers bisexual, borne in capitate inflorescences.",
      "Fruit ribs equal, mericarp orbicular or subpentagonal cross section, usually slightly laterally compressed (tribe Ammineae).",
      "Lateral ribs of fruit winged, broader than the dorsal and intermediate ribs, mericarp slightly to strongly dorsally compressed (tribe Peucedaneae).",
      "Vittae large, 2–4 in each furrow, not forming a ring encircling the seed; fruit wall not thick, corky.",
      "Plants biennial or perennial, often aquatic or amphibious, taproots stout or with creeping rootstocks, rooting at nodes.",
      "Terrestrial herbs; outer petals of umbellule not radiant; lateral fruit ribs not corky (rarely corky-thickened, see Cortiella, Pterygopleurum).",
      "Fruit ovate-ellipsoid, slightly flattened dorsally; lateral ribs more or less broader than the dorsal; stem green.",
      "Fruit oblong or ellipsoid, slightly to strongly flattened dorsally; mericarps not pentagonal in cross section; ribs unequal, lateral wings much broader than dorsal.",
      "Fruit ovoid-oblong or ellipsoid, slightly flattened laterally or dorsally, usually terete; mericarp pentagonal in cross section; all ribs equal or subequal.",
      "Lateral fruit ribs broadly winged, wings more than 2 × width of dorsal ribs; calyx teeth well developed, often equaling or exceeding the stylopodium.",
      "Leaves 1–2-pinnate or ternate-pinnate, ultimate segments long-lanceolate, entire; fruit ribs corky-dilated at base.",
      "Leaves 2–3-pinnate, ultimate segments ovate-lanceolate to linear, usually serrate or lobed; wings thickened but not corky dilated at base.",
      "Lateral mericarp wings divergent at maturity, lateral wings ca. 2 × broader than dorsal wings (subtribe Angelicineae).",
      "Lateral mericarp wings adnate or closely appressed at maturity, lateral wings less than 2 × broader \r",
      "Flowers often bisexual, male flowers only in the upper lateral umbels; stylopodium base usually undilated, entire.",
      "Fruit ribs corky-thickened, dorsal and intermediate ribs rounded, very prominent, lateral ribs broadly winged.",
      "Calyx teeth obsolete or inconspicuous; bracts present, bracteoles many; lateral ribs of fruit conspicuously winged.",
      "Calyx teeth conspicuous, subulate or triangular-subulate; bracts and bracteoles absent or occasionally bracteoles 1–2, caducous; lateral ribs of fruit thickened, slightly winged.",
      "Petals yellow, equal, apex obtuse-rounded or truncate with an inflexed lobule; fruit vittae long, filiform, extending to fruit base.",
      "apex 2-lobed, with a narrowly inflexed lobule; fruit vittae short, clavate, not extending to fruit base, or long, filiform extending to base.",
      "Fruit vittae short, clavate, usually not extending to base (very rarely filiform and extending to base), fruit glabrous or glabrescent.",
      "Fruit oblong or slightly elongate, cylindrical, beaked; druse crystals abundant in parenchyma surrounding carpophore (tribe Scandicineae).",
      "Fertile flowers without radiant petals; secondary fruit ribs hidden by the dense glochidiate prickles or tubercles.",
      "Fruit ribs winged (or unwinged and corky-thickened); mericarp pentagonal in cross section or slightly flattened dorsally.",
      "Leaves 1–2-pinnate, rarely undivided, ultimate segments oblanceolate, obovate or long-ovate; petals white, yellow or purple.",
      "Petals white or pinkish, apex narrow, inflexed; fruit ribs usually undulate, cristate or semi-winged.",
      "Bracteoles herbaceous, often falling in fruit; umbellules not densely crowded (pedicels conspicuous)."
    ],
    "authors":"Menglan She, Fading Pu, Zehui Pan, Mark Watson, John F. M. Cannon, Ingrid Holmes-Smith, Eugene V. Kljuykov, Loy R. Phillippe & Michael G. Pimenov"
  },
  {
    "group_title":"Apiaceae through Ericaceae",
    "family":"Aucubaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20038",
    "knowledge_content":[
      "Trees or shrubs, dioecious; branches opposite, cylindrical. Leaves opposite, estipulate, petiolate, simple, pinnately veined; leaf blade abaxially light green, adaxially deep green and shiny, dark brown when dry, some species variegated with yellow or white markings, thickly leathery to papery, pubescent or glabrous, margin serrate or dentate, rarely entire. Inflorescences terminal, paniculate or racemose-paniculate. Flowers 4-merous, unisexual, actinomorphic, subtended by 1 or 2 bracteoles. Stamens 4, alternate petals. Ovary inferior, carpel 1, locule 1; ovule 1, pendulous; style short, thick; stigma capitate, straight or curving, slightly 2–4-lobed. Fruit drupes, fleshy, red when mature, black when dry, crowned with persistent calyx teeth, style, and stigma.\r",
      "One genus and ten species: Bhutan, China, N India, Japan, Korea, Myanmar, Sikkim, Vietnam; ten species (seven endemic) in China.",
      "Aucuba, previously placed in the Cornaceae, has been included in the Garryaceae on the basis of molecular, chemical, and morphological evidence (Bremer et al., Pl. Syst. Evol. 229: 137–169. 2001). Aucuba and Garrya Douglas ex Lindley, the latter genus from Central America (including the Greater Antilles) and W North America, are sister taxa with high support (Angiosperm Phylogeny Group, Bot. J. Linn. Soc. 141: 399–436. 2003). It is here preferred to treat the two genera in separate families: Aucubaceae and Garryaceae.",
      "Soong Tzepu. 1990. Aucuba. In: Fang Wenpei & Hu Wenkuang, eds., Fl. Reipubl. Popularis Sin. 56: 6–20."
    ],
    "authors":"Jenny Qiuyun Xiang & David E. Boufford"
  },
  {
    "group_title":"Apiaceae through Ericaceae",
    "family":"Clethraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10200",
    "knowledge_content":[
      "Trees or shrubs, evergreen or deciduous. Buds, branches, leaf blades, inflorescences, and flowers with sparse to dense usually stellate hairs, often mixed with simple hairs. Branches sympodial, usually pubescent at least when young. Stipules absent. Leaves alternate, simple, generally crowded near apex of twigs; leaf blade usually abaxially ± pubescent and adaxially glabrous or glabrescent, margin serrate or occasionally entire. Inflorescences terminal, usually a many-flowered slender raceme, either solitary or umbellate-clustered, sometimes sparsely branched near base and thus appearing paniculate, pubescent, bracteate. Flowers bisexual, actinomorphic. Pedicel articulated at base of sepals. Sepals 5, imbricate, persistent. Petals 5, usually white, free or coherent at base, oblong to obovate, inside often pilose from base to middle, apical margin often fimbriate, apex rounded- to truncate-emarginate. Stamens 10, in 2 whorls, distinct but generally adnate to base of petals; anthers inverted at anthesis, ± V-shaped, introrse, papillose, opening by short apical pores. Ovary superior, 3-locular, globose but apically depressed at style base, pubescent, with axile placentation; ovules 20–40 per locule. Style 1, persistent, apex usually 3-cleft or -lobed. Capsule subglobose to globose, pubescent, 3-locular. Seeds many, ovoid-subtrigonous, thin-walled, surface impressed-reticulate.\r",
      "One genus and ca. 65 species: America, Asia, N Atlantic Islands (Madeira); seven species (three endemic) in China.",
      "Hu Lingcheng. 1990. Clethraceae. In: Fang Wenpei & Hu Wenkuang, eds., Fl. Reipubl. Popularis Sin. 56: 120–156."
    ],
    "authors":"Haining Qin & Peter Fritsch"
  },
  {
    "group_title":"Apiaceae through Ericaceae",
    "family":"Cornaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10219",
    "knowledge_content":[
      "Trees or shrubs, rarely rhizomatous herbs, mostly deciduous, sometimes evergreen, hermaphroditic [dioecious in African species]. Old branches terete, pith white or brown, lenticels and leaf scars often conspicuous; young branches rounded or slightly 4-ridged; nodes slightly swollen. Leaves opposite, rarely alternate or whorled, estipulate, petiolate, rarely sessile; leaf blade simple, entire, pinnately veined, rarely parallel veined, often pubescent, sometimes papillate; trichomes often 2-armed, arms equal or unequal, appressed and T-shaped, or raised and V- or Y-shaped, or pseudofiliform. Inflorescences cymose, paniculate, corymbose, umbellate, or capitulate, terminal, rarely lateral; bracts minute, not petaloid, early caducous, or 4(–6) and usually showy. Flowers 4-merous. Calyx tubular, fused to ovary, minutely 4-dentate or truncate. Petals 4, free, creamy white or yellow, rarely dark reddish purple or partially dark reddish purple, valvate. Stamens 4, surrounding a fleshy floral disk, alternate petals. Anthers longitudinally dehiscent. Ovary inferior; carpels 2, rarely 3 or 4; locules 2, rarely 3 or 4; ovules pendulous, 1 per locule; style 1, columnar or clavate; stigma capitate, disciform, punctate, or truncate, sometimes slightly 2-lobed. Fruit a drupaceous berry, white, blue, red, or black, berries distinct or fused into a fleshy syncarpous compound fruit; stone of fruit bony, 1- or 2(–4)-chambered, seeds 1 or 2(–4); endosperm oily; cotyledons 2, leaflike.\r",
      "One genus and ca. 55 species: widespread in N temperate regions, extending to tropical and boreal areas, one species in tropical Africa and one or two species in South America; 25 species (14 endemic) in China.",
      "The family is treated here in the strict sense, excluding Alangium (Alangiaceae), Aucuba (Aucubaceae), Davidia (Davidiaceae), Helwingia (Helwingiaceae), Mastixia (Mastixiaceae), Nyssa (Nyssaceae), and Toricellia (Toricelliaceae), all of which have sometimes been placed in the Cornaceae. The Cornaceae in the FRPS included Mastixia, Cornus sensu lato, Aucuba, Helwingia, and Toricellia. Given that the latter three genera are allied with higher asterids in broad phylogenetic analyses, they are, therefore, removed from the Cornaceae in this treatment. These genera are recognized in the present volume as three families following Takhtajan (Sist. Magnoliofit. 1987). Based on molecular data, Mastixia is a close relative, but not the sister of, Cornus. Its relationships to Cornus and close relatives remain unclear. Thus, we also treat Mastixia as a family separate from Cornaceae. Although molecular data have suggested that Alangium is a member of Cornaceae, the genus will be treated as a separate family in a different volume of the Flora of China. This treatment of Cornaceae therefore includes only Cornus sensu lato.\r",
      "The circumscription of the Cornaceae and the relationships among the 17 genera often placed within it have been controversial. The family has been defined as consisting of a single genus, Cornus, or up to as many as 15 genera by various authors (e.g., Harms, Ber. Deutsch. Bot. Ges. 15: 19–29. 1898; Takhtajan, Sist. Magnoliofit. 1987; Cronquist, Integr. Syst. Classif. Fl. Pl. 1988; Angiosperm Phylogeny Group, Ann. Missouri Bot. Gard. 85: 531–553. 1998; see also Xiang et al., Ann. Missouri Bot. Gard. 80: 723–734. 1993; Xiang & Soltis in Boufford & Ohba, Sino-Jap. Fl. Charact. Diversif. 123. 1998). Recent phylogenetic analyses of the chloroplast gene rbcL sequences (Xiang et al., loc. cit. 1993; Xiang & Soltis, loc. cit. 1998; Xiang, Harvard Pap. Bot. 4: 527–542. 1999) suggested that nine genera (Aralidium, Aucuba, Corokia, Garrya, Griselinia, Helwingia, Kaliphora, Melanophylla, and Toricellia) were not closely related to Cornaceae. Evidence from other studies, including pollen morphology and wood anatomy (Li & Chao, Quart. J. Taiwan Mus. 7: 119–136. 1954; Ferguson & Hideux, Proc. IV Int. Palynol. Conf., Lucknow 1: 240. 1980; Noshiro & Baas, IAWA J. 19: 43–97. 1998; see also Eyde, Bot. Rev. 54: 233–351. 1988), support the removal of these genera from Cornaceae. Various phylogenetic analyses of the rbcL and other chloroplast gene sequences identified a strongly supported monophyletic Cornales consisting of Alangium, Camptotheca, Cornus, Curtisia, Davidia, Diplopanax, Hydrangeaceae, Hydrostachyaceae, Grubbiaceae, Loasaceae, Mastixia, and Nyssa (Chase et al., Ann. Missouri Bot. Gard. 80: 528–580. 1993; Xiang & Soltis, loc. cit. 1998; Xiang, loc. cit. 1999; Olmstead et al., Molec. Phylogen. Evol. 16: 96–112. 2000; Savolainen et al., Kew Bull. 55: 257–309. 2000; Savolainen et al., Syst. Biol. 49: 306–362. 2000; Soltis et al., Bot. J. Linn. Soc. 133: 381–461. 2000; Albach et al., Ann. Missouri Bot. Gard. 88: 163–210. 2001; Albach et al., Taxon 50: 781–805. 2001). Phylogenetic analyses of the rbcL and matK sequences for the Cornales suggested a Cornaceae consisting of Alangium and Cornus, a Grubbiaceae consisting of Curtisia and Grubbia (Xiang et al., Amer. J. Bot. 85: 285–297. 1998; Xiang, loc. cit. 1999; Xiang et al., Molec. Phylogen. Evol. 24: 35–57. 2002; Fan & Xiang, Amer. J. Bot. 90: 1357–1372. 2003). The Cornaceae of Eyde (loc. cit. 1988), consisting of Camptotheca, Cornus, Davidia, Diplopanax, Mastixia, and Nyssa, were not supported by molecular data.\r",
      "The hard wood of several species of Cornus is used for making farming tools. The fruit of some species is used for food or as a source of industrial oil. Cornus mas Linnaeus is cultivated in China for medicinal uses. Many species are widely cultivated as ornamentals, e.g., C. alba, C. canadensis, C. controversa, C. florida Linnaeus, C. kousa, C. mas, C. nuttallii Audubon, and C. stolonifera Michaux.\r",
      "Hu Wenkuang. 1990. Bothrocaryum, Swida, Cornus, Dendrobenthamia, and Chamaepericlymenum. In: Fang Wenpei & Hu Wenkuang, eds., Fl. Reipubl. Popularis Sin. 56: 38–108.",
      "Cornus  LinnaeusCornus subg. Arctocrania  EndlicherCornus subg. Cornus Cornus subg. Kraniopsis  RafinesqueCornus subg. Mesomera  RafinesqueCornus subg. Syncarpea  (Nakai) Q. Y. XiangCornus subg. Yinquania  (Z. Y. Zhu) Q. Y. Xiang & Boufford"
    ],
    "authors":"Jenny Qiuyun Xiang & David E. Boufford"
  },
  {
    "group_title":"Apiaceae through Ericaceae",
    "family":"Diapensiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10265",
    "knowledge_content":[
      "Shrublets or perennial herbs, prostrate or decumbent, evergreen, mostly glabrous. Stipules absent. Leaves simple, spirally arranged or alternate, often crowded, subsessile or petiolate, pinnately veined. Flowers bisexual, actinomorphic, solitary or in a capitate raceme. Calyx 5-lobed, persistent; lobes free, imbricate. Corolla basally connate, apically lobed, caducous; lobes 5, spreading. Stamens 5[or 10], epipetalous, alternate with corolla lobes if 5; staminodes 5 if present, epipetalous, opposite corolla lobes, scalelike or spatulate; anthers 1- or 2-celled, dehiscing by slits. Ovary superior, 3[or 5]-locular; ovules numerous, axile, anatropous or amphitropous. Style simple; stigma lobed, capitate, or disciform. Fruit a 3[or 5]-locular capsule, loculicidally dehiscing. Seeds many, small, cylindrical; endosperm copious; embryo straight or slightly curved.\r",
      "Six genera and ca. 15 species: Asia, Europe, North America; three genera (one endemic) and six species (three endemic) in China.",
      "Chang Cheyung. 1990. Diapensiaceae. In: Fang Wenpei & Hu Wenkuang, eds., Fl. Reipubl. Popularis Sin. 56: 109–119."
    ],
    "authors":"Haining Qin & Bruce Bartholomew"
  },
  {
    "group_title":"Apiaceae through Ericaceae",
    "family":"Ericaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10316",
    "knowledge_content":[
      "Authors: Mingyuan Fang, Ruizheng Fang, Mingyou He, Linzheng Hu, Hanbi Yang, Haining Qin, Tianlu Min, David F. Chamberlain, Peter Stevens, Gary D. Wallace & Arne Anderberg",
      "Plants usually woody, or herbs, sometimes lacking chlorophyll. Leaves spiral, sometimes decussate, margin often toothed. Inflorescence racemose; bracteoles paired, basal. Flowers (4 or)5-merous. Calyx imbricate. Corolla connate, imbricate. Stamens 10, sometimes with spurs or awns, dehiscing by pores, pollen in tetrads, rarely single. Ovary superior or inferior, placentation axile, rarely parietal, often many ovules per locule. Style ± as long as corolla, slender. Fruit a capsule or berry, rarely a drupe; calyx persistent.\r",
      "About 125 genera and 4000 species: widely distributed in temperate and subarctic regions, also at high elevations in tropical regions; 22 genera and 826 species (524 endemic) in China.",
      "The Monotropoideae are here included in the Ericaceae; previously in FRPS (56: 157–216. 1990), they were treated as the Pyrolaceae. Chiogenes, recorded from China in FRPS (57(3): 69–71. 1991), is here included in Gaultheria. Over the last half century, the Empetraceae have usually been separated from, but closely associated with, the Ericaceae. In their ecology, leaf morphology and insertion, rusts, embryology, stamen anatomy, etc., they largely agree with that family. Molecular data place Empetrum and its relatives firmly within the Ericaceae, and in particular within the subfamily Ericoideae, in agreement with phytochemical and palynological data, and there they are best recognized as a separate tribe. There are distinctive features of the Empetreae that were responsible for their past familial status, e.g., reduced perianth with separate members, low ovule number, enlarged stigmas, etc. However, these are likely to be derived features associated with wind pollination. See Kron et al. (Bot. Rev. 68: 335–423. 2002) and the recent treatment of the Ericaceae by Stevens et al. (in Kubitzki, Fam. Gen. Vasc. Pl. 6: 145–194. 2004).\r",
      "Several genera and many species are ornamentals. Some fruits of Vaccinium in N China are sweet and edible, but of no particular value to humans. Some species of Chamaedaphne, Craibiodendron, Leucothoë, Lyonia, Pieris, and Rhododendron contain more or less toxic diterpenes, which are harmful to humans or domestic animals.",
      "Fang Rhuicheng, Yang Hanbi & Chin Tsenli. 1999. Ericaceae (1). In: Fang Rhuicheng, ed., Fl. Reipubl. Popularis Sin. 57(1): 1–213; Hu Wenkuang, Hu Lincheng, Fang Mingyuan & He Mingyou. 1994. Ericaceae (2). In: Hu Lincheng, Fang Mingyuan, ed., Fl. Reipubl. Popularis Sin. 57(2): 1–438; Hsu Tingzhi, Gao Baochun, Fang Rhuicheng & Huang Shuhua. 1991. Ericaceae (3). In: Fang Rhuicheng, ed., Fl. Reipubl. Popularis Sin. 57(3): 1–207; Chou Yiliang & Zhou Ruichang. 1990. Pyrolaceae. In: Fang Wenpei & Hu Wenkuang, eds., Fl. Reipubl. Popularis Sin. 56: 157–216; Ming Tien lu. 1980. Empetraceae. In: Cheng Mien & Ming Tien lu, eds., Fl. Reipubl. Popularis Sin. 45(1): 60–62.",
      "Subshrub; leaves along stem; flowers in corymbs or umbels, or solitary; filaments ciliate on lower half; style thick, short.",
      "Persistent calyx ± accrescent and succulent; capsule loculicidal, enclosed in fleshy calyx; anthers with \r",
      "Corolla actinomorphic or somewhat zygomorphic, funnel-shaped, campanulate, rarely rotate or cylindric, more than 10 mm; stamens exserted, rarely included; leaf blade not linear.",
      "Corolla actinomorphic, cylindric or urceolate, 4–7(–11) mm; stamens included; leaf blade linear to linear-oblong.",
      "Inflorescence shortly racemose to subcapitate; pedicels very short; corolla cylindric; anthers opening by slits.",
      "Inflorescence umbellate; pedicels elongate, 2–2.5(–4) cm; corolla urceolate; anthers opening by terminal pores.",
      "Inflorescences umbellate or corymbose, rachis abbreviated or nearly absent; corolla broadly campanulate to urceolate; seeds winged.",
      "Corolla tubular or urceolate; capsule subglobose, less than 5 mm in diam., sutures thickened; seeds wingless.",
      "Corolla shortly campanulate; capsule depressed globose, more than 10 mm in diam., sutures not thickened; seeds winged on 1 side."
    ],
    "authors":"Mingyuan Fang, Ruizheng Fang, Mingyou He, Linzheng Hu, Hanbi Yang, Haining Qin, Tianlu Min, David F. Chamberlain, Peter Stevens, Gary D. Wallace & Arne Anderberg"
  },
  {
    "group_title":"Apiaceae through Ericaceae",
    "family":"Helwingiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20143",
    "knowledge_content":[
      "Shrubs, rarely small trees, dioecious, evergreen or deciduous. Leaves simple, alternate, petiolate, stipulate; stipules 2, early deciduous, divided or not; blade margins glandular serrate or crenate; veins pinnate. Inflorescences umbels, sessile, borne on midvein of leaf blade, rarely on petiole of leaves on upper part of young branches. Flowers 3- or 4(or 5)-merous, green or purple-green, unisexual; calyx teeth 3 or 4(or 5); petals 3 or 4(or 5); floral disk flat, fleshy. Staminate flowers 3–20 per umbel; stamens 3 or 4(or 5), alternate petals; anther locules 2. Carpellate flowers 1–4 per umbel; style short; stigma lobes 3 or 4(or 5), reflexed; ovary inferior, locules 3 or 4(or 5); ovules 1 per locule, pendulous, apotropous, with dorsal raphe. Fruit berries, drupelike. Seeds (stones) 1–4(or 5), with grooves and ridges when dry, crowned by persistent calyx and style; endosperm smooth; embryo straight.\r",
      "One genus and four species: Bhutan, China, N India, Japan, S Korea, N Myanmar, Nepal, Sikkim, Thailand, N Vietnam; four species (one endemic) in China.",
      "Soong Tzepu. 1990. Helwingia. In: Fang Wenpei & Hu Wenkuang, eds., Fl. Reipubl. Popularis Sin. 56: 20–35."
    ],
    "authors":"Jenny Qiuyun Xiang & David E. Boufford"
  },
  {
    "group_title":"Apiaceae through Ericaceae",
    "family":"Mastixiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20180",
    "knowledge_content":[
      "Trees evergreen, resinous. Leaves opposite or alternate, petiolate, estipulate, simple, margin entire or rarely undulate, leathery to thickly papery, often pubescent with unicellular 2-armed trichomes, pinnately veined. Inflorescences paniculate cymes, terminal and axillary. Flowers bisexual, actinomorphic, 4- or 5-merous. Petals distinct, valvate. Anthers dorsifixed, dehiscing via longitudinal slits; pollen 3-aperturate. Ovary inferior, carpel 1, locule 1; ovule 1, pendulous; disk epigynous, fleshy; style 1, stigma punctiform, unlobed, or lobes slight, 2, 4, or 5. Fruit drupes, fleshy, or hard when dry; endocarp grooved; seed 1, endosperm fleshy; cotyledons 2, leafy; embryo small.\r",
      "Two genera and ca. 27 species: Bhutan, Cambodia, China, India, Indonesia, Laos, Malaysia, Myanmar, Papua New Guinea, Philippines, Sri Lanka, Thailand, Vietnam; Pacific Islands (Solomon Islands); two genera and four species (two endemic) in China.",
      "Recent molecular analyses suggest that Diplopanax is the sister of Mastixia (Xiang et al., Molec. Phylogen. Evol. 24: 35–57. 2002; Fan & Xiang, Amer. J. Bot. 90: 1357–1372. 2003). The close relationship between the two genera is also supported by some morphological characters (see Eyde & Xiang, Amer. J. Bot. 77: 689–692. 1990). Thus, the genus is best placed in either the Mastixiaceae or the Cornaceae sensu lato. Eyde and Xiang (loc. cit.) moved Diplopanax to the Cornaceae sensu lato (i.e., including Nyssaceae and Mastixiaceae), and Murrell (Syst. Bot. 18: 469–495. 1993) treated it as a subgenus of Mastixia in the Cornaceae. We include it here in the Mastixiaceae.",
      "Soong Tzepu. 1990. Mastixia. In: Fang Wenpei & Hu Wenkuang, eds., Fl. Reipubl. Popularis Sin. 56: 2–5; Hoo Gin & Tseng Chang-jiang. 1978. Diplopanax. In: Hoo Gin & Tseng Chang-jiang, eds., Fl. Reipubl. Popularis Sin. 54: 135–136."
    ],
    "authors":"Jenny Qiuyun Xiang, Qibai Xiang, David E. Boufford & Porter P. Lowry"
  },
  {
    "group_title":"Apiaceae through Ericaceae",
    "family":"Toricelliaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20576",
    "knowledge_content":[
      "Trees or shrubs, dioecious. Branches spreading, thick, with conspicuous leaf scars; pith soft, white, wide in relation to twig. Leaves alternate, petiolate, estipulate, simple; petiole elongate, expanding at base, sheathing; leaf blade broadly cordate to nearly orbicular, papery, unlobed or slightly lobed, lobes 5–7(–9), glabrous or pubescent, trichomes multicellular, glandular, veins palmate, 5–7(–9), margin entire or serrate. Inflorescences racemiform panicles, terminal, pendulous. Flowers unisexual, shortly pedicellate, bracteolate. Staminate flowers: calyx 5-dentate, teeth small, unequal; petals 5, narrowly elliptic, apex inflexed; stamens 5, filaments short, anthers oblong, locules 2, longitudinally dehiscent; vestigial styles 1–3, minute. Carpellate flowers: calyx lobes 3–5, unequal, acutely triangular; petals and vestigial stamens absent; ovary inferior, locules 3 or 4, often only 1 locule with a pendulous ovule; styles 3, persistent, 3–4 mm, thick, apex often 2-lobed; stigmas 3, often curved and extending downward. Fruit drupelike, purple red or black, ovoid or obliquely ovoid, crowned by persistent calyx and styles; stone of fruit with a triangular germination valve. Seeds linear, curved; embryo at apex of fleshy endosperm.\r",
      "One genus and two species: Bhutan, China, N India, Nepal, Sikkim; two species (one endemic) in China.",
      "Hu Wenkuang. 1990. Toricellia. In: Fang Wenpei & Hu Wenkuang, eds., Fl. Reipubl. Popularis Sin. 56: 35–38."
    ],
    "authors":"Jenny Qiuyun Xiang & David E. Boufford"
  },
  {
    "group_title":"Myrsinaceae through Loganiaceae",
    "family":"Ebenaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10293",
    "knowledge_content":[
      "Trees or erect shrubs, occasionally with spine-tipped branchlets. Leaves alternate, rarely opposite, entire; stipules absent. Flowers actinomorphic, usually unisexual, dioecious, or polygamous, rarely bisexual. Male flowers often in cymes, sometimes in clusters or solitary; pistil rudimentary or absent. Female flowers often solitary, axillary, imperfect or without stamens. Calyx 3--7-lobed, persistent and often becoming enlarged in female or bisexual flowers; lobes abutting or overlapping in bud. Corolla 3--7-lobed; lobes convolute, rarely overlapping or abutting. Stamens hypogynous or at bottom of corolla, 2--4 X as many as corolla lobes, rarely as many as corolla lobes and alternate with them; filaments free or united in pairs. Ovary superior, 2--16-locular; ovules 1 or 2 per locule. Styles 2--8, free or basally united; stigma entire or 2-lobed. Fruit a ± fleshy berry, with few to several seeds. Seeds usually oblong; endosperm sometimes ruminate; hilum small.",
      "Three genera and ca. 500 species: mostly in the tropics; one genus and 60 species (43 endemic) in China.Li Shu-gang (as Lee Shu-kang). 1987. Ebenaceae. Fl. Reipubl. Popularis Sin. 60(1): 84-154."
    ],
    "authors":"Shugang Li, Michael G. Gilbert & Frank White"
  },
  {
    "group_title":"Myrsinaceae through Loganiaceae",
    "family":"Loganiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10515",
    "knowledge_content":[
      "Trees, shrubs, woody climbers, or herbs, sometimes epiphytic, sometimes with axillary spines or tendrils. Leaves opposite, occasionally alternate, rarely verticillate, fasciculate, or in a whorl; stipules usually present, often reduced to lines connecting petiole bases, sometimes reduced to petiolar ocrea or a connate leaf-sheath; leaf blade usually entire, pinnately veined or 3--7-veined from base. Flowers in cymes, these often grouped into thyrses; cymes sometimes umbel-like, scorpioid or reduced to a single flower; bracts usually small. Flowers usually bisexual. Calyx 4- or 5-lobed; lobes free or connate, mostly persistent, imbricate or valvate. Corolla sympetalous; lobes 4 or 5(--16), valvate, imbricate or contorted in bud. Stamens inserted on corolla, included to exserted, equal in number to corolla lobes and alternating with them or sometimes fewer; filaments free, much shorter to much longer than anthers; anthers basifixed, 2--4-locular, dehiscing introrsely or extrorsely by longitudinal slits, base slightly to deeply parted. Disc ring-shaped or not. Ovary superior or rarely semi-inferior, (1- or)2(--4)-locular, placentation axillary or parietal; ovules 1 to many per locule. Style simple, terminal, persistent or deciduous; stigma usually capitate, entire or shortly 2--4-cleft. Fruit a capsule, berry, or drupe, 1- to many-seeded. Seeds sometimes winged; endosperm fleshy or horny; embryo minute, straight; cotyledons small.",
      "Some 29 genera and about 500 species: mainly in tropical and subtropical regions of the world, absent from Europe; eight genera and 45 species (ten endemic) in China.Li Ping-tao in Chang Mei-chen & Qiu Lian-qing, eds. 1992. Loganiaceae. Fl. Reipubl. Popularis Sin. 61: 223-309.",
      "Flowers 5-merous; internodes of inflorescence shorter than flowers, sometimes elongating after anthesis and then slightly longer than fruits",
      "Leaf blade with 1--3 pairs of distinct longitudinal secondary veins from or near base and curved along margin; if lianas then with axillary, simple, or double curled tendrils, sometimes with axillary thorns",
      "Leaf blade without 1--3 pairs of distinct longitudinal secondary veins from or near base; tendrils and thorns absent.",
      "Aestivation imbricate; corolla funnelform or salverform; fruit capsular (Buddleja madagascariensis is baccate).",
      "Buddleja  LinnaeusFagraea  ThunbergGardneria  WallichGelsemium  JussieuGeniostoma  J. R. Forster & G. ForsterMitrasacme  LabillardièreMitreola  LinnaeusStrychnos  Linnaeus"
    ],
    "authors":"Bingtao Li & Antony J. M. Leeuwenberg"
  },
  {
    "group_title":"Myrsinaceae through Loganiaceae",
    "family":"Myrsinaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10598",
    "knowledge_content":[
      "Trees, shrubs, climbers [or rarely herbs]. Leaves simple, alternate, rarely opposite or whorled, without stipules, often glandular. Inflorescences terminal, axillary, or at apices of lateral branches, racemose (often paniculate), corymbose, cymose, umbellate, or fascicled on scaly spur branches in leaf axils. Flowers bisexual or polygamous, rarely unisexual and plants polygamodioecious or dioecious, 4- or 5(or 6)-merous, actinomorphic. Sepals basally connate or free, persistent, usually glandular. Petals basally connate or rarely free, usually glandular. Stamens as many as and opposite to petals, usually adnate to base or throat of corolla tube, sometimes free, rarely united into a tube; anthers 2-celled, dorsifixed, dehiscing longitudinally or by apical slits or pores, rarely transversely septate; filaments present or absent. Ovary superior, rarely inferior to half-inferior, 1-celled; placentation free-central, sometimes basal; ovules 1 to several in 11 to many rows, usually embedded in placenta, anatropous or semicampylotropous. Style 1; stigma simple or lobed. Fruit drupes with fleshy exocarp or capsules. Seeds 1 to many; endosperm fleshy or horny; embryo x = 10-13, 23.",
      "About 42 genera and more than 2,200 species: primarily in tropical and subtropical or warm temperate regions of both hemispheres; five genera and 120 species (51 endemic) in China.\r",
      "Chinese genera of economic value include Ardisia (medicine, oil, edible, wild vegetables), Maesa (edible, tea, dye), Aegiceras (tannin, fine fuel), Embelia (vermifuge, edible), Myrsine (medicine, fine wood, tannin, fuel). Chen Chieh. 1979. Myrsinaceae. Fl. Reipubl. Popularis Sin. 58: 1-147.",
      "Fruit a globose drupe often with a fleshy exocarp; anthers not septate; mountains and broad-leaved forests.",
      "Inflorescences on a long peduncle or at tips of specialized lateral branches; corolla lobes contorted in bud. Stigma usually apiculate",
      "Inflorescences often on scaly short branches or spurs; corolla lobes imbricate or valvate in bud. Stigma often not apiculate."
    ],
    "authors":"Jie Chen & John J. Pipoly, III"
  },
  {
    "group_title":"Myrsinaceae through Loganiaceae",
    "family":"Oleaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10625",
    "knowledge_content":[
      "Trees or erect or scandent shrubs. Branches and branchlets lenticellate. Leaves opposite, rarely alternate or whorled, simple, trifoliolate, or pinnately compound, without stipules; venation pinnate or palmate. Inflorescences terminal or axillary, in cymes, panicles, racemes, umbels, or fascicles. Flowers actinomorphic, bisexual, rarely unisexual or polygamous and plants monoecious, dioecious, or polygamodioecious. Calyx 4(-16)-lobed or -parted, rarely absent. Corolla 4(-16)-lobed, sometimes almost free to base, rarely absent; lobes sometimes united in pairs at base or into a very short tube. Stamens 2(-4), inserted on corolla tube or hypogynous; anthers dehiscing longitudinally; pollen 3-colpate or 3-colporate. Ovary superior, 2-loculed; ovules 2 in each locule, sometimes 1 or numerous. Style 1 or absent; stigma 2-lobed or capitate. Fruit a drupe, berry, capsule, or samara. Seeds with straight embryo, with or without endosperm; radicle curved upward or downward.",
      "About 28 genera and over 400 species: tropical, subtropical, and temperate regions of world, but mainly in Asia. China has 10 genera and 160 species (95 endemic) and is the center of diversity for the genera Forsythia, Syringa, Osmanthus, and Ligustrum.\r",
      "Many genera are important economically: Fraxinus and Forsythia (medicinal, ornamental); Jasminum, Osmanthus, and Syringa (spice, ornamental); Olea (oil); and Fraxinus (timber). Chang Mei-chen, Miao Bo-mao, Lu Rui-ling, & Qiu Lian-qing in: Chang Mei-chen & Qiu Lian-qing, eds. 1992. Oleaceae. Fl. Reipubl. Popularis Sin. 61: 1-222.",
      "Corolla lobes almost free to base, united in pairs at base, or united into a very short tube up to 1 mm",
      "Corolla lobes 4-16, imbricate; berry usually didymous; leaves pinnately compound, 3-foliolate, or simple",
      "Chionanthus  RoyenFontanesia  LabillardièreForsythia  VahlFraxinus  LinnaeusJasminum  LinnaeusLigustrum  LinnaeusMyxopyrum  BlumeOlea  LinnaeusOsmanthus  LoureiroSyringa  Linnaeus"
    ],
    "authors":"Mei-chen Chang, Lien-ching Chiu, Zhi Wei & Peter S. Green"
  },
  {
    "group_title":"Myrsinaceae through Loganiaceae",
    "family":"Plumbaginaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10710",
    "knowledge_content":[
      "Shrublets, shrubs, or herbs. Stems striate or reduced to a caudex. Leaves simple, alternate or basal, sessile or petiolate but petiole usually indistinct from blade; stipules absent; leaf blade entire or rarely pinnately lobed, with chalk glands on both surfaces. Inflorescences terminal or axillary, unbranched or branched, spicate, spicate-racemose, subcapitate, capitate, or paniculate, arranged into complanate spikes if branched, all composed of 1--10 or more cymules or helicoid cymes; cymules or helicoid cymes usually known as spikelets, 1--5-flowered; bracts 1 at base of each spikelet; bractlets 1 or 2 at base of each flower. Flowers bisexual, actinomorphic, sessile or very shortly pedicellate. Calyx persistent, hypogynous, tubular to funnelform, 5-ribbed, 5-lobed. Corolla hypogynous, petals connate but sometimes only at base, lobes or segments 5 and twisted. Stamens opposite corolla lobes, hypogynous or inserted at corolla base; anthers 2-locular, dehiscing longitudinally. Pistil 1. Ovary superior, 1-locular. Styles 5, free or connate. Stigmas 5. Ovule 1, pendulous from a basal funicle. Capsules usually enclosed within calyx. Seeds 1 per capsule; embryo straight, surrounded by thin starchy endosperm.",
      "About 25 genera and 440 species: worldwide, main diversity in C Asia and Mediterranean region; seven genera and 46 species (11 endemic) in China.Armeria labradorica Wallroth subsp. sibirica (Turcznaninow) Kamelin is expected to be found in Altay Shan near the border with Mongolia and\/or Russia.Peng Ze-xiang (as Peng Tse-hsiang) in Li Shu-gang (as Lee Shu-kang), ed. 1987. Plumbaginaceae. Fl. Reipubl. Popularis Sin. 60(1): 1-47.",
      "Styles connate, 5-branched; stigmas on inner surface of style branches; calyx herbaceous or membranous only between ribs, never scarious, without inflated or expanded limb; corolla with long tube.",
      "Styles 5; stigmas terminal, depressed capitate or terete; calyx limb scarious, inflated or expanded; corolla with petals connate only at base.",
      "Shrublets pulvinate, usually thorny; leaves alternate, crowded, linear, sometimes spinescent, persisting when withered",
      "Herbs, or not thorny shrublets; leaves basal or in a rosette at apex of a caudex, rarely alternate, usually deciduous.",
      "Styles slightly verrucose at base; calyx subtubular, limb narrowly campanulate; ovary apex gradually attenuate; leaf blade margin undulate",
      "Styles with long papillae at base; calyx funnelform, limb expanded; ovary apex abruptly contracted; leaf blade margin flat or nearly so",
      "Acantholimon  BoissierCeratostigma  BungeGoniolimon  BoissierIkonnikovia  LinczevskiLimonium  MillerPlumbagella  SpachPlumbago  Linnaeus"
    ],
    "authors":"Tse-Hsiang Peng & Rudolf V. Kamelin"
  },
  {
    "group_title":"Myrsinaceae through Loganiaceae",
    "family":"Primulaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10728",
    "knowledge_content":[
      "Herbs perennial or annual, rarely suffruticose. Leaves alternate, opposite, or whorled, often all basal, simple, entire to lobed. Flowers solitary or in panicles, racemes, or umbels, usually with bracts, perfect, (4- or)5(--9)-merous, often heterostylous (Primula). Calyx persistent. Corolla gamopetalous, actinomorphic, rarely absent (Glaux). Stamens as many as and opposite corolla lobes, ± epipetalous, occasionally with scalelike staminodes. Filaments free or connate into a tube at base. Ovary superior, rarely semi-inferior (Samolus), unilocular; placentation free central; style simple; stigma inconspicuous, capitate. Fruit a capsule, dehiscing by valves, rarely circumscissile or indehiscent. Seeds many or few; embryo small, straight, surrounded by endosperm.",
      "The family contains 22 genera and ca. 1000 species, occurring mainly in temperate and mountainous regions of the northern hemisphere. Twelve genera and 517 species are widely distributed throughout China, but are represented mostly in the S and W regions. The centers of diversity for Primula, Androsace, and Omphalogramma are W Sichuan, E Xizang, and NW Yunnan. Lysimachia is also highly developed in provinces S of the Chang Jiang, while Pomatosace is an endemic genus confined to a small area of NW Sichuan and Qinghai.\r",
      "Many species of Primula and Androsace are cultivated for their attractive flowers as pot plants, in rock gardens, or in garden borders. Some species of Lysimachia are used medicinally. Cyclamen persicum Miller is frequently cultivated as a pot plant. Chen Feng-hwai, Hu Chi-ming, Fang Yun-yi, Cheng Chao-zong, Yang Yong-chang & Huang Rong-fu In Chen Feng-hwai & Hu Chi-ming, editors. 1990. Primulaceae (1). Fl. Reipubl. Popularis Sin. 59(1): 1-217; Hu Chi-ming In Chen Feng-hwai & Hu Chi-ming, editors. 1990. Primulaceae (2). Fl. Reipubl. Popularis Sin. 59(2): 1-321.",
      "Flowering rosette with a solitary large flower; scapes without bracts; corolla more than 1.5 cm in diam.",
      "Flowering rosette with 1 to many scapose inflorescence(s) of flowers with bracts, or with a solitary flower with bracts or not; corolla less than 1.5 cm in diam."
    ],
    "authors":"Qiming Hu & Sylvia Kelso"
  },
  {
    "group_title":"Myrsinaceae through Loganiaceae",
    "family":"Sapotaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10793",
    "knowledge_content":[
      "Trees or shrubs, usually producing latex. Leaves spirally arranged or alternate and distichous, rarely ± opposite, sometimes crowded at apex of branchlets; stipules early deciduous or absent; leaf blade papery or leathery, margin entire. Flowers bisexual or unisexual, usually in sessile axillary clusters, rarely solitary; cluster pedunculate or in raceme-like inflorescence, bracteolate. Calyx a single whorl of usually 4--6 sepals, or 2 whorls each with 2--4 sepals. Corolla lobes as many to 2 X as many as sepals, usually entire, rarely with 2 lacerate or lobular appendages. Stamens inserted at corolla base or at throat of corolla tube, as many as and opposite corolla lobes to many and in 2 or 3 whorls; staminodes when present alternate with stamens, scaly to petal-like. Ovary superior, 4- or 5-locular, placentation axillary; ovules 1 per locule, anatropous. Style 1, often apically lobed. Fruit a berry or drupe, 1- to many-seeded. Seed coat brown (pale yellow in Pouteria annamensis), hard, shiny, rich in tannin; endosperm usually oily; seed scar lateral and linear to oblong or basal and round.",
      "About 1100 species and 53 genera: pantropical; 11 genera and 24 species (six endemic) in China.Li Shu-gang (as Lee Shu-kang). 1987. Sapotaceae. Fl. Reipubl. Popularis Sin. 60(1): 47-83.",
      "Filaments with a cluster of villous hairs on both sides, rarely at only one side, at base; staminodes awned; plant usually spinous",
      "Leaves opposite or subopposite, stipulate; ovary 1- or 2-locular; fruit drupelike, ellipsoid, pericarp very thin"
    ],
    "authors":"Shugang Li & T. D. Pennington"
  },
  {
    "group_title":"Myrsinaceae through Loganiaceae",
    "family":"Styracaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10861",
    "knowledge_content":[
      "Trees or shrubs, usually stellate pubescent or scaly, rarely glabrous. Leaves usually alternate, simple; stipules absent or very minute. Inflorescences terminal or axillary, racemes, panicles, or cymes, rarely 1-flowered or several flowers in a fascicle; bracteoles minute or absent. Flowers bisexual, rarely polygamous dioecious, actinomorphic. Calyx campanulate, obconical, or cup-shaped; tube completely or partially adnate to ovary; teeth or lobes 4 or 5(or 6), sometimes very small or obsolete. Corolla mostly white, gamopetalous; lobes (4 or)5(--7), basally ± connate, rarely free, imbricate or valvate, rarely slightly induplicate. Stamens twice, sometimes equal in number to corolla lobes, inserted at base of corolla; filaments mostly flattened, basally partially or completely connate into a tube; anthers introrse, 2-locular, locules parallel and opening by longitudinal slits. Ovary superior, half inferior, or inferior, 3--5-locular or apically 1-locular and basally 3--5-locular; ovules few or solitary in each locule, erect, pendulous, or anatropous, integument 1 or 2, placentation axile or parietal. Style slender, linear or subulate; stigma truncate, capitate or 2--5-lobed. Fruit a berry, drupe, or capsule, exocarp fleshy to dry. Seeds sometimes winged, often with a broad hilum; embryo straight or slightly curved; endosperm copious; cotyledons flattened or subterete.",
      "Eleven genera and ca. 180 species: tropical and temperate America, Asia, and Mediterranean; 10 genera (two endemic) and 54 species (32 endemic) in China.Hwang Shu-mei in Wu Rong-fen (as Wu Young-fen) & Hwang Shu-mei, eds. 1987. Styracaceae. Fl. Reipubl. Popularis Sin. 60(2): 77-150.",
      "Ovary 3-locular when young, becoming 1-locular; seeds 1 or 2, without wings, rounded at both ends; pedicel not jointed",
      "Filaments coherent or slightly connate at base; fruit drupaceous, indehiscent, pear-shaped; seeds pointed at both ends",
      "Filaments connate at least to middle; fruit capsular dehiscing loculicidally by 5 valves; seeds winged at both ends",
      "Fruit dehiscing loculicidally by 3 valves; seeds winged at both ends; petals free, connective 2- or 3-dentate",
      "Fruit indehiscent; seeds without wings; petals connate at base (shortly coherent in Pterostyrax), connective entire.",
      "Corolla lobes 5 (4--7 in Sinojackia); fruit with 5--12 ribs or wings (Parastyrax without ribs or wings).",
      "Flowers in racemes, panicles, or thyrses; filaments 5 long and 5 short or subequal (sometimes equal in Sinojackia).",
      "Alniphyllum  MatsumuraBruinsmia  Boerlage & KoordersHalesia  J. Ellis ex LinnaeusHuodendron  RehderMelliodendron  Handel-MazzettiParastyrax  W. W. SmithPterostyrax  Siebold & ZuccariniRehderodendron  HuSinojackia  HuStyrax  Linnaeus"
    ],
    "authors":"Shumei Huang & James W. Grimes"
  },
  {
    "group_title":"Myrsinaceae through Loganiaceae",
    "family":"Symplocaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10863",
    "knowledge_content":[
      "Shrubs or trees, evergreen (Symplocos paniculata deciduous). Leaves spirally or distichously arranged, simple; stipules absent; leaf blade margin entire, dentate, or glandular dentate, midvein adaxially impressed or rarely flat or prominent. Inflorescences in spikes, racemes, panicles, or glomerules, rarely flowers solitary. Flowers actinomorphic, bisexual, rarely unisexual, supported by 1 bract and 2 bractlets, rarely bractless or with several bracts in leaf axil. Ovary inferior to half inferior, 2--5-locular but unless stated otherwise in descriptions 3-locular, with 2--4 ovules per locule. Calyx lobes (3--)5, persistent, valvate or imbricate. Corolla white (not repeated in descriptions) or yellow, gamopetalous but divided nearly to base (or to middle in S. pendula); lobes (3--)5(--11), imbricate. Stamens many, rarely 4 or 5, adnate to base of corolla tube, monadelphous in subgenus Symplocos, monadelphous to pentadelphous in subgenus Hopea; filaments distinct or in fascicles; anthers subglobose, 2-locular. Ovary usually with an apical 5-glandular, annular, cylindrical, or 5-lobed disc. Style 1, filiform; stigma small, capitate or 2--5-lobed. Fruit a drupe. Seeds with copious endosperm; embryo straight or curved; cotyledons very short.",
      "One genus and ca. 200 species: widely distributed in tropics and subtropics of Asia, Australia, and America; 42 species (18 endemic) in China.Wu Rong-fen (as Wu Young-fen) in Wu Young-fen & Hwang Shu-mei, eds. 1987. Symplocaceae. Fl. Reipubl. Popularis Sin. 60(2): 1-77."
    ],
    "authors":"Young-fen Wu & Hans P. Nooteboom"
  },
  {
    "group_title":"Gentianaceae through Boraginaceae",
    "family":"Apocynaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10053",
    "knowledge_content":[
      "Trees, shrubs, or vines, rarely subshrubs or herbs, with latex or rarely watery juice. Leaves simple, opposite, rarely whorled or alternate, pinnately veined; stipules absent or rarely present. Inflorescences cymose, terminal or axillary, with bracteoles. Flowers bisexual, 5- [or 4]-merous, actinomorphic. Calyx 5- or rarely 4-partite, quincuncial, basal glands usually present. Corolla 5- or rarely 4-lobed, salverform, funnelform, urceolate, or rarely rotate, lobes overlapping to right or left, rarely valvate. Stamens 5 or rarely 4; filaments short; anthers mostly sagittate, free or connivent into a cone adherent to pistil head, dehiscing longitudinally, base rounded, cordate, sagittate, or prolonged into an empty spur; pollen granular; disc ringlike or cup-shaped, 2-5-lobed, or absent. Ovaries superior, rarely half-inferior, connate or distinct, 1- or 2-locular; ovules (1 or) 2-numerous per locule. Style 1; pistil head capitate, conical, or lampshade-shaped, base stigmatic, apex 2-cleft and not stigmatic. Fruit a berry, drupe, capsule, or follicle. Seeds with or without coma; endosperm thick and often horny, scanty, sometimes absent; embryo straight or nearly so, cotyledons often large, radicle terete.",
      "About 155 genera and 2000 species distributed primarily in the tropics and subtropics, poorly represented in the temperate regions. Of the 44 genera and 145 species present in China, one genus and 38 species are endemic, and nearly 95% of the taxa grow in the southern and southwestern portions of the country.\r",
      "Fruit type is highly diversified in the family, and it is diagnostic of many genera. Genera 1-4 produce 1, 2-celled berries from a flower; genus 5 produces 2, 1-celled berries from a flower; 6 and 7 produce mostly fleshy follicles containing deeply indented seeds with ruminate endosperm; 8 has follicles and winged seeds; 9 produces follicles and seeds with 2 comas; 10-12 have follicles with globose seeds; 13-18 have drupes mostly with fleshy mesocarp; 19 has samaroid fruit; 20 has spiny capsules with seeds winged all around; and 21-44 have free or fused follicles and comose seeds. Double flowers are known only from cultivated forms of Nerium oleander, Tabernaemontana divaricata, and Wrightia religiosa.Plants of the Apocynaceae are often poisonous and are rich in alkaloids or glycosides, especially in the seeds and latex. Some species are valuable sources of medicine, insecticides, fibers, and rubber.  Tsiang Ying & Li Ping-tao. 1977. Apocynaceae. Fl. Reipubl. Popularis Sin. 63: 1-249.",
      "Corolla white, often with a deep pink-red or yellow throat, tube cylindric or nearly so; fruit subglobose",
      "Corolla tube funnelform, 1.2-2.2 cm, with corona; leaves thick, lanceolate, with dark reticulate venation abaxially; fruit a united pair of follicles",
      "Corolla tube almost cylindric, mostly up to 1 cm, if longer then without a corona; leaves often not very thick, variously shaped; fruit a pair of drupes or free follicle.",
      "Leaves without hairy domatia; fruit moniliform, sometimes globose, transversely constricted into 2-5 drupelike articles",
      "Fruit slender follicles; seeds hairy; disc of 2 separate glands alternating with carpels, small annular, or absent; often big trees",
      "Corolla lobes overlapping to right, often suberect; disc absent; drupes mostly more than 3 cm; mesocarp fibrous",
      "Corolla lobes overlapping to left, spreading; disc ringlike or cup-shaped; drupes up to 2 cm; mesocarp fleshy",
      "Disc absent; calyx without colleters inside; corolla with faucal corona scales, tube almost cylindric",
      "Disc cylindric, thick, fleshy; calyx with basal colleters inside; corolla without faucal corona scales, tube inflated at base, contracted at mouth",
      "Leaf blades with secondary veins clearly separate from each other and usually with tertiary veins; fruit berries or wingless follicles.",
      "Inflorescences corymbose, terminal, at branch forks, or sometimes axillary; fruit of at least partly separated carpels.",
      "Corolla tube at least 4 as long as calyx; calyx persistent at fruit base, lobes erect in fresh flowers",
      "Peduncle absent or to 0.8 cm; sepals glabrous or sparsely puberulent outside; corolla tube up to 1.3 cm; seeds beaked.",
      "Corolla funnelform to subcampanulate and\/or tube more than 2 cm, nearly urceolate (Urceola) or subrotate (Vallaris).",
      "Corolla tube cylindric, limb spreading horizontally, often very wide; follicles more than 5 as long as wide",
      "Corolla tube clearly widened toward throat, limb probably not horizontal; follicles ca. 3 as long as wide",
      "Corolla tube 4.5-14 mm, lobes 5-14 mm, forming in bud a large, rather narrowly ovoid, subacuminate head much wider than tube which is clearly widened around or above middle of stamens",
      "Corolla tube 2.5-3 mm, lobes 3-5 mm, forming in bud a small subglobose or ovoid, rounded or blunt head not or slightly wider than tube which is ± barrel-shaped",
      "Sepals more than twice as long as wide, acuminate or acute, often spreading and longer than corolla tube, if about half as long, then leaf blade with a submarginal vein (A. marginata)",
      "Sepals less than twice as long as wide, acute to rounded, erect or apically slightly spreading, up to half as long as corolla tube."
    ],
    "authors":"Bingtao Li, Antony J. M. Leeuwenberg & David J. Middleton"
  },
  {
    "group_title":"Gentianaceae through Boraginaceae",
    "family":"Asclepiadaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10066",
    "knowledge_content":[
      "Herbs, shrubs, or rarely treelike, with milky or, less often, clear latex. Leaves simple, opposite or occasionally whorled, very rarely alternate, usually without obvious stipules, margin nearly always entire. Inflorescences terminal, axillary, or extra-axillary, cymose, often condensed and umbel-like, occasionally a racemelike bostrychium. Flowers bisexual, 5-merous, actinomorphic. Sepals joined at base only, often with 5 or more basal glands in the sinuses. Corolla sympetalous, reflexed to urceolate or salverform; lobes valvate or overlapping in bud to right or left. Corona usually present, inserted on corolla, stamens, or both. Stamens 5, usually inserted at base of corolla tube and adhering to stigma head to form gynostegium; filaments usually connate to form a tube enclosing ovaries; anthers 4-celled (Periplocoideae and Secamonoideae) or 2-celled (Asclepiadoideae), often with a membranous apical appendage; pollen tetrads contained loosely on a spatulate translator with a basal corpusculum (Periplocoideae), or pollen united into waxy pollinia, each attached through a caudicle (stalk) to the retinaculum (gland) between adjacent anthers to form a pollinarium, pollinia 2 (Asclepiadoideae) or 4 (Secamonoideae) per pollinarium. Ovaries 2, free, superior; ovules numerous. Styles connate; stigma head fleshy. Fruit of 1 or 2 follicles. Seeds numerous, strongly compressed, with a coma (a prominent basal tuft of silky hairs). Chromosome number x = (8-)11 (or 12).",
      "Some 250 genera and over 2000 species: widespread in tropical and subtropical regions, especially in Africa and southern South America, with a moderate representation in northern and southeastern Asia; 44 genera (four endemic) and 270 species (153 endemic) in China.\r",
      "Some authorities include this family in the Apocynaceae. Genera 1-6 are sometimes placed in a separate family, the Periplocaceae, here regarded as a subfamily, Periplocoideae. Genera 7-10 belong to the Secamonoideae and the remaining genera to the Asclepiadoideae. Many Chinese taxa are known only from dried material, sometimes not well preserved, and it is likely that the study of living or spirit-preserved material could lead to a reassessment of the taxonomy of some of these endemic taxa.  All plant parts, especially the seeds and latex, are often poisonous. They contain various alkaloids and glycosides, many of which are used in medicine and as insecticides. A few succulent species (e.g., Stapelia gigantia N. E. Brown, Orbea pulchella (Masson) L. C. Leach, and O. variegata (Linnaeus) Haworth are grown by specialist collectors in China. Tsiang Ying & Li Ping-tao. 1977. Asclepiadaceae. Fl. Reipubl. Popularis Sin. 63: 249-575.",
      "Pollen granular, united into pollinia attached to a retinaculum through a caudicle; filaments connate into a gynostegium.",
      "Flower buds conical-ovoid, apex obtuse; corona inserted at throat of corolla tube, lobes obovate, apex apiculate; pollen in 2 masses in each anther locule",
      "Flower buds cylindric-lanceolate, apex caudate-lanceolate; corona inserted at middle of corolla tube, lobes ovate or linear, apex obtuse; pollen in a single mass in each anther locule",
      "Corona lobes 3-fid, central segment threadlike, lateral segments broad, flaplike; anthers abaxially pilose",
      "Follicles not winged, densely tomentose; interpetiolar line inconspicuous; inflorescences solitary at nodes, obconical, top rounded to flat; cymules racemelike",
      "Follicles with ca. 20 prominent papery wings, glabrous; interpetiolar line conspicuous, lobed; inflorescences normally paired at nodes, conical with well-defined main rachis, lax, top pointed; cymules forked",
      "Corona deeply 5-lobed, lobes erect, acuminate or acute at apex, usually longer than stamens; inflorescences, and often rest of plant, with dark brown pilose hairs",
      "Corona shallowly 5-lobed, lobes revolute, rounded at apex, as long as stamens; plant glabrous to pale puberulent",
      "Plants always growing on trees or rock surfaces, often by means of adventitious roots; inflorescences flowering over long period and eventually developing a cylindric rachis covered with close-set pedicel scars; leaves mostly fleshy, rarely leathery to membranous.",
      "Plants usually rooted in the ground; inflorescences various, rarely developing cylindric rachis covered with close-set pedicel scars; leaves membranous to leathery.",
      "Leaves cuneate, apex truncate to shallowly retuse; corolla lobes overlapping to left; stigma head long beaked, longer than anther appendages",
      "Leaves linear to orbicular or obovate, apex rounded to long acuminate, very rarely truncate to retuse; corolla lobes valvate; stigma head discoid, 5-angled, shorter than anther appendages.",
      "Corolla rotate or reflexed, conspicuous; corona lobes fleshy, stellately spreading, glossy when dried",
      "Corolla ovoid-urceolate, minute and inconspicuous; corona lobes not very fleshy, erect, not glossy when dried",
      "Anthers without apical appendages or, if appendages present, inconspicuous and lacking membranous margin; pollinia with prominent translucent margin.",
      "Anthers with apical appendages, these with conspicuous membranous margin; pollinia without prominent translucent margin.",
      "Corona apparently represented by 5 denticulate scales inserted on corolla tube alternating with corolla lobes, no corona associated with gynostegium; plant always growing in close association with flowing water",
      "Corolla tube without scales or appendages, corona inserted at base of gynostegium or on anthers; plants growing in relatively dry situations.",
      "Erect herbs with tuberous rootstock; latex clear or translucent; corona apparently double: outer lobes erect, usually 2-toothed or lobed, inner lobes incumbent over anthers",
      "Twining, often robust, herbs; latex white; corona simple, with lobes flat on corolla, apex acute or rounded, inner lobes very short and inconspicuous",
      "Corona double: an outer whorl inserted at base of corolla and an inner whorl inserted on gynostegium or back of anthers.",
      "Corona single, inserted on corolla tube, gynostegium, or back of anthers, sometimes very reduced to virtually absent.",
      "Stems slender and herbaceous when young; leaves well developed, persistent; corolla bowl-shaped, 2-3 cm in diam.",
      "Stems succulent; leaves reduced to scales, short lived so plant is often leafless; corolla rotate or nearly so, deeply lobed, less than 1 cm in diam.",
      "Plants slender herbs, sometimes tending to twine at tip; corona membranous and cupular to cylindric, or if deeply 5-lobed, lobes always joined laterally at base, fleshy, simple except sometimes for adaxial appendage",
      "Leaves ovate to obovate, often oblong, 7- 30 × 3-15 cm, with cordate to amplexicaul base; corona lobes each with an upcurved dorsal spur at base",
      "Leaves lanceolate, 5-15 × 0.5-4 cm, with cuneate to tapering base; corona lobes without spur at base.",
      "Flowers pendent; corolla whitish; corona purplish; follicles with soft spines or bristles, 2.5-5 cm thick",
      "Corona lobes absent or reduced to separate scales at base of gynostegium, corolla tube sometimes with apparent corona.",
      "Corolla tube with 5 longitudinal ridges sometimes produced into fleshy lobes and\/or with lines of stiff hairs along each side",
      "Corolla lobes as long as or longer than tube; stigma head rounded or conical, not exserted beyond anther appendages.",
      "Corolla very shallowly bowl-shaped, almost rotate; corona lobes alternate with anthers; pollinia pendulous",
      "Apex of corolla lobes abruptly narrowed into a long tail; anthers thread-like at apex; stems with very conspicuous long reddish brown hairs; inflorescences racemelike with fleshy rachis obviously thicker than peduncle",
      "Apex of corolla lobes obtuse or acuminate; anthers rounded at apex; stems without conspicuous reddish brown hairs; inflorescences various but never with fleshy rachis.",
      "Corona inserted around base of gynostegium; pollinia nearly always pendulous (horizontal in Tylophora).",
      "Corolla tube campanulate; corona lobes linear-subulate, erect, longer than gynostegium; calyx glandular inside",
      "Corolla subrotate; corona forming a low, entire or undulate, fleshy ring around base of gynostegium; calyx not glandular inside",
      "Corona much shorter than anthers, ringlike or shallowly cupular, entire, undulate, or deeply 5-notched, without adaxial appendages; corolla often urceolate or campanulate; leaves linear to narrowly elliptic, adaxially often with minute, raised pale dots",
      "Corona well developed, deeply lobed and fleshy and\/or with adaxial appendages, sometimes cupular to tubular and membranous, tube apex and throat often with 5-10 teeth, sometimes threadlike, rarely shorter than anthers and then membranous; corolla usually deeply divided, tube usually very shallow, rarely campanulate and then stems erect; leaves very variable in form, adaxially never with raised pale dots.",
      "Corona lobes circular to almost square, laterally contiguous to form a cup, with narrow inflexed tips; pollinia horizontal",
      "Corona inconspicuous to virtually absent; corolla 1.4-8.5 cm, salverform, inside of tube with 5 longitudinal lines of hairs",
      "Corona conspicuous; corolla usually less than 1.4 cm, if more and salverform then inside of tube uniformly hairy or glabrous.",
      "Corona lobes with inner appendages often longer than lobe proper and\/or lobed or toothed, smooth toward base; corolla always salverform",
      "Corona lobes simple at tips, often ridged or grooved toward base; corolla campanulate to urceolate, rarely almost salverform (Marsdeniastenantha).",
      "Corona lobes with back produced into a conspicuous longitudinal wing; corolla lobes with thickenings at base",
      "Corona lobes fleshy, hooked, spurred, horned, falcate, or turgid, or processes stellately spreading or erect.",
      "Outer angle of corona lobes produced into curved, stellately spreading, acute, relatively slender horn",
      "Corona lobes as high as anthers and with interior angle forming an acute tooth incumbent on top of the anthers; inflorescences long pedunculate umbel-like clusters of cymules; follicles often with longitudinal or transverse ridges or wings",
      "Corona lobes shorter than anthers, tip incumbent on lower part of anther or on filament; inflorescences with a conspicuously elongated, often branched rachis, rarely condensed and umbel-like and then short pedunculate; follicles always smooth.",
      "Inflorescence rachis fleshy, bracts ovate, ca. 1 mm; corolla lobes ca. 4 mm wide; follicles with a thick, fibrous mesocarp",
      "Inflorescence rachis slender, bracts linear-lanceolate, 1.5-2 mm; corolla lobes 1-3 mm wide; follicles with a thin mesocarp"
    ],
    "authors":"Bingtao Li, Michael G. Gilbert & W. Douglas Stevens"
  },
  {
    "group_title":"Gentianaceae through Boraginaceae",
    "family":"Boraginaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10115",
    "knowledge_content":[
      "Herbs perennial, biennial, or annual, less often lianas, shrubs, or trees, usually bristly or scabrous-pubescent. Leaves simple, exstipulate, alternate, rarely opposite, entire or serrate at margin. Inflorescences often double scorpioid cymes, rarely solitary; bracts present or absent. Flowers bisexual, actinomorphic, rarely zygomorphic. Calyx usually 5-parted or lobed, mostly persistent. Corolla tubular, campanulate, rotate, funnelform, or salverform; tube appendages 5, rarely more, mostly trapeziform, rarely absent, sometimes a ring of hairs present; limb usually 5-parted; lobes overlapping, rarely twisted in bud. Stamens 5, inserted on corolla tube or rarely at throat, included or rarely exserted; anthers introrse, 2-loculed, usually dorsifixed at base, less often medifixed, dehiscence longitudinal. Nectaries at base of corolla tube or on disc below ovary. Ovary superior, 2-carpellate; locules 2 and each with 2 ovules, or 4 and each with 1 ovule; ovules nearly atropous, semianatropous, or anatropous. Style terminal or gynobasic, branched or not. Gynobase flat, fastigiate, or subulate. Fruit 1-4-seeded drupes or nutlets (mericarps); nutlets mostly dry, often ornamented with wings, prickles and\/or glochids (stiff bristles with barbed or anchorlike tips). Seeds vertical or oblique, coat membranous; embryo straight, less often curved; cotyledons flat, fleshy.",
      "About 156 genera and 2500 species: temperate and tropical regions, centered in the Mediterranean region; 47 genera and 294 species in China, of which four genera and 156 species are endemic.\r",
      "Anchusa italica Retzius, A. officinalis Linnaeus, and Borago officinalis Linnaeus are cultivated. Borago officinalis is uncommon and not naturalized, and because its seeds contain quality oil, it is probably more commonly grown than previously. Wang Wen-tsai, Liu Yu-lan, Zhu Ge-ling, Lian Yong-shan, Wang Jing-quan & Wang Qing-rui in Kung Xian-wu & Wang Wen-tsai, eds. 1989. Boraginaceae. Fl. Reipubl. Popularis Sin. 64(2): 1-253.",
      "Style 2-cleft or entire; stigmas 1 or 2; fruit drupes or nutletlike, usually divided into 2 or 4 pyrenes, rarely undivided; cotyledons not plicate.",
      "Style divided into a basal sterile terete portion that may be strongly reduced, and an upper conical portion; stigma 1, often forming a ring around style.",
      "Style usually 2-cleft, rarely entire; stigmas 2, capitate or elongated, rarely subpeltate, or 1, 2-cleft, lower part not inflated, without sterile portion.",
      "Fruit berrylike or drupe with evident fleshy mesocarp, undivided or divided at maturity into 2-4 mericarps; trees or shrubs.",
      "Style 2-cleft to above middle; endocarp divided into 2 2-seeded, rarely 4 1-seeded pyrenes; leaf blade not white spotted adaxially",
      "Calyx parted to middle or slightly below, lobes triangular; corolla with inflated ribs below lobes and deep furrows between them",
      "Stamens exserted; nutlet with a cupular emergence abaxially, attachment scar below middle adaxially; gynobase narrowly fastigiate",
      "Nutlet without stipe; stamens in single whorl, if spirally arranged (Arnebia decumbens) then flowers yellow; style twice 2-cleft",
      "Calyx lobes unequal, strongly enlarged in fruit, bilaterally compressed, becoming somewhat clamshell-shaped",
      "Nutlets glabrous, abaxial surface free except for basal attachment scar which is coherent to gynobase"
    ],
    "authors":"Gelin Zhu, Harald Riedl & Rudolf V. Kamelin"
  },
  {
    "group_title":"Gentianaceae through Boraginaceae",
    "family":"Convolvulaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10216",
    "knowledge_content":[
      "Herbs or shrubs, usually with twining or climbing stems or erect, often with milky juice. Leaves alternate, simple, entire, dissected, or compound, absent in parasitic species. Flowers solitary, axillary or in cymes, racemes, panicles, umbels, or capitula, bisexual, actinomorphic, usually 5-merous, often showy. Sepals free, often persistent, sometimes enlarged in fruit. Corolla sympetalous, funnelform, campanulate, salverform, or urceolate; limb subentire or deeply lobed. Stamens alternating with corolla lobes, adnate to corolla; filaments filiform, equal or unequal in length; anthers introrse, laterally and longitudinally dehiscing; pollen smooth or finely spiny. Disc ringlike or cupular. Ovary superior, mostly 2-carpellate, 1- or 2-loculed, rarely 3- or 4-loculed; ovules basal, erect. Styles 1 or 2, terminal (gynobasic in Dichondra) or very short or absent; stigma entire or 2- (or 3)-lobed, rarely peltate. Fruit a capsule, dehiscing by valves, circumscissile, or irregularly shattering, less often a berry or nutlike. Seeds usually trigonous, smooth or pubescent.",
      "About 58 genera and 1650 species: widely distributed in tropical, subtropical, and temperate regions; 20 genera and 129 species in China.\r",
      "Aniseia biflora (Linnaeus) Choisy and A. stenantha (Dunn) Ling, recognized in the Fl. Reipubl. Popularis Sin., are here treated as Ipomoea biflora and I. fimbriosepala, respectively, because both have pantoporate and spinulose pollen. Strictly speaking, Aniseia is a neotropical genus of about five species, of which A. martinicensis (Jacquin) Choisy is widely naturalized as a common weed in rice paddies in Thailand and other southeast Asian countries. It will probably be found in S China eventually.\r",
      "The family is important in China for food plants (Ipomoea batatas (Linnaeus) Lamarck and I. aquatica Forsskål), several ornamentals (Ipomoea), several medicinal plants (Erycibe, Ipomoea, Cuscuta, Merremia, Dichondra, Evolvulus), and numerous noxious weeds (Cuscuta, Calystegia, Convolvulus). Fang Rhui-cheng & Huang Shu-hua in Wu Cheng-yih, ed. 1979. Convolvulaceae. Fl. Reipubl. Popularis Sin. 64(1): 1-153. ",
      "Pollen aperture type and surface ornamentation are important characters in the classification of Convolvulaceae at the generic level and above. The most critical feature of the pollen is whether the grain surface is spiny or not. This distinction separates the eight tribes recognized by Austin (Ann. Missouri Bot. Gard. 60: 306-412. 1973) into two rather cohesive groups. A low magnification (20 ) is adequate for discerning the presence or absence of minute spines on the surface. For the successful identification of Convolvulaceae, both flowering and fruiting material should be collected. The first key to genera requires adequate fertile material with both flowers and fruit, and requires use of a pollen character. The second key may be used as an aid to identification where material is lacking flowers or fruit, but in some instances it is still partially dependent upon having both flowers and fruit.",
      "Plants parasitic, leafless, with haustoria; flowers in clusters or short racemes; corolla inside usually with 5 fimbriate scales opposite sepals",
      "Plants not parasitic, with green leaves; flowers and corolla not as above (scales present in Lepistemon but flowers in ± umbellate cymes).",
      "Corolla campanulate, funnelform, or salverform; filaments basally pubescent or glandular, not forming scales",
      "Calyx greatly enlarged, completely enclosing fruit; leaves (and often sepals and corolla lobes) with minute blackish glandular dots abaxially; fruit wall at length eroding between septa, lantern-shaped",
      "Calyx enlarged, either reflexed from fruit or not fully enclosing it; leaves (and sepals and corolla lobes) without blackish dots; fruit an indehiscent or irregularly shattering berry.",
      "Flowers few to many in cymes or capitula; corolla mostly membranous or transparent, limb spreading to recurved, subentire, 5-lobed to deeply 5-parted; twining or trailing herbs, scandent shrubs, or lianas; sepals usually reflexed from fruit, often colored adaxially",
      "Flowers solitary, nodding; corolla waxy, limb erect, subentire or shallowly 5-dentate; slender woody twiners (in China); sepals ± enclosing fruit",
      "Styles absent; stigma 1, ± conical, 5-10-ridged; corolla deeply 5-lobed, each lobe 2-lobulate apically",
      "Outer 2 or 3 or all 5 sepals much enlarged in fruit and falling off with fruit as a dispersal unit; fruit indehiscent; seeds 1.",
      "Sepals enlarged in fruit or not, remaining attached to pedicel when fruit dehisces; fruit dehiscent by valves or breaking irregularly; seeds usually 4 (or less by abortion).",
      "Herbaceous twiners; corolla glabrous outside or lobes with a minute apical tuft of hairs; all 5 sepals ± equally elongated in fruit or inner sepals slightly less so",
      "Woody climbers; corolla pubescent outside on midpetaline bands; outer 2 or 3 sepals greatly elongated in fruit, inner sepals much less so.",
      "Flowers mostly less than 8 mm, white, in ± crowded panicles; bracteoles minute, scalelike; fruiting sepals with a single midvein and reticulate secondary veins",
      "Flowers 10-35(-50) mm, blue, violet, or white, in racemes or few-branched panicles; bracteoles sepal-like, forming a secondary calyx (calycle) immediately below calyx; fruiting sepals with 7, 9, or 11 parallel longitudinal veins",
      "Plants erect or sprawling, never twining; bracts tiny, not enlarged in fruit; styles 2-cleft; stigmas terete, filiform or slightly clavate",
      "Plants climbing; 1 bract greatly enlarged, winglike in fruit; styles entire; stigmas peltate or reniform, rather deeply lobed",
      "Stigmas elliptic, ovate-oblong, oblong, ovate, or linear, usually ± flattened; calyx not enlarged in fruit or outer 3 sepals somewhat enlarged, inner sepals less so.",
      "Herbs prostrate; leaves linear, oblong-linear, lanceolate-elliptic, or oblanceolate to spatulate, base hastate, ± clasping stem; inner 3 sepals tapering into slender points apically; pollen pantoporate",
      "Herbs twining or woody climbers (sometimes prostrate); leaves variously shaped, usually wider, bases rarely clasping (except some Merremia hirta); inner sepals tapering into slender points apically; pollen colpate or rugate.",
      "Stems (and often petioles, peduncles) winged; fruit with a thickened circumscissile lid that separates from ± papery and tardily shattering endocarp",
      "Corolla pale yellow or whitish, center purple; bracts oblong-lanceolate, attached visibly below calyx; capsule pilose",
      "Corolla pinkish, lavender, or white, center often paler; bracteoles sepal-like, broadly ovate or elliptic, attached just below and closely enclosing calyx; capsule glabrous"
    ],
    "authors":"Ruizheng Fang & George Staples"
  },
  {
    "group_title":"Gentianaceae through Boraginaceae",
    "family":"Gentianaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10362",
    "knowledge_content":[
      "Herbs [shrubs or small trees], annual, biennial, or perennial. Stems ascending, erect, or twining. Leaves opposite, less often alternate or whorled, simple, base connate; stipules absent. Inflorescences simple or complex cymes, sometimes reduced to sessile clusters, often in a thyrse or 1-flowered. Flowers bisexual, rarely unisexual, 4 or 5 (or 6-8)[-12]-merous. Calyx tubular, obconic, campanulate, or rotate, lobes joined at least basally. Corolla tubular, obconic, salverform, funnelform, campanulate, or rotate, rarely with basal spurs; lobes overlapping to right or rarely valvate in bud; plicae (extensions of the corolla tube between the lobes) present or absent. Stamens inserted on corolla tube or occasionally at sinus between corolla lobes, alternate with lobes; anthers basifixed or dorsifixed, 2-locular. Nectaries absent or attached to ovary base or corolla. Ovary usually 1-locular at least apically, rarely 2-locular due to intrusion of a lamellate placenta into locular cavity. Fruit a 2-valved capsule, rarely a berry. Seeds many or rarely few, small; endosperm abundant [scant in saprophytic genera].",
      "About 80 genera and 700 species: worldwide; 20 genera and 419 species in China, of which two genera and 251 species are endemic.Ho Ting-nung; Liu Shang-wu, & Wu Ching-ju in Ho Ting-nung, ed. 1988. Gentianaceae. Fl. Reipubl. Popularis Sin. 62: 1-411.",
      "Fertile stamens 1 or 2 (or 3), with distinctly longer filaments; sterile stamens 2 or 3, anthers nonfunctional, filaments distinctly shorter to nearly absent",
      "Stems (at least flowering stems) ascending to erect, neither twining nor trailing (plants may be stoloniferous).",
      "Calyx tube with 5 vascular bundles; nectaries forming a collarlike disc around gynophore; stamens unequal, recurved",
      "Filaments broadly and asymmetrically winged below middle, abruptly narrowed apically; seeds broadly winged, discoid",
      "Filaments flattened or narrowly winged, tapering gradually toward apex; seeds variously winged or wingless, not discoid",
      "Perennials; basal leaves in a well-developed rosette with blades mostly over 5 cm; stem leaves in 1-3 pairs; capsules distinctly curved, valves with bent or twisted tips",
      "Annuals; basal leaves not in a rosette or rosette leaves not larger than stem leaves; stem leaves often more than 3 pairs; capsules straight, valves without bent or twisted tips.",
      "Corolla blue or purple; leaf blade over 2 × 1 mm but usually much larger; corolla lobes valvate in bud at least toward base",
      "Corolla lobe with 2 nectaries each in a conspicuous pit; corolla tissue associated with nectary and pit sometimes basally connate, apically lobulate or lamellate",
      "Corolla lobe with 1 nectary not in a conspicuous pit; corolla tissue associated with nectaries lamellate or galeate appendaged, margin entire or erose",
      "Flowers 4merous; 2 outer calyx lobes narrower than and basally overlapping 2 inner lobes; discontinuous intracalycular membranes present",
      "Flowers 4 or 5merous; calyx lobes equal or nearly so, not overlapping nor in 2 distinct pairs; intracalycular membranes absent.",
      "Corolla lobe with 2 nectaries each in a conspicuous pit; corolla tissue associated with nectary and pit sometimes basally connate, apically lobulate or lamellate",
      "Corolla lobe with 1 nectary not in a conspicuous pit; corolla tissue associated with nectaries lamellate or galeate appendaged, margin entire or erose"
    ],
    "authors":"Ting-nung Ho & James S. Pringle"
  },
  {
    "group_title":"Gentianaceae through Boraginaceae",
    "family":"Hydrophyllaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10428",
    "knowledge_content":[
      "Herbs or shrubs, glabrous or pubescent, occasionally glandular, bristly, or thorny. Leaves alternate or opposite, occasionally in a basal rosette, simple or variously lobed or divided, without stipules. Inflorescences solitary flowers, cymose, or paniculate. Flowers bisexual, actinomorphic, usually 5-merous, often showy. Calyx ± gamosepalous, sinuses sometimes appendaged. Corolla gamopetalous, campanulate, tubular, or rotate; lobes overlapping in bud. Stamens usually 5; filaments attached to corolla, often alternating with scalelike appendages; anthers 2-locular, longitudinally dehiscent. Ovary superior, 1- or 2- (several) locular, with 2 parietal placentae; ovules few or numerous. Styles 1 or 2, usually lobed or divided; stigma capitate. Fruit a loculicidal capsule, rarely also septicidal or opening irregularly. Seeds usually with a sculptured or pitted coat; endosperm enclosing a small embryo.",
      "Eighteen to 22 genera and ca. 300 species: mostly in North and South America, with a few in Africa, Asia, and Australia; one genus with one species in China.\r",
      "Fang Rhui-cheng & Huang Shu-hua in Wu Cheng-yih, ed. 1979. Hydrophyllaceae. Fl. Reipubl. Popularis Sin. 64(1): 160-161."
    ],
    "authors":"Ruizheng Fang & Constance Lincoln"
  },
  {
    "group_title":"Gentianaceae through Boraginaceae",
    "family":"Menyanthaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10562",
    "knowledge_content":[
      "Herbs perennial [or annual], aquatic or nearly so. Leaves alternate, rarely opposite, simple or 3foliolate; stipules absent. Flowers (4 or) 5merous. Calyx lobes free or united. Corolla lobes united, valvate in bud. Stamens 5, free, alternate with petals. Ovary 1celled. Pollen grains bilaterally compressed, ± triquetrous, with 3 apertures. Ovary superior, 1celled. Fruit a dehiscent or indehiscent capsule. Seeds few to many, sometimes winged; endosperm abundant.",
      "Five genera and about 60 species: worldwide in temperate and tropics; two genera and seven species in China.\r",
      "On the basis of differences in anatomy, chemistry, and palynology, recent phylogenetic accounts treat the Menyanthaceae as a separate family from Gentianaceae. Recent molecular evidence (Olmstead et al. Ann. Missouri Bot. Gard. 79: 249-265. 1992; Downie & Palmer 79: 266-283. 1992) also supports this conclusion. The Menyanthaceae have been placed in the Gentianales (Takhtajan, Flowering Pl. 230. 1969), Solanales (Cronquist, Evol. Class. Flowering Pl., ed. 2, 420-425. 1988), or Campanulales (Thorne, Aliso 13: 365-389. 1992). Ho Ting-nung. 1988. Gentianaceae [Menyanthoideae]. Fl. Reipubl. Popularis Sin. 62: 411-418."
    ],
    "authors":"Ting-nung Ho & Robert Ornduff"
  }
]