[
  {
    "group_title":"Pteridophytes",
    "family":"Aspleniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10072",
    "knowledge_content":[
      "Plants small to medium-sized, predominantly epilithic or terrestrial, but also many epiphytic. Rhizome creeping, decumbent, or erect, radial or dorsiventral (Hymenasplenium), sometimes massive and bearing detritus-collecting fronds, scaly; scales narrowly triangular, clathrate with anticlinal walls thickened and periclinal walls translucent, often costate and with a central zone of cells with thicker anticlinal walls, in some taxa becoming completely opaque, rarely whole scale black and opaque, margins entire, dentate, or with short or long outgrowths (fimbriate scales), often with a terminal glandular cell, both surfaces glabrous. Fronds remote (in China mainly in Hymenasplenium) or clustered, spirally arranged or in two abaxial rows (Hymenasplenium), herbaceous or leathery to subfleshy, with scales similar to those on rhizome or gradually reduced in size (mini-scales) and filiform to hastate-stellate, usually with small, 3- or 4-celled uniseriate hairs terminating in a gland, rarely glandular or completely glabrous, occasionally gemmiferous with buds often on, but not restricted to, rachis or at pinna apex; stipe usually distinct, not articulate, rarely forming a trophopod (Asplenium adiantum-nigrum) or persistent (Hymenasplenium), distinctly scaly at base, green to grayish brown, in some species castaneous to black and then often shiny, rounded to grooved (sulcate) adaxially, with two vascular bundles at its base, upward near rachis combined into one X-shaped bundle. Lamina outline variable, from simple to 4-pinnate, apical pinnae usually reduced and confluent into a pinnatifid apex, rarely conform with lateral pinnae (e.g., A. formosae), usually branching anadromously; rachis structure variable, adaxially often sulcate, with or without central supravascular ridge, with or without lateral wings derived from decurrent frond margins, rarely with an abaxial wing (A. tripteropus); pinnae and other divisions often more strongly developed in direction of apex, ultimate pinnules or segments often rhombic, trapeziform, or cuneiform with asymmetrical base, rarely dimidiate, margin rarely entire, more often repand or sinuate to crenate or serrate, each tooth usually with a single vein. Veins mostly free, anadromously branching, veinlets usually not reaching margin, with or without terminal hydathode, rarely anastomosing near margin or with a marginal connecting vein (A. subg. Thamnopteris C. Presl); some species with a dissected lamina have one single vein per ultimate segment. Sori single, rarely \"double\" on two different veins (A. subg. Phyllitis (Hill) Jermy & Viane), or J-shaped (e.g., A. fontanum), linear to subelliptic, attached along one side of a veinlet, usually indusiate (indusium reduced in A. subg. Ceterach (Willdenow) Vida ex Bir, Fraser-Jenkins & Lovis); indusia thinly membranous to thick and firm, usually flat but occasionally rolling back at maturity, free margin entire to erose, sinuate, fimbriate, glandular, or rarely with mini-scales, attached laterally along a veinlet, opening toward costa, costule, or vein from which soriferous vein originated, in some species with a dissected lamina seemingly opening toward margin (A. prolongatum). Sporangia with a vertical annulus of ca. 20 thickened cells, stalk uniseriate, not glandular. Spores usually 64 per sporangium, bilateral, elliptic to reniform, monolete; exospore smooth, perispores elaborate and very variable, consisting of three layers, outer with ridges (lophate), spines (echinate), or with large pori (reticulate) and no ridges or spines, or a combination. Plants sexual or agamosporous and then often with only 32 spores per sporangium, x = (35)36 in Asplenium, but (36, 38)39 in Hymenasplenium.\r",
      "Two genera and ca. 700 species: subcosmopolitan, but mainly in montane and (sub)tropical regions; two genera and 108 species and species complexes (Hymenasplenium) (25 endemic) in China.",
      "Rhizome erect or shortly creeping, if long creeping then usually more than 0.6 cm in diam. and densely scaly throughout; fronds remote or clustered, lamina simple to 4-pinnate; costa usually with all basal basiscopic veins present.",
      "Rhizome long creeping, usually less than 0.6 cm in diam. and with very few scales except near apex; fronds remote, lamina rarely simple, usually 1-pinnate; costa usually with several (rarely one) basal basiscopic veins absent."
    ],
    "authors":"Youxing Lin & Ronald Viane"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Athyriaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10078",
    "knowledge_content":[
      "Plants terrestrial or epilithic, small to medium-sized, sometimes large. Rhizome long or shortly creeping, ascending or erect, rarely short treelike, dictyostelic, scaly; scales entire or toothed, tooth consisting of 2 adjacent upturned ends of marginal cells, basifixed, rarely pseudopeltate. Stipe supplied by 2 vascular strands with xylem seahorse-shaped in cross section and upward united into U-shaped strand, scaly, also hairy or glabrate, hairs unicellular or multicellular, glandular or eglandular. Rachis, costae, and costules grooved adaxially, grooves of costae and costules confluent to those of lower order frond axes or interrupted by ridges between grooves, scaly, hairy, or glabrate; hairs unicellular or multicellular, glandular or eglandular; spines continued from ridges, or short fleshy projections in grooves, at base of costae, costules, and midribs adaxially, or spines and projections absent. Lamina variously dissected, simple to 3-pinnate, pinnatifid or with terminal pinna similar to lateral pinnae, apex narrowed. Veins free or anastomosing with polygonal areoles or with successive veins from adjacent midribs united to excurrent veins between 2 rows of rhomboid areoles. Sori various, linear, J-shaped, horseshoe-shaped, orbicular-reniform, or orbicular, indusiate or exindusiate; indusia inferior entirely or proximally to receptacle, or lateral, various in shape, sack-shaped, cup-shaped, saucer-shaped, platelike, elongate, J-shaped, horseshoe-shaped, or orbicular-reniform. Spores bilateral, ellipsoid, covered by perispore.\r",
      "Five genera and ca. 600 species: worldwide from tropical to frigid zones of both hemispheres; five genera and 278 species (135 endemic) in China.",
      "Of the genera recognized in FRPS (3(2): 32-504. 1999), Rhachidosorus and Diplaziopsis were recently segregated as families Rhachidosoraceae and Diplaziopsidaceae, respectively. Athyriaceae s.s. or subfamily Athyrioideae comprise Anisocampium (including Kuniwatsukia), Athyrium (including Pseudocystopteris), Cornopteris (including Neoathyrium), Deparia (including Athyriopsis, Dictyodroma, Dryoathyrium, and Lunathyrium), and Diplazium (including Allantodia, Callipteris, and Monomelangium). Subfamily Cystopteridoideae was raised to family Cystopteridaceae.Wang Zhong-ren, Chu Wei-ming, He Zhao-rong & Hsieh Yin-tang. 1999. Athyriaceae (excluding Acystopteris, Cystoathyrium, Cystopteris, Diplaziopsis, Gymnocarpium, and Rhachidosorus). In: Chu Wei-ming, ed., Fl. Reipubl. Popularis Sin. 3(2): 32-511.",
      "Grooves on adaxial side of costae interrupted at base of costa, not confluent to groove of rachis (if lamina simple then rhizome long creeping); stipe, rachis, costae, and veins with multicellular hairs or subglabrate.",
      "Stipe bases on ascending to erect rhizomes swollen with pneumatophores, frond axes V-shaped in cross section, acroscopic basal pinnules larger than others, laminar margin cartilaginous or not, spines present adaxially at junction of costules or not; sori horseshoe-shaped, J-shaped, or linear; scales entire.",
      "Stipe bases neither swollen nor bearing pneumatophores, frond axes U-shaped with a flat base in most species, acroscopic basal pinnules equal or smaller, laminar margin not cartilaginous, spines absent; sori linear; scales toothed or entire."
    ],
    "authors":"Zhongren Wang, He Zhaorong & Masahiro Kato"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Blechnaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10108",
    "knowledge_content":[
      "Plants mostly terrestrial, sometimes tree ferns (like small trees), rarely scandent. Rhizome mostly erect, or creeping or scandent, usually dictyostelic (Stenochlaena meristelic), scales brown, entire. Fronds monomorphic or dimorphic, mostly long stipitate; stipe with 2 to several vascular bundles, scaly at base; lamina pinnate, pinnatifid, or bipinnatifid, rarely simple, thickly papery to leathery, glabrous or usually with small scales; pinnae rarely articulate to rachis (Stenochlaena); veins free or anastomosing with 1 or more series of areoles, without included free veinlets. Sori elongate or continuous along vascular network or commissure on either side of midrib, indusiate, rarely exindusiate, rarely acrostichoid; indusium facing toward costa or costule; annulus longitudinal, interrupted. Spores elliptic, bilateral, monolete.\r",
      "About (2-)14 genera and ca. 250 species: worldwide, but with greatest diversity in the S tropics; eight genera and 14 species (one endemic) in China.",
      "Stenochlaena has been separated as the sole genus of Stenochlaenaceae or Blechnaceae subfamily Stenochlaenoideae. Christenhusz et al. (Phytotaxa 19: 48-49. 2011) listed seven genera of Blechnaceae but indicated that the actual number of genera was very uncertain and could be anywhere between two and nine, depending mainly on a better understanding of Blechnum.Shing Kunghsia. 1990. Stenochlaenaceae. In: Ching Renchang & Shing Kunghsia, eds., Fl. Reipubl. Popularis Sin. 3(1): 94-97; Wu Shiew-hung. 1999. Blechnaceae. In: Wu Shiew-hung, ed., Fl. Reipubl. Popularis Sin. 4(2): 192-215.",
      "Sori acrostichoid with sporangia covering entire abaxial surface of fertile pinna; pinnae articulate at junction with rachis; rhizome scales peltate, ca. 1 mm, caducous.",
      "Sori distinct, covered by indusia when young; pinnae not articulate; rhizome scales basifixed, 4 mm or more, often persistent",
      "Rhizome short and erect; stipes tufted; pinnae separate, rachis terete; sori in lines parallel to costules, discrete.",
      "Rhizome creeping; stipes distant; pinnae connected by narrow wing along rachis; sori along rachis and costae almost continuous, those along costules ?discrete.",
      "Blechnidium  T. MooreBlechnum  LinnaeusBrainea  J. SmithChieniopteris  ChingDiploblechnum  HayataStenochlaena  J. SmithStruthiopteris  ScopoliWoodwardia  J. E. Smith"
    ],
    "authors":"Wang Faguo, Prof. Fuwu Xing, Shiyong Dong & Masahiro Kato"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Cibotiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20904",
    "knowledge_content":[
      "Plants terrestrial; rhizomes massive, creeping to ascending or erect (up to 6 m), solenostelic or sometimes dictyostelic with vascular bundles lacking sclerenchymatous sheath, bearing adventitious roots, densely covered with soft, yellowish brown, multicellular long hairs at apices and persistent stipe bases. Fronds approximate, forming a crown at apex, monomorphic or dimorphic, mostly 2-4 m; stipe hairy at base, with 3 corrugated vascular bundles (1 abaxial, 2 adaxial) arranged in an omega-shape with adaxial ends curved strongly inward, or with abundant V-, U-, or W-shaped vascular bundles arranged in omega configuration, sometimes adaxial inwardly recurved arms of vascular bundles forming an isolated set of bundles in a reversed U-shape; stipe flattened on adaxial face with lateral aerophores (pneumatophores) forming a line on each side; lamina 2-pinnate + pinnatifid to 3-pinnate + pinnatifid, firm, often glaucous abaxially, glabrous when mature or persistently hairy on rachis, costa, costules, and veins; rachis hairy in middle, in dried material often sulcate in middle of ridge, which is flanked by 2 grooves; sterile segments entire or crenate; fertile segments poorly differentiated; veins free, simple or forked to pinnate; stomata paracytic with 3 subsidiary cells. Sori single, marginal at vein ends, indusiate; indusia bivalvate, each with a strongly differentiated, non-green outer indusium and a similarly modified tonguelike inner indusium; paraphyses few, short and brown; spores globose-tetrahedral, with prominent angles and a well-developed equatorial flange; antheridial walls 5-celled. x = 68.\r",
      "One genus and ca. 11 species: E and SE Asia, Central America, Pacific islands (Hawaii); two species in China.",
      "A fossil permineralized rhizome Cibotium iwatense Ogura (1933) is described from the Late Cretaceous of Iwate Prefecture, Japan.The Cibotiaceae are monophyletic, with affinity to the tree fern families.Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Dicksoniaceae. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 197-198."
    ],
    "authors":"Zhang Xianchun & Harufumi Nishida"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Cyatheaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10240",
    "knowledge_content":[
      "Plants terrestrial, large to very large, less often medium-sized, with short to usually long, erect, slender to robust, apically scaly stem. Stems with dictyosteles, apices (and usually stipe bases) covered with large scales, sometimes also with small scales or hairs. Fronds usually large (up to 5 m); stipe with obvious, usually discontinuous pneumathodes in two lines; lamina 1-3-pinnate (rarely simple); veins simple to forked, free, rarely anastomosing. Sori superficial (abaxial) or terminal on veins and marginal or submarginal, orbicular, exindusiate, or indusia saucerlike, cuplike, or globose and completely surrounding sporangia, or bivalvate; sporangia maturing gradually, with oblique annuli; receptacles raised; paraphyses usually present; spores tetrahedral, trilete, variously ornamented; gametophytes green, cordate. x = 69.\r",
      "About five genera and more than 600 species: pantropical; two genera and 14 species (one endemic) in China.",
      "Zhang Xianchun. 2004. Cyatheaceae. In: Zhang Xianchun, ed., Fl. Reipubl. Popularis Sin. 6(3): 249-274.",
      "Stipe stramineous or purple, not black; cells of scale all essentially similar and edge often toothed or even ciliate.",
      "Stipe dark or black; cells of scale narrow near center, surrounded by a broad margin of differently shaped cells, edge toothed or ciliate, with a prominent dark terminal seta or spine."
    ],
    "authors":"Zhang Xianchun & Harufumi Nishida"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Cystopteridaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20903",
    "knowledge_content":[
      "Plants small to medium-sized, summer-green; rhizomes slender, creeping or ascending; costae articulate to rachis (in Gymnocarpium) or not so; lamina pinnate to 3(or 4)-pinnate-pinnatifid; veins free; sori orbicular or elongate, abaxial on veins, indusiate or exindusiate; indusia ovate-lanceolate, ovate, or orbicular, attached proximally to receptacle. x = 40, 42.\r",
      "Four genera and more than 30 species: worldwide, mainly in the temperate and cold temperate zones and tropical mountains; four genera (one endemic) and 20 species (ten endemic) in China.",
      "Wang Zhong-ren. 1999. Acystopteris, Cystoathyrium, Cystopteris, and Gymnocarpium. In: Chu Wei-ming, ed., Fl. Reipubl. Popularis Sin. 3(2): 38-74.",
      "Multicellular articulate hairs present on stipe and lamina; indusia small, often hidden under sporangia.",
      "Lamina deltoid to lanceolate, base slightly narrowed or broadest part of lamina; spore wall echinate."
    ],
    "authors":"Zhongren Wang, Christopher Haufler, Kathleen M. Pryer & Masahiro Kato"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Davalliaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10256",
    "knowledge_content":[
      "Plants small to moderate-sized, epiphytic, epilithic, or rarely terrestrial. Rhizome long creeping, dorsiventral, densely covered with peltate or basifixed scales; fronds usually in 2 rows. Fronds remote; stipe articulate at base to short or long phyllopodia; lamina simple, imparipinnate, or pinnatifid to 4-pinnate-pinnatifid, firmly herbaceous to leathery, glabrous or sometimes covered with scales or hairs; veins free, usually forked. False veins present in several species. Sporangia typically separately borne in a small discrete sorus terminal on veins, submarginal or sometimes medial [in Humata undulata (Alderwerelt) M. Kato & Tsutsumi connate and elongate along lamina margins]; indusium opening toward margin, attached at base and sometimes at sides, orbicular, reniform, or elongate toward margin. Sporangia long stalked, 3-seriate, annulus longitudinal, consisting of 12-16 thickened cells; spores monolete, elliptic or narrowly elliptic, translucent, usually without perispore.\r",
      "Five genera (one according to Nooteboom) and ca. 35 species: mostly in tropical and subtropical Asia, a few species extending to Africa, one species in NW Africa, SW Europe, and Macaronesia; four genera and 17 species (three endemic) in China.",
      "One of us (Nooteboom) considers that only one genus, Davallia, can be recognized in the Davalliaceae. Paradavallodes multidentata is nested in Araiostegia + Davallodes, which is a polymorphic basal clade. Among species examined, A. hymenophylloides (Blume) Copeland is the type of Araiostegia, and P. multidentata is the type of Paradavallodes. Therefore, the earliest published-Davallodes (Copeland) Copeland-should be used as the generic name. However, from morphology and DNA there are no arguments to recognize this genus. The Humata clade looks quite distinct as an entity, although it contains Davallia corniculata, renamed to H. corniculata by Kato, and in all other systems this is a Davallia. Tsutsumi, Zhang and Kato did not analyze D. wagneriana Copeland and included it in Davallia, but morphologically this is the closest relative of D. corniculata. It should belong to Humata; or better, Humata is part of Davallia (Tsutsumi, Zhang & Kato, Syst. Bot. 33: 44-48. 2008).However, two of us (Xing and Wang) consider that morphological and molecular phylogenetic studies do not support there being only one genus (e.g., Sen, Sen & Holttum, Kew Bull. 27: 217-243. 1972; Kato and Tsutsumi, Acta Phytotax. Geobot. 59: 1-14. 2008; and Tsutsumi, Zhang & Kato, Syst. Bot. 33: 44-48. 2008). A recent study about the leaf epidermis and spore morphology of Davalliaceae (He Chunmei, A taxonomic revision of Davalliaceae in China. Graduate University of Chinese Academy of Sciences, Guangzhou. 2012) also supports Araiostegia, Humata, and Paradavallodes as natural genera.Polyploidy, through hybridization and polyploidization, has been assessed in the Humata group, and these polyploids appeared to be apomictic. This could very well also be the case in other groups. With only cpDNA, the phylogeny of a group like this cannot be assessed. Moreover, in Davalliaceae, incongruence between CpDNA and nrDNA is found on the generic level but is not yet explained (C. W. Chen et al., Insights into Evolutionary History of the Humata repens Complex in Taiwan. 5th Symp. Asian Pteridol. Fern Show: Progr. & Abstr. 42. 2010; C. W. Chen & Nooteboom, ined.).Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Davalliaceae (excluding Arthropteris, Gymnogrammitis, Leucostegia, and Nephrolepis). In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 280-319, 374-378; Wu Shiewhung. 1999. Davalliaceae (excluding Leucostegia). In: Wu Shiewhung, ed., Fl. Reipubl. Popularis Sin. 6(1): 161-197.",
      "Lamina lanceolate, both surfaces and\/or rachis covered with gray pubescence; basal pinnae similar to upper one."
    ],
    "authors":"Prof. Fuwu Xing, Wang Faguo & Hans P. Nooteboom"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Dennstaedtiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10262",
    "knowledge_content":[
      "Authors: Yan Yuehong, Qi Xinping, Wenbo Liao, Prof. Fuwu Xing, Ding Mingyan, Wang Faguo, Zhang Xianchun, Zhaohong Wu, Shunshuke Serizawa, Jefferson Prado, Michele Funston, Michael G. Gilbert & Hans P. Nooteboom",
      "Plants terrestrial, sometimes climbing. Rhizome usually long creeping, solenostelic, siphonostelic, or polystelic, usually covered with multicellular hairs, less often with few-celled, cylindrical, glandular hairs or multicellular bristles, scales absent. Fronds medium-sized to large, sometimes indeterminate, monomorphic; stipes not articulate to rhizome, usually hairy, rarely glabrous; lamina 1-4-pinnately compound, thinly herbaceous to leathery, hairy or glabrous, without scales; rachis grooved adaxially, sometimes with buds (Monachosorum); pinnae opposite or alternate; veins usually free, pinnate or forked, not reaching margin, reticulate without included veinlets in Histiopteris. Sori marginal or intramarginal, linear or orbicular, terminal on a veinlet or on a vascular commissure joining apices of veins; indusia linear or bowl-shaped, sometimes double with outer false indusium formed from thin reflexed lamina margin and inconspicuous inner true indusium; paraphyses present or not. Spores tetrahedral and trilete, or reniform and monolete, spinulose, tuberculate, or smooth. Gametophytes green, cordate. x = 26, 29, 30, 31, 33, 34, 38, 46, 47, 48, and probably others.\r",
      "Ten or 11(-15) genera and ca. 170(-300) species: mostly tropical but also extending into temperate regions; seven genera and 52 species (16 endemic) in China.",
      "Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Dennstaedtiaceae and Monachosoraceae. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 198-256, 357-371; Wu Shiewhung. 1990. Pteridiaceae and Histiopteris. In: Ching Renchang & Shing Kunghsia, eds., Fl. Reipubl. Popularis Sin. 3(1): 1-10, 89-90.",
      "Sori naked or protected by reflexed marginal tooth or flap, sometimes also with a linear inner true indusium",
      "Rhizome with bristlelike, chestnut-brown scales; pinnae always opposite with a reduced pair of basal stipulelike pinnules.",
      "Rhizome hairy, scales absent; pinnae opposite or alternate with basal pinnules similar to more distal pinnules",
      "Lamina thinly herbaceous, dark green to blackish; rhizome with glandular hairs; gemmae usually present on rachis.",
      "Lamina papery to leathery, rarely herbaceous, green to pale green; rhizome with eglandular or a mixture of glandular and eglandular hairs; gemmae absent",
      "Sori terminal on vein, orbicular or oval, each protected by a reflexed tooth or marginal flap, or naked.",
      "Sori along marginal connecting vein, linear, protected by double indusium, outer layer formed from inrolled lamina margin, inner true indusium thinner, inconspicuous, sometimes absent",
      "Dennstaedtia  BernhardiHistiopteris  (J. Agardh) J. SmithHypolepis  BernhardiMicrolepia  C. PreslMonachosorum  KunzePaesia  J. Saint-HilairePteridium  Gleditsch ex Scopoli"
    ],
    "authors":"Yan Yuehong, Qi Xinping, Wenbo Liao, Prof. Fuwu Xing, Ding Mingyan, Wang Faguo, Zhang Xianchun, Zhaohong Wu, Shunshuke Serizawa, Jefferson Prado, Michele Funston, Michael G. Gilbert & Hans P. Nooteboom"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Diplaziopsidaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20902",
    "knowledge_content":[
      "Plants medium-sized or large, usually in forests near or beside streams. Rhizomes decumbent to erect, thick. Lamina 1-pinnate, imparipinnate, with pinnae entire, glabrous; veins free on either side of midrib, fully anastomosing toward margins and forming 2-4 rows of areoles, without included free veinlets. Sori elongate along long veins close to midrib, covered by a similarly elongate, membranous indusium; indusia usually 3-8 mm, sometimes up to 1-2 cm, arched, sausage-shaped. Spores with winglike fimbriate and echinate folds, or low perforate plain folds. x = 41, 40 or 31.\r",
      "Three genera and five species: tropical America, tropical, subtropical, and temperate Asia; one genus and three species in China.",
      "Based on molecular evidence (R. Sano et al., Molec. Phylogen. Evol. 15: 403-413. 2000; Wei et al., Acta Bot. Yunnan., suppl. 17: 46-54. 2010), the family Diplaziopsidaceae consisting of Diplaziopsis and Homalosorus Small ex Pichi Sermolli (and provisionally Hemidictyum C. Presl) was proposed by X. C. Zhang and Christenhusz (Phytotaxa 19: 15. 2011).Chu Wei-ming & He Zhao-rong. 1999. Diplaziopsis. In: Chu Wei-ming, ed., Fl. Reipubl. Popularis Sin. 3(2): 499-504."
    ],
    "authors":"He Zhaorong & Masahiro Kato"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Dipteridaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10283",
    "knowledge_content":[
      "Rhizome long creeping, solenostelic or protostelic, covered with bristles or articulate hairs. Stipe with a single vascular bundle proximally and polystelic distally; lamina (sterile ones, at least) cleft into 2 or often more subequal parts; veins highly reticulate, with included veinlets. Sori exindusiate, discrete, compital (at intersection of connecting veins), scattered over surface, or fronds dimorphic and fertile ones covered with sporangia; sporangia maturing simultaneously or maturation mixed, with 4-seriate stalks; annuli almost vertical or slightly oblique; spores ellipsoid and monolete, or tetrahedral and trilete, surface smooth or rugulose, ca. 64 or ca. 128 per sporangium; gametophytes cordate-thalloid. x = 33.\r",
      "Two genera and ca. 11 species: E and S China, India, C and S Japan, and from SE Asia to Melanesia and W Polynesia; two genera and five species in China.",
      "The Dipteridaceae are a rather primitive group of ferns related to the Gleicheniaceae and distant from the Polypodiaceae, with the fossil record beginning in the Upper Triassic.Lin Youxing. 2000. Dipteridaceae and Cheiropleuriaceae. In: Lin Youxing, ed., Fl. Reipubl. Popularis Sin. 6(2): 1-6.",
      "Fronds monomorphic, divided into 2 subequal fan-shaped halves, each with deeply incised lobes; sori discrete; spores monolete."
    ],
    "authors":"Zhang Xianchun, Masahiro Kato & Hans P. Nooteboom"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Dryopteridaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10291",
    "knowledge_content":[
      "Authors: Li-Bing Zhang, Sugong Wu, Xiang Jianying, Prof. Fuwu Xing, He Hai, Wang Faguo, Shugang Lu, Shiyong Dong, David S. Barrington, Kunio Iwatsuki, Maarten J. M. Christenhusz, John T. Mickel, Masahiro Kato & Michael G. Gilbert",
      "Plants small to large, evergreen or deciduous, terrestrial, epilithic, hemiepiphytic, or epiphytic. Rhizomes erect, ascending, creeping, or sometimes climbing, dictyostelic (mostly radially), scaly; scales basally attached or very rarely peltate, often non-clathrate but sometimes clathrate, entire or dentate. Fronds caespitose or remote from one another, with segments anadromously or catadromously arranged, or sometimes anadromous at base and catadromous distally; stipe often not articulate but sometimes articulate at base, with 3 or more vascular bundles arranged in a semicircle or circle, scaly, sulcate adaxially, not hairy or sometimes hairy; lamina monomorphic or dimorphic, usually oblong, deltoid, pentagonal, lanceolate, ovate, or linear, 1-5-pinnate, or simple, rarely imparipinnate, scaly, glandular, hairy, or glabrous; if scaly then scales bullate or flat; glands absent or present; texture thinly papery, papery, or leathery. Rachises sulcate adaxially, with or without proliferous bulbils, rarely proliferous bulbils borne at a prolonged flagelliform rachis terminal; venation pinnate and free, or variously anastomosing to form 1 to multiple rows of areoles, with or without included veinlets. Fertile fronds conform or weakly to strongly difform with sterile fronds. Sporangia usually in orbicular sori; sori terminal, subterminal, or dorsal on veins, indusiate or rarely exindusiate; if indusiate then indusia orbicular or reniform or rarely ovoid, superior, lateral, or rarely inferior, sessile or rarely stalked, entire or toothed; sometimes sporangia nearly evenly covering fertile parts abaxially (not forming orbicular sori); sporangia with 3-rowed, short to long stalks. Spores monolete, achlorophyllous, with prominent perispore. x = 41.\r",
      "About 25 genera and 2,100 species: nearly cosmopolitan, but highest diversity found in E Asia (Dryopteris, Polystichum) and the New World (Ctenitis, Elaphoglossum); ten genera and 493 species (260 endemic) in two subfamilies in China.",
      "Eighty percent of the 2,100 species are in four genera (Ctenitis, Dryopteris, Elaphoglossum, and Polystichum). Subfamily Dryopteridoideae includes 17 genera: Adenoderris J. Smith, Arachniodes (incl. Leptorumohra, Lithostegia, Phanerophlebiopsis), Coveniella Tindale, Ctenitis (incl. Ataxipteris), Cyclodium C. Presl, Cyrtomium, Dryopolystichum Copeland, Dryopteris (incl. Acrophorus, Acrorumohra, Dryopsis, Nothoperanema, Peranema, Revwattsia D. L. Jones), Lastreopsis, Maxonia C. Christensen, Megalastrum Holttum, Phanerophlebia C. Presl, Polystichopsis (J. Smith) Holttum, Polystichum (incl. Cyrtogonellum, Cyrtomidictyum, Papuapteris Christensen, Plecosorus, Sorolepidium), Rumohra Raddi, Stenolepia Alderwerelt, and Stigmatopteris C. Christensen. Subfamily Elaphoglossoideae includes eight genera: Arthrobotrya C. Christensen, Bolbitis (incl. Egenolfia), Elaphoglossum (incl. Microstaphyla C. Presl, Peltapteris Link), Lomagramma, Mickelia R. C. Moran, Labiak & Sundue, Olfersia Raddi, Polybotrya Humbolt & Bonpland ex Willdenow, and Teratophyllum. These genera are placed in Dryopteridaceae on the basis of morphology and, for most, molecular studies as well.Wang Chuhao. 1999. Ctenitis, Lastreopsis, Bolbitidaceae, and Lomagramma. In: Wu Shiewhung, ed., Fl. Reipubl. Popularis Sin. 6(1): 2-37, 56-59, 104-124, 129-133; Wu Shiew-hung. 1999. Peranemataceae [\"Peranemaceae\"]. In: Wu Shiew-hung, ed., Fl. Reipubl. Popularis Sin. 4(2): 216-238; Wu Shiewhung. 1999. Elaphoglossaceae. In: Wu Shiewhung, ed., Fl. Reipubl. Popularis Sin. 6(1): 134-142; Hsieh Yingtang, Wu Sugong & Lu Shugang. 2000. Dryopteridaceae (1). In: Wu Sugong, ed., Fl. Reipubl. Popularis Sin. 5(1): 1-220; Kung Hsianshiu, Chu Weiming, He Zhaorong, Zhang Libing & Hsieh Yingtang. 2001. Dryopteridaceae (2) (excluding Cyclopeltis). In: Kung Hsianshiu, ed., Fl. Reipubl. Popularis Sin. 5(2): 1-228.",
      "Fronds weakly to strongly dimorphic; sporangia nearly evenly covering fertile parts of fronds abaxially (2. Subfam. Elaphoglossoideae)",
      "Fronds monomorphic; if dimorphic then rachis with proliferous bulbils borne at a prolonged flagelliform rachis terminal (Polystichum sect. Cyrtomiopsis); sporangia in orbicular sori (1. Subfam. Dryopteridoideae)",
      "Stipe base not articulate; lamina pinnate or rarely bipinnate, if simple then with reticulate venation; venation often reticulate.",
      "Rhizomes often long and creeping or ascending; fronds often distant from one another; ratio of length to width of lamina often approximately 1:1; pinnule rachises and midribs often with yellow or reddish glands.",
      "Rhizomes short and erect or ascending; fronds caespitose; ratio of length to width of lamina often clearly larger than 1:1; pinnule rachises and midribs often without glands",
      "Pinnules with veins indistinct on both adaxial and abaxial surfaces; sori dorsal on veinlets; scales ciliate on their margins, clathrate, and with nearly hexagonal and lustrous areoles.",
      "Pinnules with distinct veins on abaxial surfaces; sori terminal on veinlets, and marginal; scales entire and clathrate or not, but with long and dull areoles (Dryopteris sect. Dryopsis).",
      "Sori if indusiate then indusia mostly reniform and lateral (attached to abaxial surface of fronds at notch of indusia), rarely orbicular and inferior (Dryopteris subg. Nothoperanema); if indusia ovoid then lamina finely 4- or 5-pinnate (Arachniodes superba); if sori exindusiate then ultimate segments of fronds not auriculate at acroscopic base (Dryopteris dehuaensis, D. gymnosora, D. liangkwangensis, D. polita, D. scottii, and D. shikokiana); venation free",
      "Sori if indusiate then indusia orbicular and superior, peltate; if sori exindusiate then ultimate segments of fronds clearly auriculate at acroscopic base (Polystichum alcicorne, P. glaciale, P. grandifrons, P. gymnocarpium, P. longispinosum, P. loratum, and P. rufopaleaceum) or less auriculate but microscales long, i.e., longer than 1 mm (P. longipaleatum and P. nudisorum); venation free or anastomosing",
      "Rhizomes short and erect or ascending; lamina dull or lustrous adaxially; laminar segments arranged catadromously except secondary segments of basalmost pair of pinnae of bipinnate fronds; if laminar segments arranged anadromously then lamina (2 or)3- or 4-pinnate and ultimate pinnules of lamina asymmetrical at base (Dryopteris sect. Acrorumohra).",
      "Rhizomes often long and creeping or ascending; if rhizomes short then lamina finely 4- or 5-pinnate and indusia ovoid (Arachniodes superba); lamina lustrous adaxially; laminar segments arranged anadromously.",
      "Lamina imparipinnate, apex with an apical pinna somewhat dissected at base, lamina rarely simple; venation always anastomosing to form 2 or more rows of areoles.",
      "Lamina 1-3-pinnate, apex pinnatifid, without a clear apical pinna; venation mostly free, rarely anastomosing to form 1 or 2 rows of areoles (Polystichum balansae, P. fraxinellum, P. hookerianum, P. lepidocaulon, P. ?upestris, P. trapezoideum, and P. uniseriale)."
    ],
    "authors":"Li-Bing Zhang, Sugong Wu, Xiang Jianying, Prof. Fuwu Xing, He Hai, Wang Faguo, Shugang Lu, Shiyong Dong, David S. Barrington, Kunio Iwatsuki, Maarten J. M. Christenhusz, John T. Mickel, Masahiro Kato & Michael G. Gilbert"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Equisetaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10315",
    "knowledge_content":[
      "Plants perennial, homosporous, small to large, terrestrial, aquatic, or in shallow water. Rhizome creeping, sometimes erect or ascending, blackish brown, branched, with nodes; nodes with roots densely covered with trichomes or glabrous. Aerial stems annual or perennial, erect, monomorphic or dimorphic, green but lower nodes often blackish brown, terete, with nodes, hollow and with longitudinal canals in center, often with silica tubercles on epidermis, unbranched or with whorled branches; internodes with longitudinal ridges and grooves. Leaves reduced, scalelike, whorled; lower portion fused to form a collarlike sheath around base of internode; upper portion lobed. Strobili conelike, terminal on stem or branches, terete or ellipsoid, sometimes stalked; sporophylls whorled, peltate, hexagonal in surface view, imbricate, with 5-10 sporangia per sporophyll. Sporangia saclike, in whorls on abaxial side of sporophylls. Spores green, subglobose or globose, 35-70 μm in diam., each with 4 spirally curled, white filaments (elaters) that uncurl upon drying, without colpi, with thin and transparent perispores; perispores with granular ornamentation. Gametophytes growing at or near soil surface, green, disk- to cushion-shaped, irregularly lobed. x = 108.\r",
      "Zhang Libing. 2004. Equisetaceae. In: Zhang Xianchun, ed., Fl. Reipubl. Popularis Sin. 6(3): 224-243."
    ],
    "authors":"Li-Bing Zhang & Nicholas J. Turland"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Gleicheniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10373",
    "knowledge_content":[
      "Plants terrestrial, often forming thickets. Rhizomes long creeping, protostelic, with scales or multicellular hairs. Fronds monomorphic, evergreen, erect, scrambling, or climbing, vernation circinate; stipe not articulate, distant, cylindrical, apex forked, with dormant bud; apical bud covered with hairs or scales; rachis simple to several times pseudodichotomously branched [or pinnate], with stellate hairs and\/or ciliate scales when young, these persistent or glabrescent; pinnules pectinately pinnatisect; lobes elliptic or lanceolate, apex obtuse or acute; veins free, forked; lamina papery or subleathery, frequently glaucous abaxially. Sori in 1(-3) lines on both sides of lobe costules, orbicular, exindusiate; sporangia 2-10[-16], sessile, turbinate, with a mid-transverse annulus; spores tetrahedral or reniform, without perispore, smooth.\r",
      "Three to five genera depending on concepts of authors and over 150 species: tropical and subtropical areas; three genera and 15 species (six endemic) in China.",
      "Most species in the Gleicheniaceae are characteristic of very mineral-poor soils.Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Gleicheniaceae. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 116-132, 346-350.",
      "Veins 2- or 3-forked with (3 or )4-6 veinlets in each group; rhizome with hairs only; fronds dichotomously divided with a pair of lateral pinnules at most dichotomies; sporangia 5-18 per sorus.",
      "Veins 1-forked with 2 veinlets in each group; rhizome with scales; fronds without lateral pinnules at dichotomies; sporangia 2-5(or 6) per sorus",
      "Rachis undivided, producing successive pairs of 2- or 3-pinnatifid pinnae; penultimate axes of frond without lamina; spores tetrahedral.",
      "Rachis pseudodichotomous; penultimate (and often lower) axes with well-developed lamina; spores ellipsoid."
    ],
    "authors":"Jin Xiaofeng, Bingyang Ding & Kunio Iwatsuki"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Hymenophyllaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10433",
    "knowledge_content":[
      "Plants epiphytic, petrophilous, or terrestrial, small to medium-sized. Rhizome sometimes short and erect, but usually slender and long creeping, often covered with hairs when young, simple or sometimes irregularly branching. Lamina simple to pinnately decompound, or flabellate, digitate, dichotomous, or even irregularly divided. Segments with a single veinlet, cells in one layer, or rarely with 2-4 cell layers without intercellular spaces and stomata. Sori terminal on veins, solitary, at apex of ultimate segments, or marginal on simple to pinnatifid fronds; involucres cup-shaped to deeply 2-cleft nearly to base; receptacles terminating a vein, short, capitate or clavate, or long and projecting; sporangia shortly stalked to (sub)sessile, maturing basipetally; annulus oblique, not interrupted; dehiscence irregular; spores globose-trilete, tetrahedral, containing chloroplasts, usually short-lived. x = 8, 11, 12, 13, 17, 21, 22, 26, 28, 36, 54 (base numbers x = 8, 54 are doubtful).\r",
      "Nine genera and ca. 600 species: tropical, subtropical, and temperate regions of both the Old and New Worlds; seven genera and 50 species (six endemic) in China.",
      "Traditionally, only two genera-Hymenophyllum with bivalved involucres and Trichomanes Linnaeus with tubular involucres-have been recognized in this family. This scheme was expanded by Morton (Contr. U.S. Natl. Herb. 29: 139-202. 1968) who hierarchically placed many subgenera, sections, and subsections under two larger genera, Hymenophyllum and Trichomanes, and recognized four monotypic genera, Cardiomanes Morton, Serpyllopsis Morton, Hymenoglossum Morton, and Rosenstockia Morton, all of which have specialized fronds. Conversely, Copeland (Gen. Fil. 31-44. 1947) split the family into 34 genera, basing his work on herbarium specimens as well as his field observations of Asian material. Taking into account these past studies plus recent investigations including molecular data, Ebihara et al. (Blumea 51: 221-280. 2006) proposed a modern scheme of classification on which the system of this treatise is based.Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Hymenophyllaceae. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 132-196, 350-357, 379.",
      "Abrodictyum  C. PreslCallistopteris  CopelandCephalomanes  C. PreslCrepidomanes  C. PreslDidymoglossum  DesvauxHymenophyllum  J. SmithVandenboschia  Copeland"
    ],
    "authors":"Liu Jiaxi, Zhang Qiaoyan, Atsushi Ebihara & Kunio Iwatsuki"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Hypodematiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10440",
    "knowledge_content":[
      "Plants rupestral or rarely terrestrial, medium-sized. Rhizomes shortly creeping, ascending, or long creeping, stout, densely covered with scales and hairs or only scales; scales ovate-lanceolate or rarely linear-lanceolate. Fronds approximate, subclustered, or remote; stipe stramineous, base swollen into shuttle form and concealed in scales (Hypodematium), or articulate to rhizome, glabrous (Leucostegia); lamina deltoid or ovate-oblong to pentagonal-ovate, 3-pinnate to finely 4-pinnate-pinnatifid, anadromous, herbaceous or papery, both surfaces, rachises, and costules frequently covered with acicular and\/or glandular hairs, rarely glabrous. Veins free, pinnate, branches simple or forked. Sori orbicular; indusia large, reniform, ± covered with acicular or glandular hairs, rarely glabrous. Spores ellipsoid, monolete. x = 41.\r",
      "Three genera and ca. 20 species: Old World, mainly in tropical, subtropical, and warm-temperate regions of Asia and Africa; two genera and 13 species (eight endemic) in China.",
      "Leucostegia has long been assigned to Davalliaceae because of its creeping, dorsiventral rhizome densely covered by scales, its dissected leaves, and its indusia. Molecular phylogenetic analysis has shown that Leucostegia is closely related to Hypodematium.Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Leucostegia. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 296-297; Shing Kunghsia, Chiu Peishi & Yao Guanhu. 1999. Hypodematiaceae. In: Shing Kunghsia, ed., Fl. Reipubl. Popularis Sin. 4(1): 1-14; Wu Shiewhung. 1999. Leucostegia. In: Wu Shiewhung, ed., Fl. Reipubl. Popularis Sin. 6(1): 177-179.",
      "Rhizomes shortly creeping or ascending; stipe base swollen into shuttle form and concealed in scales."
    ],
    "authors":"Zhang Gangmin, Prof. Fuwu Xing, Wang Faguo, Kunio Iwatsuki & Hans P. Nooteboom"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Isoetaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20790",
    "knowledge_content":[

    ],
    "authors":null
  },
  {
    "group_title":"Pteridophytes",
    "family":"Isoëtaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10454",
    "knowledge_content":[
      "Plants grasslike, heterosporous, perennial lycophytes growing as submerged aquatics or emergent and amphibious [or seasonal terrestrials]. Rhizome brown, cormlike, corky, (2 or)3(-5)-lobed, nearly globose [or horizontally spindle-shaped and proliferous]. Roots arising along central groove separating each rootstock lobe, dichotomously branched [or unbranched], containing eccentric vascular strand and surrounding lacuna. Microphylls tufted, several to many, erect to spreading, straight to recurved, (1-)5-50(-100) cm, spirally [or distichously] arranged, simple, linear with membranous margins toward base, dilated and spatulate basally, tapering to apex, semiterete in cross section with adaxial surface flattened and abaxial surface rounded, containing 4 transversely septate longitudinal lacunae with septa apparent on adaxial microphyll surface, 1 central collateral vascular strand, and frequently several peripheral fibrous bundles at microphyll angles. Ligules deltoid to cordate, 1-2(-6) mm, membranous, inserted above sporangium; sclerified scales and phyllopodia occasionally surrounding microphylls. Megasporophylls and microsporophylls usually borne in alternating cycles. Megasporangia often at adaxial side of external microphyll bases. Microsporangia at adaxial side of internal microphyll bases. Sporangia solitary, adaxial, embedded in basal cavity of sporophyll, ellipsoid to subglobose, 2-7(-15) mm, walls unpigmented [or brown streaked to completely brown], traversed internally by septae; velum membranous, rudimentary [or partly to completely covering adaxial surface of sporangium wall]; megasporangium containing several to hundreds of megaspores; microsporangium containing thousands of microspores. Megaspores white when dry, gray when wet [or black], globose, 300-500(-900) μm in diam., trilete with an equatorial ridge dividing proximal and distal hemispheres and 3 radial ridges converging at pole of proximal hemisphere, surfaces smooth or textured with spines, tubercles, or ridges. Microspores gray or brown en masse, ellipsoid, 15-30(-50) μm, monolete, surfaces smooth or textured with spines, granules, or tubercles. Megagametophyte achlorophyllous, endosporic, exposed when megaspore wall opens along proximal ridges; archegonia apparent as quartets of brown neck cells. Microgametophyte 9-celled, endosporic, antheridium releasing 4 multiflagellate spermatozoids. x = [10], 11.\r",
      "One genus and more than 250 species: nearly worldwide on islands and all continents except Antarctica; five species (all endemic) in China."
    ],
    "authors":"Li-Bing Zhang & W. Carl Taylor"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Lindsaeaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10511",
    "knowledge_content":[
      "Plants terrestrial, rarely climbing or epiphytic. Rhizomes creeping, sometimes scandent, protostelic or solenostelic, covered with narrow scales and\/or hairs; scales basifixed, glabrous, 2-6(-12) cells wide at base, cells thick-walled, scale margin entire, apex bristlelike, ca. 1 cell wide. Fronds approximate or distant, vernation circinate; stipe not articulate to rhizome, with a single vascular bundle; lamina 1-4-pinnate, rarely simple, imparipinnate or not, herbaceous, papery, or thinly leathery, glabrous or with scattered very minute (microscopic) 2-celled hairs; pinnae or pinnules symmetrical or dimidiate, anadromous, rarely catadromous; veins free or anastomosing without included veinlets. Sori marginal or submarginal, terminal on a single veinlet or on 2 to several uniting veinlets, linear or oblong, indusiate; indusia basally adnate, laterally free or adnate, opening toward margin. Spores 32 per sporangium, tetrahedral-globose, globose, or ellipsoid, trilete or monolete.\r",
      "Six to nine genera and ca. 200 species: pantropical; four genera and 18 species (one endemic) in China.",
      "Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Lindsaeaceae (excluding Taenitis). In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 256-279, 371-374.",
      "Sori terminal on a single vein or no more than 3 veins; indusia cup-shaped, basally and partially or entirely adnate laterally",
      "Sori terminal on 3 or more veins, rarely on a single vein; indusia linear or oblong, basally adnate, laterally free",
      "Lindsaea  Dryander ex SmithOdontosoria  FéeOsmolindsaea  (K. U. Kramer) Lehtonen & ChristenhuszTapeinidium  (C. Presl) C. Christensen"
    ],
    "authors":"Shiyong Dong, Sujuan Lin, Maarten J. M. Christenhusz & Julie Barcelona"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Lomariopsidaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10516",
    "knowledge_content":[
      "Plants large, terrestrial, climbing, or epiphytic. Rhizomes stout, ascending or long scandent, dorsiventral, with roots on ventral side and several rows of fronds on dorsal side, bearing numerous scales on rhizome apex. Fronds distant, monomorphic or dimorphic, imparipinnate; stipes densely scaly at base; scales black, lanceolate or linear; lateral pinnae articulate to rachis; sterile pinnae linear-lanceolate, margin entire or serrate; veins free or anastomosing in several rows of areoles, without included free veinlets. Fertile fronds with narrow, linear pinnae. Sori dorsal on veinlets, in 1-4 rows on each side of costa, or acrostichoid, completely covering abaxial surface of pinnae, exindusiate; annulus consisting of 14-22 thick-walled cells. Spores elliptic or orbicular.\r",
      "Three genera and ca. 40 species: pantropical, mainly in Asia, Africa, and Oceania; two genera and four species (one endemic) in China.",
      "Wang Chuhao. 1999. Lomariopsidaceae (excluding Lomagramma). In: Wu Shiewhung, ed., Fl. Reipubl. Popularis Sin. 6(1): 125-129; Hsieh Yingtang. 2001. Cyclopeltis. In: Kung Hsianshiu, ed., Fl. Reipubl. Popularis Sin. 5(2): 182-184."
    ],
    "authors":"Prof. Fuwu Xing, Wang Faguo, Zhang Xianchun, Masahiro Kato & David S. Barrington"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Lycopodiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10527",
    "knowledge_content":[
      "Plants terrestrial, helophytic, or epiphytic, small to large. Main stems creeping, pendulous, climbing, or short and erect, mainly protostelic, rarely actinostelic or plectostelic, on substrate surface or subterranean, or forming stolons. Upright shoots once to multiple times dichotomously branched, conspicuously leafy; upper portion of stem and branchlets with or without bulbils. Lateral branches ascending or erect, dichotomously branched or nearly sympodially branched, rarely pseudomonopodially branched. Main stems and lateral branches rounded or flat in cross section. Leaves as microphylls, with 1 unbranched midrib, monomorphic, spirally arranged. Leaves on subterranean parts flat, appressed, not photosynthetic, and scalelike; leaves on aerial parts appressed, ascending or spreading, subulate, linear, lanceolate, ovate, or scalelike, not lustrous or lustrous, remote to dense and imbricate, papery, leathery, or thinly leathery, base truncate, margin entire or serrate. Strobili terminal on branchlets or main stem, abruptly becoming much smaller than or similar to sterile branches or branchlets in size, solitary, erect, nodding, or pendent, terete, sessile or stalked. Sporophylls homomorphic with or different from trophophylls, monomorphic or dimorphic, papery, margin toothed, membranous. Sporangia in axils of sporophylls, yellow, reniform, thick-walled, outer walls variously modified. Spores trilete, thick-walled, surfaces pitted to small-grooved, rugulose, or reticulate. Gametophytes subterranean or surficial. x = 11, 13, 17, 23.\r",
      "Five genera and 360-400 species: cosmopolitan, with centers of diversity in the tropics; five genera and 66 species (28 endemic) in China.",
      "Some pteridologists recognize a narrowly defined Lycopodiaceae s.s. and Huperziaceae with the latter comprising Huperzia, Phlegmariurus, and Phylloglossum Kunze, considering that the split between Huperziaceae and Lycopodiaceae s.s. has been dated to ca. 350 million years ago using plastid rbcL data (Wikström & Kenrick, Molec. Phylogen. Evol. 19: 177-186. 2001), an age much older than many extant fern families\/orders. In spite of this, here Lycopodiaceae s.l. including Huperziaceae is recognized because of the sister relationship between Huperziaceae and Lycopodiaceae s.s.In the Lycopodiaceae, sometimes Lycopodiastrum is subsumed under Lycopodium. However, the split between Lycopodiastrum and Lycopodium s.s. has been dated to the Permian Period (251-299 million years ago), much earlier than when extant species of Lycopodium s.s. started to diversify (Wikström & Kenrick, loc. cit.). Also, the morphology of Lycopodiastrum is distinct from Lycopodium. Therefore, Lycopodiastrum is recognized here.Zhang Libing. 2004. Huperziaceae and Lycopodiaceae. In: Zhang Xianchun, ed., Fl. Reipubl. Popularis Sin. 6(3): 1-85.",
      "Horizontal stems absent, shoots clustered; roots usually in single basal clump; sporophylls very similar to vegetative trophophylls or smaller and paleate, usually not in obvious strobilus; spores pitted to small-grooved",
      "Horizontal stems present, upright shoot systems alternating along rhizome; roots emerging at intervals along horizontal stem; sporophylls very different from vegetative trophophylls, aggregated into upright or nodding or pendent strobili; spores reticulate or rugulate",
      "Plants normally shorter than 25(-32) cm, terrestrial or on rocks; stem erect or ascending; strobili homomorphic with sterile branches or branchlets; sporophylls homomorphic with trophophylls; leaves papery, serrate or entire on margin; upper portion of stem and branchlets often with bulbils; spore sides at equator concave with truncate angles.",
      "Plants up to 100 cm tall, epiphytic; stem pendulous or ascending; strobili abruptly becoming much smaller than sterile branches or branchlets or rarely similar in size; sporophylls obviously different from or rarely almost homomorphic with trophophylls; leaves leathery or thinly leathery, entire on margin; upper portion of stem and branchlets often without bulbils; spore sides at equator convex with acute or blunt angles.",
      "Aerial shoots climbing; strobili 6-26 per peduncle and terminal on multi-dichotomously branched peduncles.",
      "Plants terrestrial; aerial shoots erect or creeping; strobili solitary or aggregated at apex of fertile branches.",
      "Huperzia  BernhardiHuperzia sect. Huperzia  Huperzia sect. Serratae  (Rothmaler) HolubLycopodiastrum  Holub ex R. D. DixitLycopodiella  HolubLycopodium  LinnaeusPhlegmariurus  (Herter) HolubPhlegmariurus sect. Carinaturus  (Herter) H. S. Kung & Li Bing ZhangPhlegmariurus sect. Huperzioides  H. S. Kung & Li Bing ZhangPhlegmariurus sect. Phlegmariurus  "
    ],
    "authors":"Li-Bing Zhang & Kunio Iwatsuki"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Lygodiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10528",
    "knowledge_content":[
      "Plants terrestrial. Stems branched, slender; fronds often more than several meters, alternately pinnate, climbing by means of a twining rachis; primary blade divisions (pinnae) pseudodichotomously forking with a dormant apical bud in axils; pinnules entire to palmately or 1- or 2-pinnate or more divided; fertile and sterile pinnae similar or fertile pinnae greatly contracted; veins free or anastomosing; sori on lobes of ultimate segments; sporangia abaxial, solitary, 1 per sorus, each sporangium covered by an antrorse indusium-like subtending flange; spores 128-256 per sporangium, tetrahedral and trilete; gametophytes green, cordate, terrestrial. x = 29, 30.\r",
      "One genus and ca. 26 species: pantropical, extending northward to S Korea, Japan, and North America and southward to S Africa and New Zealand; nine species in China.",
      "Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Lygodiaceae. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 105-114, 345-346."
    ],
    "authors":"Zhang Xianchun & Judith Garrison Hanks"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Marattiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10536",
    "knowledge_content":[
      "Plants terrestrial (rarely epiphytic, sometimes in streams), evergreen. Rhizomes erect, ascending, or creeping, amylaceous (starchy), polycyclostelic to dictyostelic. Fronds monomorphic and long-lived or dimorphic and fertile ones short-lived (Danaea), simple or compound, 1-4-pinnate or (pedate-)palmate (Christensenia), small (ca. 20 cm) to very large (up to at least 6 m). Stipes fleshy, with a pair of stipulelike appendages at base, often with conspicuous lenticels. Pulvini at base of fronds, at nodes, at bases of pinnae, and in some species at \"naked\" nodes (without pinnae) along stipe. Veins free, simple or bifurcate, or reticulate (Christensenia), false veins present between true veins or absent. Tissues mucilaginous. Indument of multicellular uniseriate hairs and basifixed or peltate scales. Sori lacking true indusia, usually with paraphyses, superficial, sunken or stalked, elongate along veins, bilateral or radial. Sporangia partially or completely fused into synangia, dehiscing by a slit or pore. Spores trilete or monolete, with bullate, muriform, or stellate ornamentation. Prothalli very large, thalloid, photosynthetic.\r",
      "Six genera and ca. 100 species: pantropical, Danaea Smith, Eupodium J. Smith, and Marattia Swartz in the Neotropics, Angiopteris, Christensenia, and Ptisana in the Paleotropics; three genera and 30 species (17 endemic) in China.",
      "The delimitation of certain species of Angiopteris is unclear.The following papers are relevant: Christenhusz (Ann. Univ. Turku., A II, 216: 1-134. 2007); Christenhusz and Toivonen (Biol. Invas. 10: 1215-1228. 2008); Murdock (Amer. J. Bot. 95: 626-641. 2008); and Murdock (Taxon 57: 737-755. 2008).Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Angiopteridaceae and Christenseniaceae. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 27-66, 330-345; Zhang Xianchun. 2004. Marattiaceae. In: Zhang Xianchun, ed., Fl. Reipubl. Popularis Sin. 6(3): 246-248.",
      "Fronds pinnate (sometimes simple when plants juvenile); venation free, simple or bifurcate; synangium ovate"
    ],
    "authors":"He Zhaorong & Maarten J. M. Christenhusz"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Marsileaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10539",
    "knowledge_content":[
      "Plants small, herbaceous, in shallow water or on shores of lakes and ponds. Rhizomes slender and creeping with a siphonostele, covered with short side-attached hairs or glabrous. Fronds linear or with 2-4 obtriangular or fan-shaped pinnae attached at top of stipe, these floating on water surface or emergent. Spores formed inside bean-shaped sporocarps attached to stipe by a short peduncle. Sporocarps containing 2-30 sori, each sorus including both megasporangia and microsporangia. Megasporangium with 1 large spore; microsporangium with 16-64 small spores.\r",
      "Three genera and ca. 60 species: Africa and Australia are the centers of diversity; one genus and three species in China."
    ],
    "authors":"Youxing Lin & David M. Johnson"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Nephrolepidaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10611",
    "knowledge_content":[
      "Plants medium-sized, terrestrial or creeping on rocks or small trees. Rhizome with peltate scales, dorsiventral, long creeping, or short and erect, sometimes bearing stolons or tubers, dictyostelic. Fronds distant or tufted, shortly to long stipitate; lamina lanceolate to elliptic-lanceolate, pinnate; pinnae glabrous or sometimes finely hairy; veins forked, free, ending in submarginal hydathodes. Sori orbicular, terminal on a veinlet, dorsal; indusium orbicular-reniform, often with a narrow sinus, or lunulate, broadly attached. Spores monolete.\r",
      "One genus and ca. 20 species: most tropical regions of the world; five species (one introduced) in China.",
      "Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Nephrolepis. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 313-318, 378; Wu Shiewhung. 1999. Nephrolepidaceae (excluding Arthropteris). In: Wu Shiewhung, ed., Fl. Reipubl. Popularis Sin. 6(1): 143-150."
    ],
    "authors":"Prof. Fuwu Xing, Wang Faguo & Peter H. Hovenkamp"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Oleandraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10626",
    "knowledge_content":[
      "Plants terrestrial, epilithic, or epiphytic. Rhizome long, creeping, erect, or scandent; scales blackish brown, thick, spreading or appressed, imbricate, peltate at base, margin often long ciliate. Fronds distant or clustered; stipe articulate to raised phyllopodia; lamina simple, entire, lanceolate to linear-lanceolate, herbaceous, papery, or leathery, margin cartilaginous, glabrous or pubescent; costa prominent, raised adaxially, often with small scales on abaxial surface; veins simple or forked, free. Sori in a single often irregular row on either side of costa; indusia persistent, red-brown, reniform or orbicular-reniform, membranous or papery. Spores monolete, with broad, winglike, echinulate folds, cristate or echinate to erose.\r",
      "One genus and 15-20 species: pantropical, mainly from tropical Asia and the Pacific islands, a few in Africa and South America; five species in China.",
      "See the revision by Hovenkamp and B. C. Ho (PhytoKeys 11: 1-37. 2012).Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Oleandraceae. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 319-325, 378-379; Wu Shiewhung. 1999. Oleandraceae. In: Wu Shiewhung, ed., Fl. Reipubl. Popularis Sin. 6(1): 154-160."
    ],
    "authors":"Zhang Xianchun & Peter H. Hovenkamp"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Onocleaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10632",
    "knowledge_content":[
      "Plants terrestrial. Rhizome robust and short, erect or creeping, dictyostelic, covered with ovate-lanceolate to lanceolate scales. Fronds tufted or distant, dimorphic. Sterile lamina pinnatifid to bipinnatifid, green, deltoid-ovate, elliptic-lanceolate, or oblanceolate, papery or thinly papery; pinnae alternate, sessile or adnate, linear-lanceolate to narrowly elliptic, undulate or pinnatifid; pinnules hemielliptic-oblong, entire or subserrate with few teeth; veins free, pinnate or anastomosing, without included veinlets. Fertile lamina pinnate or bipinnate, elliptic to linear; pinnae or pinnules much inrolled, dull purple to dark brown, cylindric or globose; veins free, pinnate or furcate. Sori orbicular, indusiate or exindusiate; sporangia long stalked, annulus a longitudinal row consisting of 36-40 thick-walled cells; spores monolete, with perispore transparent, membranous, with a few folds.\r",
      "Four genera and five species: temperate zone of the N Hemisphere and Mexico; three genera and four species in China.",
      "The following taxon is excluded from the present treatment, pending further research: Struthiopteris cavaleriana Christ (Bull. Acad. Int. Géogr. Bot. 13: 118. 1904; Matteuccia cavaleriana (Christ) C. Christensen), type from China (\"entre Pin-fa et Tou-Yunn\").Wu Shiew-hung. 1999. Onocleaceae. In: Wu Shiew-hung, ed., Fl. Reipubl. Popularis Sin. 4(2): 157-165.",
      "Stipe and rachis deeply grooved adaxially, sterile lamina elliptic-oblanceolate to oblanceolate, with markedly narrowed base; sori indusiate.",
      "Stipe and rachis not grooved adaxially, sterile lamina ovate-deltoid or elliptic, with slightly narrowed base; sori indusiate or exindusiate."
    ],
    "authors":"Prof. Fuwu Xing, Wang Faguo & Masahiro Kato"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Ophioglossaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10634",
    "knowledge_content":[
      "Plants perennial, mostly terrestrial, rarely epiphytic, usually small and fleshy, lacking sclerenchyma. Roots lacking root hairs, unbranched or with a few narrow lateral branches [rarely dichotomously branched], fibrous or fleshy, sometimes producing vegetative buds. Rhizome mostly erect, less often horizontal, rarely branched, eustelic, glabrous or hairy. Fronds 1 to few per plant, monomorphic, vernation nodding (not circinate), erect or folded, stipe base dilated, clasping, forming open or fused sheath surrounding successive leaf buds; buds glabrous or with long, uniseriate hairs; common stipe usually dividing into sterile, laminate, photosynthetic portion (trophophore) and fertile, spore-bearing portion (sporophore); sterile lamina ternately or pinnately compound to simple, rarely absent, glabrous or with scattered, long, uniseriate hairs, especially on stipe and rachis; veins anastomosing or free, pinnate, or palmate. Sporophores 1 per frond [rarely more], spikelike or pinnately branched; sporangia exposed or embedded, sometimes clustered on very short lateral branches, wall 2 cells thick, annulus absent; spores many (> 1000) per sporangium, globose-tetrahedral, trilete, thick-walled, surface rugate, tuberculate, baculate (with projecting rods usually higher than wide), sometimes joined in delicate network, mostly with ± warty surface. Gametophytes subterranean, usually fleshy, mycorrhizal, non-photosynthetic, orbicular or linear. x = 30, (44), 45, (46), 94.\r",
      "Four(-nine) genera and ca. 80 species: nearly worldwide; three genera and 22 species (two endemic) in China.",
      "Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Ophioglossaceae, Botrychiaceae, and Helminthostachyaceae. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 6-26, 329-330.",
      "Fertile lamina simple, rarely forked; sporangia sunken in 2 rows on sides of a single linear spike; sterile lamina mostly simple, rarely absent or forked at apex, veins reticulate.",
      "Fertile lamina regularly pinnately or radially branched; sporangia exposed on branchlet tips, not sunken; sterile lamina mostly pinnately or ternately lobed or divided, veins free",
      "Fertile lamina mostly in one plane, branches pinnate; rhizome erect; sporangia solitary and lacking associated sterile projections; sterile lamina mostly pinnately lobed.",
      "Fertile lamina cylindrical, spikelike, branches very short, radially arranged; rhizome horizontal; sporangia ?clustered in clumps of several, with sterile projections; sterile lamina ternate."
    ],
    "authors":"Zhang Xianchun, Quanru Liu & Norio Sahashi"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Osmundaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10642",
    "knowledge_content":[
      "Plants terrestrial, with mostly unbranched, often massive, erect, or shortly creeping, ascending, sometimes treelike trunk clothed in roots and persistent stipes, hairy at apex. Rhizome anatomy distinctive, an ectophloic siphonostele (with a pith of parenchyma in center and phloem outside of vascular cylinder only), with a ring of discrete xylem strands, these often conduplicate or twice conduplicate in cross section. Fronds 1- or 2-pinnate, catadromous, when young bearing wool-like, uniseriate hairs, these deciduous or persistent at axes, dimorphic or with fertile portions dissimilar to sterile; stipe caespitose, spirally arranged, with laterally winged stipules at bases, bearing mucilaginous hairs when young, with a single U-shaped vascular bundle; sclerenchyma strongly developed; base of lateral pinnae nearly always distinctly articulate (but only functional in some species); pinnule base sometimes also articulate, though less distinctly so; veins free, subpinnately furcate. Sporangia not assembled in sori, following veins or entirely covering strongly contracted fertile segments, sporangia large, with 128-512 spores, opening by an apical slit, annulus lateral; spores green, subglobose, trilete; gametophytes large, green, cordate, surficial. x = 22.\r",
      "Four genera and ca. 20 species: temperate and tropical regions worldwide; two genera and eight species (one endemic) in China.",
      "Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Osmundaceae. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 77-85.",
      "Fronds 1- or 2-pinnate, or pinnate-pinnatisect, hemidimorphic; fertile pinnae at apical, middle, or lower part of fertile fronds."
    ],
    "authors":"Zhang Xianchun, Kunio Iwatsuki & Yoko Kadokawa"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Plagiogyriaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10698",
    "knowledge_content":[
      "Plants terrestrial, small to medium-sized, 10-150(-200) cm tall, without scales. Rhizomes dictyostelic, erect, suberect, or shortly decumbent, stout, thickened; stipe bases persistent. Roots blackish, wiry, regularly arranged on stem, one beside each stipe base, sparsely branched. Fronds dimorphic, bearing minute, uniseriate, multicellular, gland-tipped, mucilage-secreting trichomes. Stipes orbicular, ovate, triangular, or tetragonal in cross section, bases swollen; vascular bundle 1 per stipe, expanded or divided into 3 meristeles in enlarged base; rachises winged or not, abaxially semiterete, flat, or carinate, adaxially sulcate. Aerophores variously present on stipes and rachises, cushionlike or elongate and hornlike with blunt apex. Sterile fronds herbaceous, firmly so, or subleathery; lamina 1-pinnate, pinnatifid, or pinnatilobed, apices coadunate, pinnalike, pinnatilobed, or confluent; pinnae sessile, shortly stalked, or adnate to rachises, falcate to linear-lanceolate, widest near base or below middle, glabrous or abaxially sparsely glandular pubescent, margin entire to serrulate, apex minutely serrulate to dentate; veins simple or paired at base, mostly 1- or 2-forked, reaching pinna margins, distinct on both surfaces. Fertile fronds erect at middle of plant, with proportionally longer stipes and shorter lamina; lamina pinnate or deeply pinnatifid; pinnae sessile, shortly stalked, or adnate to rachises; apical pinna usually pinnatifid or pinnalike, margin entire, subentire, or erose-toothed, glabrous or with few short glandular hairs, scarious; tissue above veinlets hygroscopic and reversible, functioning as indusium (false indusium), scarious margins covering sori in juvenile stage, recurved at maturity; veins free, 1- or 2-forked, solitary or paired at base. Sori borne on swollen vein tips, extending slightly, confluent, acrostichoid, almost wholly covering abaxial surface of pinnae when ripe. Paraphyses numerous, mixed with sporangia, uniseriate, orange to dark brown, multicellular, glandlike, slightly longer than sporangia, apically subcapitate. Sporangia with a complete oblique annulus, not interrupted by stalk, laterally dehiscent. Spores 64 per sporangium, tetrahedral; aperture trilete; arms of aperture ca. 3\/4 radius; surface ornamentation irregular, coarse, tuberculate with coalescent papillae and rodlets. x = 65 (sexual).\r",
      "One genus and ca. ten species: mainly in E and SE Asia, one species in tropical America; eight species (one endemic) in China.",
      "Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Plagiogyriaceae. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 85-105."
    ],
    "authors":"Zhang Xianchun & Hans P. Nooteboom"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Polypodiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10718",
    "knowledge_content":[
      "Authors: Zhang Xianchun, Shugang Lu, Youxing Lin, Qi Xinping, Shannjye Moore, Prof. Fuwu Xing, Wang Faguo, Peter H. Hovenkamp, Michael G. Gilbert, Hans P. Nooteboom, Barbara S. Parris, Christopher Haufler, Masahiro Kato & Alan R. Smith",
      "Plants mostly epiphytic and epilithic, a few terrestrial. Rhizomes shortly to long creeping, dictyostelic, bearing scales. Fronds monomorphic or dimorphic, mostly simple to pinnatifid or 1-pinnate (uncommonly more divided); stipes cleanly abscising near their bases or not (most grammitids), leaving short phyllopodia; veins often anastomosing or reticulate, sometimes with included veinlets, or veins free (most grammitids); indument various, of scales, hairs, or glands. Sori abaxial (rarely marginal), orbicular to oblong or elliptic, occasionally elongate, or sporangia acrostichoid, sometimes deeply embedded, sori exindusiate, sometimes covered by caducous scales (soral paraphyses) when young; sporangia with 1-3-rowed, usually long stalks, frequently with paraphyses on sporangia or on receptacle; spores hyaline to yellowish, reniform, and monolete (non-grammitids), or greenish and globose-tetrahedral, trilete (most grammitids); perine various, usually thin, not strongly winged or cristate. Mostly x = 35, 36, 37.\r",
      "More than 50 genera and ca. 1,200 species: pantropical, a few temperate; 39 genera and 267 species (82 endemic) in China.",
      "The Polypodiaceae s.s., as often recognized, are paraphyletic because they exclude the grammitids. Generic boundaries need clarification. Polypodiaceae contain large, wholly neotropical and wholly paleotropical clades.Molecular data show that several families recognized in FRPS, i.e., Drynariaceae, Grammitidaceae, Gymnogrammitidaceae, Loxogrammaceae, Platyceriaceae, and Pleurosoriopsidaceae, all nest within the Polypodiaceae. Five lineages are defined that can be treated as subfamilies (see Christenhusz et al., Phytotaxa 19: 18-19. 2011) as follows: Loxogrammoideae (Loxogrammaceae): genus no. 1; Drynarioideae (Crypsinoideae, Drynariaceae, Gymnogrammitidaceae): genera nos. 2-8; Platycerioideae (Platyceriaceae, Pyrrosioideae): genera nos. 9-10; Microsoroideae (incl. Crypsinoideae, Lepisorioideae): genera nos. 11-25; Polypodioideae (incl. Grammitidaceae, Pleurosoriopsidaceae): genera nos. 26-39. The status of several genera in the Microsoroideae is controversial (Kreier et al., Molec. Phylogen. Evol. 48: 1155-1167. 2008). Microsorum is still polyphyletic, and some new genera are to be established.Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Gymnogrammitis. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 284-285; Wu Shiew-hung. 1999. Pleurosoriopsidaceae. In: Wu Shiew-hung, ed., Fl. Reipubl. Popularis Sin. 4(2): 154-156; Lin Youxing, Lu Shugang & Shi Lei. 2000. Polypodiaceae. In: Lin Youxing, ed., Fl. Reipubl. Popularis Sin. 6(2): 7-266, 346-349; Zhang Xianchun. 2000. Drynariacae, Platyceriaceae, Grammitidaceae, and Loxogrammaceae. In: Lin Youxing, ed., Fl. Reipubl. Popularis Sin. 6(2): 267-335.",
      "Fronds monomorphic or weakly dimorphic, fronds not with base adpressed to substrate, fertile fronds similar in form to sterile fronds differing only in relative width, usually simple, rarely hastate or pedately divided.",
      "Fronds strongly dimorphic, basal fronds with basal part tightly adpressed to substrate, foliage\/fertile fronds dichotomously lobed.",
      "Fronds usually strongly dimorphic with specialized short brown sessile humus-collecting fronds and longer pinnatisect fertile fronds.",
      "Fronds monomorphic, fronds with broad humus-collecting base and distal deeply pinnatisect fertile portion.",
      "Fronds pinnatisect, stipe winged to base; segments uniformly 10-15(-20) mm wide; sporangia in discrete, orbicular sori (Drynaria parishii).",
      "Fronds pinnate, stipe and rachis terete; segments dimorphic, sterile segments 3.5-10 cm wide, fertile segments distal, 0.4-0.7 cm wide; sporangia acrostichoid, covering most of pinnule surface.",
      "Stipe and\/or lamina margins stiffly hirsute, lamina surface often with forked or glandular hairs; spores green",
      "Stipe and\/or lamina margins glabrous or scaly, less often pubescent; spores brown, yellow, or whitish (greenish at time of dispersal in Loxogramme)",
      "Sori orbicular to narrowly oblong, oblique to midrib, usually superficial or slightly sunken in lamina, rarely deeply sunken",
      "Pale yellowish brown simple glandular hairs and forked hairs with glandular branches,. 1-0.2 mm, on stipe and lamina, sometimes also on rhizomes scales; no other types of hairs present.",
      "Pale yellowish brown simple glandular hairs and forked hairs with glandular branches,. 1-0.2 mm, absent from stipe, lamina, and rhizome scales; other types of hairs present",
      "Sori submarginal or marginal, or on abaxial surface of lamina, usually deeply sunken in lamina, sometimes superficial or very slightly sunken on abaxial surface of lamina; rhizomes dorsiventral, stipe articulate to rhizome, phyllopodia present; rhizome scales subclathrate to clathrate, with marginal hairs.",
      "Sori on abaxial surface of lamina, superficial or very slightly sunken; rhizomes radial or dorsiventral, stipe sometimes articulate to rhizome, phyllopodia sometimes present; rhizome scales sometimes subclathrate to clathrate, sometimes with marginal hairs",
      "Rhizome relatively stout, (1-)1.5-5 mm in diam., densely scaly, with closely spaced fronds; fronds monomorphic, usually with dark, clathrate scales.",
      "Plants climbing; rhizome scales bearing a tuft of long, stiff, needlelike, reddish brown hairs abaxially near their center.",
      "Plants epiphytic, terrestrial, or climbing; rhizome scales glabrous, occasionally bearing a tuft of short, soft, brown hairs adaxially at point of attachment",
      "Sori arranged in 1 line on each side of costa, discrete or sometimes ?merging into longitudinal coenosori",
      "Rhizome relatively stout, (1-)1.5-5 mm in diam., densely scaly, with closely spaced fronds; fronds monomorphic, herbaceous or papery.",
      "Rhizome slender, up to 1.5 mm in diam., sparsely scaly, with widely spaced fronds; fronds often dimorphic (monomorphic in Lemmaphyllum rostratum), fleshy to thinly leathery."
    ],
    "authors":"Zhang Xianchun, Shugang Lu, Youxing Lin, Qi Xinping, Shannjye Moore, Prof. Fuwu Xing, Wang Faguo, Peter H. Hovenkamp, Michael G. Gilbert, Hans P. Nooteboom, Barbara S. Parris, Christopher Haufler, Masahiro Kato & Alan R. Smith"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Psilotaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10738",
    "knowledge_content":[
      "Plants small to medium-sized, epiphytic or on rocks. Rhizomes creeping, brown, with protostele or siphonostele, bearing rhizoids; roots absent. Stems erect or pendulous, green, unbranched or dichotomously or pinnately branched; branches ridged to sulcate or complanate. Leaves small or rudimentary, with a single vein (microphylls) or lacking veins (enations), spirally or distichously alternate, sessile or subsessile, dimorphic; trophophylls scalelike and subulate-triangular, or lanceolate to narrowly ovate; sporophylls deeply bifid. Sporangia appearing solitary at or above bases of sporophylls, large, 2- or 3-lobed (sometimes interpreted as synangia of 2 or 3 unlobed sporangia), thick-walled, lacking an annulus, each lobe dehiscing longitudinally by a slit. Spores reniform, monolete, many (> 1000) per sporangium, exospore translucent, rugulate to foveolate. Gametophytes subterranean (Psilotum), non-photosynthetic, cylindrical, mycorrhizal. x = 52.\r",
      "Two genera (Psilotum, Tmesipteris) and ca. 17 species: tropics to temperate regions; one species in China."
    ],
    "authors":"Li-Bing Zhang & George Yatskievych"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Pteridaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10740",
    "knowledge_content":[
      "Authors: Zhang Gangmin, Wenbo Liao, Ding Mingyan, Youxing Lin, Zhaohong Wu, Zhang Xianchun, Shiyong Dong, Jefferson Prado, Michael G. Gilbert, George Yatskievych, Tom A. Ranker, Elisabeth A. Hooper, Edward R. Alverson, Jordan S. Metzgar, Michele Funston, Shigeo Masuyama & Masahiro Kato",
      "Plants mostly terrestrial or epilithic, some epiphytic, rarely aquatic (Ceratopteris), small to large. Rhizomes erect, ascending, or creeping, siphonostelic, solenostelic, or dictyostelic, usually scaly, rarely with bristles; scales brown or black, sometimes clathrate and iridescent, lanceolate to cordate, sometimes peltate, margin usually entire. Fronds mostly monomorphic, less often dimorphic or subdimorphic, clustered to widely scattered, not articulate; stipe well defined, dark, often glossy, to ill defined and green, terete or adaxially grooved, glabrous, hairy, or scaly, with 1-4 vascular bundles (or to many in Ceratopteris) near base, combining distally; lamina entire or 1-4-pinnate to 5-pinnate-pinnatifid, less often digitate, pedate, or 1-3 dichotomous with pedate branches; ultimate pinnules often stalked, sometimes articulate, herbaceous, papery, or leathery, more rarely membranous or fleshy; veins free or anastomosing, if anastomosing then areoles without free included veinlets. Sori mostly confluent along veins or marginal commissures, sometimes immersed in grooves, less often discrete on vein tips or on recurved membranous marginal lobe (false indusium), sometimes acrostichoid or rarely forming a narrow longitudinal band between midrib and margin (Taenitis); true indusium absent, marginal sori often protected by false indusium formed from revolute lamina margin. Sporangia usually long stalked, annulus vertical or rarely oblique, interrupted by stalk. Spores mostly brown, yellowish, or colorless, mostly tetrahedral-globose and trilete, rarely ellipsoid and monolete, smooth or ornamented, sometimes with an equatorial flange. Mostly x = 29, 30.\r",
      "About 50 genera and 950 species: subcosmopolitan, but most numerous in tropics and arid regions; 20 genera and 233 species (89 endemic, one introduced) in five subfamilies in China.",
      "Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Taenitis. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 279-280; Lin Youxing. 1990. Adiantaceae and Parkeriaceae. In: Ching Renchang & Shing Kunghsia, eds., Fl. Reipubl. Popularis Sin. 3(1): 173-216, 274-278; Shing Kunghsia. 1990. Acrostichaceae and Hemionitidaceae. In: Ching Renchang & Shing Kunghsia, eds., Fl. Reipubl. Popularis Sin. 3(1): 92-94, 216-274, 279; Shing Kunghsia & Wu Sukung. 1990. Sinopteridaceae (excluding Cheilosoria and Notholaena). In: Ching Renchang & Shing Kunghsia, eds., Fl. Reipubl. Popularis Sin. 3(1): 97-173; Wu Shiewhung. 1990. Pteridaceae (excluding Histiopteris). In: Ching Renchang & Shing Kunghsia, eds., Fl. Reipubl. Popularis Sin. 3(1): 10-89; Zhang Xian-chun. 1999. Antrophyaceae and Vittariaceae. In: Chu Wei-ming, ed., Fl. Reipubl. Popularis Sin. 3(2): 1-31.",
      "Plants epiphytic or epilithic; base of lamina tapered, merging gradually into poorly differentiated stipe",
      "Fronds obovate to oblanceolate, widest above middle, rarely linear, costa absent or only at lower part; sori multiseriate along veins, in grooves along veins on abaxial surface of lamina, rarely one row on each side; spores monolete.",
      "Fronds filiform to linear or ribbonlike, rarely lanceolate, costa distinct up to apex or upper part; sori biseriate or uniseriate, in marginal or submarginal grooves, rarely superficial, or along costa; spores trilete or monolete",
      "Veins free or rarely anastomosing near costa, then free; sori borne along veins; inland forests at up to 2800(-3600) m.",
      "Veins anastomosing; sporangia scattered on whole of abaxial lamina surface; coastal areas below 100 m, often in mangrove swamps.",
      "Rhizome covered with bristles; sori linear and forming a narrow longitudinal band between midrib and margin.",
      "Pinnules obviously stalked, often articulate (rarely frond reduced to single orbicular to reniform pinnule); stipe and rachis slender, glossy black or reddish brown",
      "Pinnules sessile or obscurely stalked, never articulate, often pinnatifid; stipe and rachis often not dark and glossy",
      "Sporangia protected by reflexed marginal lobes; veins pinnate, often obscure; pinnules mostly hastate to ovate-hastate.",
      "Sporangia borne on reflexed marginal lobes; veins simple or dichotomously forked, often radiate, pinnule without costule; pinnules ovate, flabellate, orbicular-flabellate, or dimidiate.",
      "Lamina lanceolate, oblong-lanceolate, or oblong-triangular to deltoid-lanceolate or deltoid-ovate in outline",
      "Sori borne at vein tips, rounded, separate (confluent when mature); rhizome scales brown or dark brown, concolorous or with narrow lighter brownish margins.",
      "Sori borne along marginal commissural vein, linear; rhizome scales bicolored, with black and thick central band, broad brownish and membranous margins",
      "Fertile fronds 4-7 cm; rhizome usually short, often erect, with clustered fronds (rhizome long creeping, with widely spaced fronds in Cryptogramma stelleri).",
      "Sporangia continuous along most of length of pinnae along commissural vein; pinnae entire or pectinately divided into segments, sometimes asymmetrical.",
      "Sporangia in discrete sori at veins tips at least when young, sometimes later confluent; pinnae pinnatifid, variously shaped but symmetrical and not pectinate",
      "Lamina margins not or only slightly reflexed, indusia absent; lamina with dense, yellow to brownish, long hairs abaxially.",
      "Lamina margins reflexed and modified, forming scarious false indusia; lamina glabrous or relatively sparsely hairy (in a few species also glandular and\/or scaly) abaxially",
      "Scales of rhizome lanceolate or linear-lanceolate, usually black or dark brown, with an entire margin."
    ],
    "authors":"Zhang Gangmin, Wenbo Liao, Ding Mingyan, Youxing Lin, Zhaohong Wu, Zhang Xianchun, Shiyong Dong, Jefferson Prado, Michael G. Gilbert, George Yatskievych, Tom A. Ranker, Elisabeth A. Hooper, Edward R. Alverson, Jordan S. Metzgar, Michele Funston, Shigeo Masuyama & Masahiro Kato"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Rhachidosoraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20901",
    "knowledge_content":[
      "Plants terrestrial or epilithic, evergreen, medium-sized. Rhizome erect or creeping, apex and base of stipes scaly; scales brown, lanceolate, entire, long; fronds caespitose, rarely distant or approximate. Fertile fronds up to 2 m; stipe pale stramineous, rarely red-brown, usually as long as lamina, base not thickened, with sparse scales, upward glabrous throughout. Lamina deltoid or ovate-deltoid, herbaceous, glabrous, pinnate lobes 2- or 3-pinnate or ultimate pinnules pinnate, acuminate at apex. Pinnae alternate, ascending, stipitate, pinnules anadromous, acuminate at apex, base asymmetrical or ± symmetrical. Lobes anadromous, obtuse, usually asymmetrical at base, ultimate pinnules serrate or crenate at margin, sometimes entire. Veins free, prominently, lateral veins mostly forked or pinnate on ultimate pinnules, rarely simple. Costae slightly shallowly grooved adaxially, bilateral margin with slight protuberance. Sori shortly linear, or slightly lunate, solitary on acroscopic veinlets of ultimate pinnule base, usually in 1 line per lobe, 1 or 2 pairs per lobe with pinnate veins, close to ultimate pinnules or midrib of lobes, in parallel lines with each other. Sori and indusia similar, solitary, thickly membranous, slightly swollen, pale gray or gray-green at first, then mostly becoming pale brown, entire, persistent, Spores 2-sided, semicircular in equatorial plane. Spores perispore prominent, slightly hyaline, rough, with regular or irregular filiform ornamentation, circular projection, or rarely broad flakelike folds. x = 40.\r",
      "One genus and seven species: mainly distributed in subtropical and tropical areas of China, east to Japan, the Philippines, south to Vietnam and Indonesia (Sumatra); five species (three endemic) in China.",
      "Based on molecular evidence that Rhachidosorus does not form a monophyletic group with Athyriaceae (cf. R. Sano et al., Molec. Phylogen. Evol. 15: 403-413. 2000), X. C. Zhang proposed the family Rhachidosoraceae (Phytotaxa 19: 16. 2011).Chu Wei-ming & He Zhao-rong. 1999. Rhachidosorus. In: Chu Wei-ming, ed., Fl. Reipubl. Popularis Sin. 3(2): 267-275."
    ],
    "authors":"He Zhaorong & Masahiro Kato"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Salviniaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10789",
    "knowledge_content":[
      "Plants aquatic, forming floating mats; roots present (Azolla) or lacking (Salvinia); stems horizontal, protostelic, vegetative reproduction rapid due to fragmentation. Fronds with exposed upper surface covered with water-repellent papillae, fronds in whorls of 3: two fronds floating, green, lamina orbicular to oblong, small (8-25 mm), third one submersed, finely dissected and rootlike (Salvinia), or fronds alternate, distichous, minute (ca. 1 mm), 2-lobed: one lobe floating, with a cavity near base containing blue-green algae (Anabaena), other lobe submersed, only 1 cell thick (Azolla). Sporangia contained within sporocarps, these inserted on submersed frond and externally uniform (Salvinia) or in pairs with a globose microsporocarp and a smaller ovoid megasporocarp (Azolla); spores of two kinds (plants heterosporous), microspores globose, trilete, megaspores large, spore germination endosporic.\r",
      "Two genera and ca. 17 species: tropical to temperate regions worldwide; two genera and four species (one introduced) in China.",
      "Lin Youxing. 2000. Salviniaceae and Azollaceae. In: Lin Youxing, ed., Fl. Reipubl. Popularis Sin. 6(2): 340-345.",
      "Fronds in whorls of 3, two floating, green, 8-25 mm, with midrib, third one finely dissected, submersed, rootlike; true root absent; sporocarps in clusters or chains of 6 or more, externally all similar.",
      "Fronds alternate, usually overlapping, ca. 1 mm, divided with a floating upper lobe and submersed lower lobe; root present; sporocarps in pairs, each usually with a small megasporocarp and a larger microsporophyte."
    ],
    "authors":"Youxing Lin, Shi Lei, Michele Funston & Michael G. Gilbert"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Schizaeaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10806",
    "knowledge_content":[
      "Plants terrestrial. Fronds simple (linear) or fan-shaped, variously cleft and with dichotomous free veins. Sporangia on marginal, elaminate, branched or unbranched projections at lamina tips, not in discrete sori, exindusiate; spores bilateral, monolete, 128-256 per sporangium; gametophytes green and filamentous (Schizaea), or subterranean and non-green, tuberous (Actinostachys Wallich). Base chromosome numbers: x = 77, 94, 103.\r",
      "Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Schizaeaceae. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 114-115."
    ],
    "authors":"Zhang Xianchun & John T. Mickel"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Selaginellaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10817",
    "knowledge_content":[
      "Plants herbaceous, terrestrial, epilithic, or occasionally epiphytic, evergreen or sometimes seasonally green, perennial (rarely annual). Rhizome erect, prostrate, creeping, ascending, or scandent, branched. Rootlike rhizophores borne on dorsal (upper) or ventral (lower) side in axils of branches, confined to lower part of rhizome or throughout, simple or branched. Roots formed at tip of rhizophore, branched. Leaves simple, 1-veined (exceptionally forked), each bearing a ligule in axil on adaxial surface, monomorphic or dimorphic, spirally arranged or in most species arranged in 4 ranks, 2 ranks on dorsal or upper side of stem and branch (called median or dorsal leaves), other 2 ranks on lateral or lower side (called lateral or ventral leaves). Strobili at apex of main stem or branch or lateral to branchlet, compact or lax, tetragonal, complanate or rarely cylindrical; sporophylls arranged in 4 ranks, monomorphic or dimorphic; in dorsiventral strobili with dimorphic sporophylls, dorsal (upper) sporophylls of most species larger than ventral (lower) ones (=resupinate), dorsal sporophylls normally green and firm in texture, while ventral ones paler and somewhat membranous, or dorsal sporophylls smaller than ventral sporophylls (=non-resupinate); in some dorsiventral strobili, dorsal sporophylls bearing outgrowths on lower surface, like a flap, termed \"sporophyll-pteryx,\" partially covering sporangium proximal to it. Sporophylls various, ranging from ovate to ovate-lanceolate, margin denticulate, ciliolate, or entire, apex acute and entire, with ligules distal to sporangia. Sporangia single per sporophyll, heterosporangiate (megasporangium and microsporangium). Spores heterosporous, megaspores ca. 10 × as large as microspores, megaspores 4, rarely 1 per sporangium, microspores more than 100; spores trilete, tetrahedral-globose, or nearly spheroidal, and often bearing equatorial flange. x = 8, 9, 10.\r",
      "One genus and ca. 700 species: almost cosmopolitan, with its highest diversity in the tropics; 72 species (23 endemic, one introduced) in China.",
      "Zhang Xianchun. 2004. Selaginellaceae. In: Zhang Xianchun, ed., Fl. Reipubl. Popularis Sin. 6(3): 86-219."
    ],
    "authors":"Zhang Xianchun, Hans P. Nooteboom & Masahiro Kato"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Tectariaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20307",
    "knowledge_content":[
      "Authors: Prof. Fuwu Xing, Yan Yuehong, Shiyong Dong, Wang Faguo, Maarten J. M. Christenhusz & Peter H. Hovenkamp",
      "Plants terrestrial, 10-300 cm tall. Rhizome erect or ascending to creeping, short or long, stout or slender, scaly at apex; rhizome and basal stipe scales brown, linear or lanceolate, margins entire, finely toothed, or ciliate, membranous. Stipe yellow, brown, or black, scaly at base or sometimes throughout. Fronds tufted or approximate, monomorphic to strongly dimorphic, simple or pinnate to 4 times pinnate-pinnatifid, often triangular or pentagonal, usually decompound toward apices; rachises and costae usually (in most genera) covered with articulate multicellular (ctenitoid) hairs; veins free or variously anastomosing, included veinlets if present simple or forked. Sori terminal on included free veins, dorsal on veins or compital on (at intersection of) connected veins, usually orbicular, sometimes elongate, anastomosing in lines, in some species throughout abaxial surface of lamina when mature, indusiate or exindusiate; indusia if present orbicular-reniform, persistent or caducous. Spores ovoid or elliptic, monolete, perispore with winglike folds, cristate, echinate, verrucose, rugose, or spinose. n = 10, 40, 41.\r",
      "Eight to 15 genera and ca. 300 species: pantropical; four genera and 41 species (seven endemic) in China.",
      "The number of genera and species in this family has been in considerable flux. Molecular studies (Hasebe et al., Amer. Fern J. 85: 134-181. 1995) have increased our understanding of many fern families, and the placement of many uncertainly placed genera has recently become more evident. The genera Ctenitis (incl. Ataxipteris), Dryopsis (= Dryopteris sect. Dryopsis), and Lastreopsis, which were previously placed in Tectariaceae, are now known to belong to the Dryopteridaceae (Hasebe et al., loc. cit.; Smith et al., Taxon 55: 717. 2006; Liu et al., Sci. China, C, 50: 789-798. 2007) and are treated in that family in this Flora. The two families have always been difficult to separate on a morphological basis, but molecular evidence shows that Tectariaceae in its strict sense is sister to a clade uniting Polypodiaceae, Oleandraceae, and Davalliaceae. The group directly sister to Tectariaceae is Lomariopsidaceae (incl. Nephrolepidaceae), which in turn forms a sister clade to Dryopteridaceae, together forming the Eupolypods I clade (Smith et al., loc. cit.: 707).Few molecular studies have so far addressed the Tectariaceae as a whole, and the generic delimitations are, therefore, far from established. Recent studies suggest that a number of segregate genera is deeply embedded within Tectaria, making it a somewhat polymorphic genus. Here, we have followed this broad concept of Tectaria, and included the genera Ctenitopsis, Hemigramma, and Quercifilix. This is admittedly a conservative approach, but it will have to suffice for the purposes of the present treatment until further studies provide a better understanding and better established delimitation of the genera within Tectariaceae.Pleocnemia and Pteridrys are maintained as separate from Tectaria s.l. because they show sufficient molecular and morphological distinctness. Pleocnemia was tentatively placed in Dryopteridaceae by Liu et al. (loc. cit.), but evidence for this is scarce, and we, therefore, maintain it here in Tectariaceae following Smith et al. (loc. cit.: 718), until further data are available.The following taxon, described from China, is excluded from the present treatment, pending further research: Sagenia cicutaria (Linnaeus) T. Moore var. tenerifrons Christ (Bull. Acad. Int. Géogr. Bot. 11: 257. 1902).Ching Ren-chang, Fu Shu-hsia, Wang Chu-hao & Shing Gung-hsia. 1959. Arthropteris. In: Ching Ren-chang, ed., Fl. Reipubl. Popularis Sin. 2: 318-319; Wang Chuhao. 1999. Aspidiaceae (excluding Ctenitis and Lastreopsis). In: Wu Shiewhung, ed., Fl. Reipubl. Popularis Sin. 6(1): 1-103; Wu Shiewhung. 1999. Arthropteris. In: Wu Shiewhung, ed., Fl. Reipubl. Popularis Sin. 6(1): 151-153.",
      "Veins along costae and costules anastomosing; fronds mostly 2- or 3-pinnate, cylindric glands many on abaxial surface of lamina."
    ],
    "authors":"Prof. Fuwu Xing, Yan Yuehong, Shiyong Dong, Wang Faguo, Maarten J. M. Christenhusz & Peter H. Hovenkamp"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Thelypteridaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10887",
    "knowledge_content":[
      "Plants terrestrial or on rocks. Rhizomes stout, dictyostele radially symmetrical, branched or not, erect, ascending, or long creeping, with scales at apices; scales basiflexed, lanceolate or nearly ovate, brown, thick, luminae elongate, usually with grayish white short setae on dorsal side or ciliate along margins. Fronds clustered, approximate, or remote; stipes slender, stramineous, not articulate, with 2 crescent-shaped vascular bundles at base, usually scaly at bases, distally ± with grayish white unicellular acicular hairs, rarely with multicellular long hairs or stellate hairs. Fronds monomorphic, rarely subdimorphic, oblong-lanceolate or oblanceolate, sometimes ovate or ovate-triangular, usually pinnate-pinnatifid, sometimes 3- or 4-pinnate-pinnatifid, rarely 1-pinnate; pinnae symmetrical at bases; costae grooved adaxially but grooves not confluent with rachial grooves, or raised and with dense grayish acicular hairs, with expanded tuberculate aerophores at bases of pinnae. Laminae herbaceous or papery, sometimes somewhat leathery, green or dark brown-green when dry, both sides (particularly rachises, costae, and main veins adaxially) with grayish white unicellular acicular hairs, rarely glabrous, usually with orange or reddish orange, stalked or sessile spherical or club-shaped glands, occasionally small scaly along rachises and costae abaxially. Sori orbicular, oblong, or shortly linear, dorsifixed on veins, indusiate or exindusiate; indusia orbicular-reniform, fixed by deep notch, most ± hairy, persistent or hidden in sori, caducous, or not concentrated into sori but scattered along reticulate veins and exindusiate. Sporangia long stalked, usually with hairs or glandular hairs below annuli and at distal end of sporangial stalks. Spores bilateral, rarely tetrahedral, tuberculate, echinate, granular, or usually with a winged perispore. Prothalli green, cordate or narrowly cordate, usually with broad wings, symmetrical, usually with hairs or glands. x = 27-36 (lacking 28).\r",
      "About 20 genera and ca. 1,000 species, more at lower elevations, very few tropical species above 4500 m: widespread in all tropical and subtropical zones of the world, less common in temperate zone, particularly more common in Asia; 18 genera (one endemic) and 199 species (102 endemic) in China.",
      "The family* is very natural and is distinguished from others by having grayish white unicellular acicular hairs and pubescence throughout the plant. However, there are many different viewpoints about generic circumscription in the family. Ching recognized 18 genera (including Hypodematium) in his 1963 treatment (Acta Phytotax. Sin. 8: 289-335); soon afterward, in 1978 (Ching, Acta Phytotax. Sin. 16(3): 12-13), the number of recognized genera in China grew to 20 (Hypodematium was removed and placed in its own family). In 1971, Holttum subdivided this family in the Paleotropics into 23 genera (Blumea 19(1): 17-52). In 1977, Pichi Sermolli, mainly following Holttum, circumscribed other genera for a total of 32 genera (Webbia 3(2): 213-512). In 1990, A. R. Smith divided the family into five genera (in Kramer & Green, Fam. Gen. Vasc. Pl. 1: 263-272), i.e., Thelypteris (including five subgenera), Phegopteris, Pseudophegopteris, Macrothelypteris, and Cyclosorus (including 20 subgenera). Of the many systems, those of Holttum and Pichi Sermolli divide the family most finely, with the greatest number of genera. Holttum (loc. cit.) segregated the following genera from Cyclosorus s.l.: Amphineuron, Christella, Pneumatopteris, and Sphaerostephanos. Recognition of these genera was based on several characters, including whether the proximal pinnae were shortened or not, and whether the sporangia and sporangial stalks bore hairs or glandular hairs. Holttum (loc. cit.) also segregated several genera (e.g., Parathelypteris and Coryphopteris) from the classical Thelypteris s.l., the free-veined thelypteroids, by characters that included rhizome habit, laminar glands, and chromosome base number. Smith (loc. cit.: 265) noted: \"Although many of Holttum\u0092s genera seem natural (i.e., monophyletic), a combination of characters must be used to circumscribe them. Some of the characters concern minute glands and hairs and require 30 × magnification or greater for observation. Others require that complete specimens be at hand (including lower part of blade and stem). Even then, identification to genus may be difficult, as generic lines are not always sharp.\" The question of generic delimitation within the family needs further study, but for now we adopt Ching\u0092s system (1978), modified from Ching (1963).***In 1940, Ching established many new families (Sunyatsenia 5(4): 237), including Thelypteridaceae with 12 genera, but the names of these new families are nomina nuda and were not therefore validly published (Melbourne Code, Art. 38.1(a)). Only in 1970 were these families formally published by Pichi Sermolli.**(1) Holttum set up the genus Amphineuron with mixed characters in 1971, which was also adopted by Ching in 1978. Among the 12 recognized species in the genus, three occur in China: the type species A. opulentum, which is similar to Cyclosorus in venation and lemon-yellow glands; A. immersum, which is similar to Parathelypteris species in venation; and A. tonkinensis, which has already been removed to a new genus, Mesopteris. As Holttum himself considered Amphineuron to be a provisional treatment, this genus is not adopted here.(2) Trichoneuron Ching (Acta Phytotax. Sin. 10: 118, pl. 22. 1967) was based on a single gathering, and the collection locality was unknown. Later, this species was rediscovered by Prof. W. M. Chu in Pingbian, SE Yunnan. According to Prof. Chu\u0092s study, it belongs to the genus Lastreopsis (Dryopteridaceae). It is, therefore, not included here.Using only venation, the family may be divided into 3 tribes: 1. Tribe Thelypterideae Ching: Veins free; with two subtypes: (1) all veinlets reaching margins or nearly reaching margins above sinuses between segments, with the bottom of sinuses not cartilaginous (e.g., Parathelypteris); (2) proximal pair of veinlets from adjacent segments reaching cartilaginous sinuses but not united; or acroscopic veinlet of basal pair of veinlets reaching cartilaginous sinus, basiscopic veinlet reaching margin above sinus (e.g., Pseudocyclosorus and Mesopteris); 2. Tribe Goniopterideae Ching: Veins partly combined; at least proximal pair of veinlets from adjacent segments united to form triangular areoles and this vein union producing a long or short excurrent veinlet; additional areoles may be produced in the same row, by subsequent vein unions of veinlets; excurrent veinlets may connect with more distal vein unions, or with a translucent line leading to a sinus, thus forming oblique rhomboid areoles (goniopteroid venation) (e.g., Cyclosorus, Ampelopteris), or squarish areoles (meniscioid venation) (e.g., Pronephrium, the areoles without included veinlets; 3. Tribe Dictyoclineae Ching: Veinlets between lateral veins all combined into irregular squarish or pentagonal areoles and each areole sometimes with simple or forked included veinlets.The following taxon is excluded from the present treatment, pending further research: Thelypteris calvata Ching (Bull. Fan Mem. Inst. Biol. Bot. ser. 2, 1: 313. 1949), described from Guangdong.Shing Kunghsia, Chiu Peishi, Yao Guanhu & Lin Youxin. 1999. Thelypteridaceae. In: Shing Kunghsia, ed., Fl. Reipubl. Popularis Sin. 4(1): 15-317, 319-353.",
      "Veins entirely reticulate, with or without simple or forked included veinlets in areoles; sori scattered and attached along reticulate veins.",
      "Veins partly reticulate (venation goniopteroid or meniscioid), areoles produced all without included veinlets; sori orbicular or shortly linear",
      "Veins meniscioid, i.e., all veinlets joining into square or rectangular areoles; pinnae large, broadly lanceolate; sori orbicular when young and usually confluent when mature.",
      "Veins goniopteroid, i.e., proximal pair of veinlets from adjacent segments or one pair of veinlets between veinlets of pinna joined to form into triangular areoles and producing an excurrent veinlet from these vein unions; excurrent veinlet or a line of translucent membrane at its end running to a sinus, several other pairs of veinlets connected to this excurrent vein or translucent membrane; pinnae small, narrowly lanceolate or triangular-lanceolate",
      "Pinnae pinnatifid; one long or short translucent membranous line at bottom of sinus on segments connected with excurrent veinlet, veins except proximal pair from second to fifth pairs of veinlets connected with excurrent veinlets or translucent membranous line and forming rhombic areoles, other veinlets reaching margins above sinus; laminae usually with orange or reddish orange spherical or club-shaped glands abaxially; sori indusiate.",
      "Pinnae pinnatilobate or subentire, without translucent membranous line below sinus; except proximal pair of veins, other several pairs of veinlets connected with excurrent veinlet or reaching margins above sinus; laminae without glands abaxially; sori exindusiate",
      "Plants with gemmae in pinna axils, these gemmae potentially developing into new plants; laminae covered with both simple and stellate hairs; sori orbicular or suborbicular; sporangia glabrous.",
      "Plants lacking gemmae; laminae with only simple hairs; sori thick and shortly linear; sporangia each with several setae at top.",
      "Costae glabrous adaxially (or occasionally with sparse caducous hairs); stipes with many scales on proximal parts.",
      "Costae rounded and raised adaxially; ends of veinlets not reaching margin; indusia small, or sometimes not developed",
      "Laminae oblong or broadly lanceolate, 2- or 3-pinnate, proximal pair of pinnae similar in shape and size or smaller than distal ones, throughout with unicellular hairs.",
      "Laminae triangular-ovate, 3- or 4-pinnate, proximal pair largest, throughout with multicellular hairs.",
      "Pinnae without tuberculate aerophores at pinna bases abaxially; proximal pairs of veins reaching margins above sinus; laminae herbaceous, abaxially usually with reddish orange spherical glands.",
      "Pinnae each with a tuberculate aerophore at base abaxially; proximal pair of lateral veins from adjacent segments with acroscopic veinlet reaching cartilaginous bottom of sinus; laminae papery or leathery, abaxially without spherical glands.",
      "Laminae ovate-triangular, 3-pinnate; veinlets forked, not reaching margins; laminae throughout with multicellular long hairs.",
      "Laminae narrowly oblong or lanceolate, pinnate-pinnatifid; veinlets simple and reaching margins; laminae throughout with unicellular short hairs",
      "Rachises at pinna bases abaxially with brown tuberculate aerophores; laminae ?brown when dry; segments without cartilaginous ridge at bottom of sinuses.",
      "Rachises at pinna bases abaxially without brown tuberculate aerophores; laminae green when dry; segments with a cartilaginous ridge at bottom of sinuses",
      "Plants ?with acicular hairs; pinnae pinnatifid nearly to costae; segments falcate-lanceolate, proximal pair of veinlets nearly reaching translucent membrane or margin above sinus; sori close to costules.",
      "Plants glabrous throughout; pinnae pinnatifid to 1\/2 of distance to costae; segments triangular, proximal 3 pairs of veinlets reaching margin of translucent membrane below sinus but not joined; sori not close to costules.",
      "Laminae brown or brownish green when dry, with full spreading acicular hairs on both surfaces; proximal 1 or 2 pairs of pinnae free, distal ones adnate to costae; veinlets expanded at ends of veins and reaching margin; sori attached on middle of veinlets; sporangia each with 2-6 acicular hairs at tops.",
      "Laminae green when dry, subglabrous on both surfaces; pinnae completely free from rachises; veinlets expanded at ends and not reaching margin; sori attached near tips of veinlets.",
      "Plants small; stipes stramineous, not polished; laminae ovate-triangular or narrowly lanceolate; lateral pinnae decurrent along both sides of rachises and connected to each other; rachises and costae with more lanceolate scales, scales ciliate along margins; veinlets reaching margin.",
      "Plants usually taller and larger; stipes reddish brown or brownish stramineous, polished; laminae oblong, rarely broadly lanceolate; lateral pinnae not decurrent and free from each other; rachises and costae without scales; veinlets not reaching margin."
    ],
    "authors":"Youxing Lin, Li Zhongyang, Kunio Iwatsuki & Alan R. Smith"
  },
  {
    "group_title":"Pteridophytes",
    "family":"Woodsiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10954",
    "knowledge_content":[
      "Plants epilithic, sometimes xerophytic (growing in dry habitats), small or medium-sized. Rhizomes short, erect, decumbent, or ascending, simple dictyostelic, covered with scales. Fronds clustered, monomorphic, deciduous or sometimes evergreen; stipe mostly shorter than lamina, ± scaly and hairy, articulate or not articulate; lamina 1-pinnate to bipinnatifid, elliptic-lanceolate to narrowly lanceolate, herbaceous or papery, frequently covered with articulate multicellular hairs, sometimes with glandular hairs or capitate glands. Veins free, pinnate, usually ending in enlarged hydathodes. Sori orbicular, consisting of 3-18 sporangia, borne at middle or apex of veinlets; indusia inferior, saucer-shaped to cup-shaped, margin long ciliate, or indusia absent, degenerated into curly, multicellular hairs (Woodsia), or sphaeropteroid (bladderlike) with openings at tip (Protowoodsia), sometimes also covered with false indusia, i.e., reflexed leaf margins (Cheilanthopsis). Spores ellipsoid or somewhat spherical, monolete, wall surface folded, cristate, tuberculate, or echinate.\r",
      "About four genera (including the Caucasian Hymenocystis C. A. Meyer) and ca. 43 species: widely distributed in the N temperate and frigid zones, rarely in Central and South America, Africa (Angola, South Africa), and Madagascar; three genera and 24 species (nine endemic) in China.",
      "The current classification of the genera requires evaluation by molecular phylogenetic evidence.Wu Shiew-hung. 1999. Woodsiaceae. In: Wu Shiew-hung, ed., Fl. Reipubl. Popularis Sin. 4(2): 166-191.",
      "Lamina glabrous or with few glandular trichomes, margin flat, not reflexed; pinnae not articulate to rachis.",
      "Lamina pubescent, margin reflexed to form false indusia (usually fallen later); pinnae articulate to rachis."
    ],
    "authors":"Zhang Gangmin, Masahiro Kato & Alexandr Shmakov"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Araucariaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10059",
    "knowledge_content":[
      "Trees evergreen, dioecious or monoecious, with relatively large pith in trunk and resin in cortex. Leaves spirally arranged or decussate, sessile, decurrent. Cones unisexual. Pollen cones axillary or terminal on branchlets, solitary or clustered; microsporophylls numerous, spirally arranged, sessile; microsporangia 4-20, external, suspended, arranged in 2 rows, filiform; pollen sacs split longitudinally; pollen nonsaccate. Seed cones solitary, terminal on branchlets, maturing in 2nd or 3rd year; bracts numerous, spirally arranged; ovulate scales degenerate or ligulate, connate with bracts on 1 side, each with 1 ovule at base abaxially; ovules connate with ovulate scales or with bracts (when ovulate scales degenerate); bracts of mature cones deciduous, flattened, woody or thickly leathery, bearing 1 seed in basal part (if developed), sometimes adnate with ligulate seed scales in center of adaxial surface, apex triangular or caudate. Seeds connate with bracts or detached, flattened, winged or not. 2n = 26.",
      "Three genera and 41 species: Indonesia, Malaysia, Papua New Guinea, Philippines; Australia, New Zealand, SW Pacific Islands, South America; two genera and four species (all introduced) in China.\r",
      "Cheng Wan-chün, Fu Li-kuo, Tsui Hung-pin & Chen Chia-jui. 1978. Araucariaceae. In: Cheng Wan-chün & Fu Li-kuo, eds., Fl. Reipubl. Popularis Sin. 7: 24-31.",
      "Seeds detached from bracts, with a lateral wing on 1 side and a small protrusion (occasionally developed into a wing) on other"
    ],
    "authors":"Liguo Fu, Nan Li & Robert R. Mill"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Betulaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10101",
    "knowledge_content":[
      "Trees or shrubs deciduous, monoecious. Stipules present, free, often deciduous, rarely persistent. Leaves alternate, simple, petiolate, usually doubly serrate, rarely simply serrate, lobulate, or entire; veins pinnate. Flowers unisexual. Male inflorescence precocious, elongate, pendulous, with numerous overlapping bracts; each bract usually subtending a small dichasium with 1-3 male flowers; stamens as many as and opposite sepals or, if sepals obsolete, then stamens of inflorescence to 20; filaments very short, connate or nearly so; anthers 2-loculed, thecae connate or separate, opening by longitudinal slits. Female inflorescence pendulous or erect, with numerous overlapping bracts; each bract subtending a small dichasium with 2 or 3 flowers; calyx with 1-6 scalelike lobes, or obsolete; petals absent; ovary inferior, 2-loculed; styles 2, free; ovules 2, or 1 by abortion, pendulous from near apex of each locule. Fruit a nut or nutlet, winged or not. Seed 1, with straight embryo and flat or thickened cotyledons, without endosperm.",
      "Six genera and 150-200 species: mainly in Asia, Europe, and North and South America; six genera (one endemic) and 89 species (56 endemic) in China.\r",
      "Because of evolutionary divergence within the Betulaceae, the family has often been divided into tribes (i.e., Betuleae, Carpineae, and Coryleae) or more recently into subfamilies (J. J. Furlow, J. Arnold Arbor. 71: 1-67. 1990). Li Pei-chun & Cheng Sze-hsu. 1979. Betulaceae. In: Kuang Ko-zen & Li Pei-chun, eds., Fl. Reipubl. Popularis Sin. 21: 44-137.",
      "Male flowers 3 in a small dichasium, calyx present; female flowers without calyx; fruit a nutlet, winged; cotyledons flat.",
      "Male flower 1, calyx absent; female flowers with calyx adnate to ovary; fruit a nut or nutlet, wingless; cotyledons thick, fleshy.",
      "Female inflorescence conelike; bracts woody, persistent, 5-lobed at apex, each bract subtending 2 flowers; male flower with (1 or 3 or)4 stamens",
      "Female inflorescence spicate; bracts leathery, deciduous, 3-lobed at apex, each bract subtending 3 flowers; male flower with 2 stamens",
      "Fruit a nut; male flowers with 2 bracteoles; thecae separate, pubescent at apex; bracts campanulate or forming a tubular sheath",
      "Fruit a nutlet; male flowers without bracteoles; thecae not separate, glabrous at apex; bracts forming a tubular sheath"
    ],
    "authors":"Pei-chun Li & Alexei K. Skvortsov"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Casuarinaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10167",
    "knowledge_content":[
      "Trees or shrubs evergreen, monoecious or dioecious. Ultimate branchlets jointed, with several short, basal articles and 1-numerous elongated articles, slender, ridged, often pubescent at least when young. Leaves small, toothlike, in whorls of 4 to ca. 20 (equal to number of ridges on branchlets); stipules absent. Inflorescences spikelike or headlike, with alternating whorls of toothlike bracts; within each bract a single flower, with 2 lateral scalelike bracteoles, persistent (rarely deciduous in male Allocasuarina); parts sometimes pubescent when young, mostly glabrous at maturity. Flowers unisexual, without pedicels. Male inflorescences spikes, terminal or lateral, terete, slender. Female inflorescences headlike, globose or ellipsoid, usually terminal on short, lateral branches. Male flowers: tepals 1 or 2, scalelike, deciduous, hooded; stamen 1; anthers 2-loculed, longitudinally dehiscent, basifixed. Female flowers: perianth none; carpels 2, fused; only anterior carpel fertile, posterior carpel usually ±  reduced or obsolete; ovules 2 (rarely 4), parietal, paired at base of carpel, chalazogamous; style short; stigmas 2, red, linear. Infructescences ±  woody, conelike, with dense whorls of fruit, with 2 bracteoles of each flower enlarged as valves, persistent. Samaras flat, (usually) winged at apex, initially enclosed by 2 bracteoles, which separate at maturity to release samara. Seed 1; cotyledons large; endosperm absent; embryo straight, often more than 1.",
      "Four genera and 97 species: mainly in Australia, extending to SE Asia, Malesia, Pacific Islands; commonly introduced and occasionally naturalized elsewhere; one genus and three species (all introduced) in China.\r",
      "In addition, five species of the Australian endemic genus Allocasuarina L. A. S. Johnson are said to be occasionally introduced to China: A. fraseriana (Miquel) L. A. S. Johnson, A. huegeliana (Miquel) L. A. S. Johnson, A. nana (Sieber ex Sprengel) L. A. S. Johnson, A. verticillata (Lamarck) L. A. S. Johnson (formerly Casuarina stricta Aiton), and A. trichodon (Miquel) L. A. S. Johnson. Allocasuarina differs from Casuarina as follows: leaves 4-14 per whorl on branchlets; cone bracteoles thickly woody, mostly extending only slightly beyond cone body, mostly with a separate angular or divided abaxial protuberance; mature samaras red-brown to black, shiny. However, no specimens have been seen to confirm these occurrences; some may be misidentifications, e.g., C. equisetifolia has been misidentified at times as A. huegeliana in Taiwan. Chen Te-chao. 1982. Casuarinaceae. In: Tseng Yung-chien, ed., Fl. Reipubl. Popularis Sin. 20(1): 1-5."
    ],
    "authors":"Nianhe Xia, Lawrence A. S. Johnson & Karen L. Wilson"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Cephalotaxaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10174",
    "knowledge_content":[
      "Trees or shrubs evergreen, dioecious (occasionally monoecious); bud scales persistent. Leaves 2-ranked, pectinately arranged and leafy branchlets elliptic to obdeltoid in outline, decussate or ±  opposite, sessile or subsessile, basally somewhat twisted; blade linear, linear-lanceolate, or occasionally lanceolate, midvein green abaxially, elevated on both surfaces, stomatal bands 2, abaxial, each comprising 11-24 rows of stomata, usually appearing white because of powdery covering, as wide as or usually wider than midvein, marginal bands green, as wide as or narrower than midvein, resin canal abaxial. Pollen cones borne on branches of preceding year, aggregated into capitula of 6-8; capitula axillary, solitary, pedunculate or subsessile; peduncle usually with several spirally arranged scales, rarely naked; cones subtended by 1 ovate or triangular-ovate bract; microsporophylls 4-16, each with (2 or)3(or 4) pollen sacs; pollen nonsaccate. Seed cones borne from axils of terminal bud scales, 1-6(-8) per bud, long pedunculate; floral axis with several pairs of decussate bracts each bearing 2 erect, axillary ovules. Seeds ripening in 2nd year, drupelike, completely enclosed by succulent aril, ovoid, ellipsoid, or globose, apex mucronate. Cotyledons 2. Germination epigeal.",
      "One genus and eight to eleven species: China, India, Japan, Korea, Laos, Myanmar, Thailand, Vietnam; six species (three endemic) in China.\r",
      "There is currently debate about whether the Cephalotaxaceae should continue to be recognized as separate from the Taxaceae. Cephalotaxus appears to form a distinct lineage related to Taxaceae; however, it differs from that family in its seed cones, which have several 2-ovulate bracts, instead of a single fertile, 1-ovulate bract. The total number of distinct species of Cephalotaxus is quite open to question and much in need of detailed biosystematic study.Cheng Wan-chün, Fu Li-kuo & Chao Chi-son. 1978. Cephalotaxaceae. In: Cheng Wan-chün & Fu Li-kuo, eds., Fl. Reipubl. Popularis Sin. 7: 423-436."
    ],
    "authors":"Liguo Fu, Nan Li & Robert R. Mill"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Chloranthaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10187",
    "knowledge_content":[
      "Shrubs, small trees, or perennial herbs. Leaves simple; stipules small; petioles usually connate at base; leaf blade pinnately veined, margin serrate or crenate. Flowers small, bisexual or unisexual, arranged in spikes, capitula, or panicles; perianth present in female flowers or absent. Bisexual flowers: stamens 1 or 3, inserted on 1 side of ovary; filaments inconspicuous; connectives conspicuous, if stamens 3, connectives connate at base or free; anthers 1- or 2-loculed, longitudinally dehiscent; pistil 1, 1-carpelled; ovary inferior, 1-loculed; ovule 1, pendulous, orthotropous; style short or absent. Unisexual flowers: male flowers many, stamen 1; female flowers few; perianth 3-toothed, calyxlike, connate to ovary. Drupes ovoid or globose; exocarp ±  fleshy; endocarp hard. Seeds containing rich endosperm and tiny embryo.",
      "Five genera and ca. 70 species: tropical and subtropical regions; three genera and 15 species (nine endemic) in China.\r",
      "The origin and distribution of the family have been discussed by Z. K. Zhou (Acta Bot. Yunnan. 15: 321-331. 1993). Wu Kuo-fang. 1982. Chloranthaceae. In: Tseng Yung-chien, ed., Fl. Reipubl. Popularis Sin. 20(1): 77-97.",
      "Flowers unisexual, female flowers with a 3-toothed, cupular perianth connate to ovary; male flowers with 1 stamen",
      "Stamens (1 or)3, base ± connate, central anther 2-loculed, lateral anthers 1-loculed; perennial herbs or subshrubs"
    ],
    "authors":"Nianhe Xia & Joël Jérémie"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Cupressaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10237",
    "knowledge_content":[
      "Trees or shrubs evergreen, monoecious or dioecious. Leaves decussate or in whorls of 3, scalelike and then often dimorphic with flattened facial leaves and keeled lateral leaves, or needlelike particularly in juvenile plants, often with an abaxial resin gland. Pollen cones terminal or axillary, solitary, maturing and shed annually; microsporophylls 6-16, decussate or whorled, each bearing (2 or)3-6(-9) pollen sacs; pollen wingless. Seed cones usually terminal, solitary, globose, ovoid, or oblong, dehiscent or indehiscent when mature in 1st or 2nd(or 3rd) year; cone scales developing after ovules originate in bract axils; bracts almost completely enveloped by cone scales, free only at apex; ovules 1-numerous per bract axil, erect; cone scales of mature cones 3-16, flat or peltate, woody, ±  leathery, or succulent, 1-20-seeded. Seeds winged or not; wings derived from seed coat. Cotyledons usually 2, rarely 3-6. Germination epigeal.",
      "Nineteen genera and ca. 125 species: worldwide; eight genera (one introduced) and 46 species (16 endemic, 13 introduced) in China.\r",
      "In this account, the Cupressaceae are treated sensu stricto, i.e., excluding those taxa that are traditionally classified in Taxodiaceae. A merger of these two families is substantially supported by both morphological and molecular evidence (the Cupressaceae form a clearcut monophyletic group derived from within the Taxodiaceae). No consistent characters separate them, while the homology of the reproductive organs, so fundamentally different from other conifer families, appears to unite them phylogenetically. However, the traditional family concept, as adopted in FRPS, has been maintained here for pragmatic reasons. In FRPS, it was stated that Microbiota decussata Komarov had been said to grow in NE China, but that no material had been seen. This species is known with certainty only from the Sikhote Alin range of E Russia (Primorye), not far from the Chinese border, where it grows on mountains above the timberline. It resembles a spreading Juniperus but has minute, dehiscent, 1-seeded cones, and should be searched for in comparable areas in E Heilongjiang. One endemic species, Thuja sutchuenensis, has apparently become extinct in the wild in historic times. Sabina, which was recognized in FRPS as a distinct genus, is reduced to the synonymy of Juniperus in this account. For the species that bear scalelike leaves, the branchlets described are those bearing such leaves.Wang Wen-tsai, Cheng Wan-chün, Fu Li-kuo & Chu Cheng-de. 1978. Cupressaceae. In: Cheng Wan-chün & Fu Li-kuo, eds., Fl. Reipubl. Popularis Sin. 7: 313-398.",
      "Branchlets usually not arranged in a plane; seed cones maturing in 2nd year, fertile cone scales with 3-numerous seeds",
      "Branchlets arranged in a plane; seed cones maturing in 1st year, fertile cones scales with (1 or)2(-5) seeds",
      "Lateral leaves 4-7 mm, with conspicuous, white stomatal bands abaxially; fertile cone scales each with 3-5 seeds",
      "Lateral leaves usually less than 4 mm, without conspicuous, white stomatal bands abaxially; fertile cone scales each with 1 or 2 seeds.",
      "Seed cones with middle 2 or 3 pairs of scales fertile; seeds with 2 lateral, narrow wings, a very narrow wing, or wingless.",
      "Seed cones with 8 or 10 thin scales; bracts almost completely enveloped by cone scales, free apex, a very short mucro; seeds with 2 lateral, narrow wings",
      "Seed cones with 6 or 8 thick scales; bracts partly enveloped by cone scales, free apex a long, recurved cusp; seeds wingless, rarely with a very narrow wing",
      "Calocedrus  KurzChamaecyparis  SpachCupressus  LinnaeusFokienia  A. Henry & H. H. ThomasJuniperus  LinnaeusPlatycladus  SpachThuja  LinnaeusThujopsis  Siebold & Zuccarini ex Endlicher"
    ],
    "authors":"Liguo Fu, Yong-fu Yu, Robert P. Adams & Aljos Farjon"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Cycadaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10241",
    "knowledge_content":[
      "Trees or shrubs evergreen, dioecious, mostly palmlike; trunk columnar, sometimes dichotomously branched at apex, rarely ovoid-bulbous and subterranean, clothed with bases of fallen leaves; bark often thickened and roughened. Leaves borne at apex of trunk, 1(-3)-pinnately compound, spirally arranged; new leaves erect (or somewhat inflexed and appearing coiled in C. multipinnata group), with circinnate leaflets; petiole with spines representing (reduced basal leaflets), rarely unarmed, base swollen and hairy; leaflets numerous, alternate to subopposite, dichotomously branched in a few species, midvein present, margin usually entire. Cataphylls prominent, alternate with leaves, hairy, apex often rigid and pungent. Pollen cones borne at apex of trunk, cylindric or fusiform; microsporophylls numerous, scalelike, spirally and tightly arranged along axis of cone, with numerous microsporangia in groups abaxially; pollen tubes producing 2 motile sperm cells. Megasporophylls several to numerous, somewhat leaflike, alternating with flushes of leaves, arranged in a loose, \"conelike\" crown surrounding apex of trunk, each with a linear fertile stalk and an apical, pinnatifid or subentire sterile blade; ovules (1 or)2-5 on each side of stalk. Seeds drupelike, somewhat compressed; seed coat 3-layered, consisting of colored sarcotesta, woody sclerotesta, and membranous endotesta. Cotyledons 2, united at base. Germination hypogeal, cryptocotylar. 2n = 22*.",
      "One genus and ca. 60 species: E Africa (including Madagascar), E and S Asia, N Australia, Pacific Islands; 16 species (eight endemic) in China.\r",
      "Ornamental species include Cycas revoluta, which is widely cultivated worldwide. Other species (e.g., C. circinalis Linnaeus, C. media R. Brown, C. pectinata, C. rumphii Miquel, C. taitungensis, and C. thouarsii R. Brown) have excellent ornamental qualities. The stem starch, \"sago\" (not to be confused with the true sago as obtained from palms of the genus Metroxylon Rottboøll), is edible and is used in packing brewers’ yeast after the removal of cycasins which are highly toxic and carcinogenic. A paste of Cycas seeds and coconut oil is used for the treatment of skin complaints, wounds, ulcers, sores, and boils. Fu Shu-hsia, Cheng Wan-chün, Fu Li-kuo & Chen Chia-jui. 1978. Cycadaceae. In: Cheng Wan-chün & Fu Li-kuo, eds., Fl. Reipubl. Popularis Sin. 7: 4-17."
    ],
    "authors":"Jiarui Chen & Dennis W. Stevenson"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Ephedraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10313",
    "knowledge_content":[
      "Shrubs, subshrubs, or herbs, dioecious, rarely monoecious; stems erect, procumbent, or occasionally climbing, jointed, much branched, photosynthetic; branchlets opposite or whorled, green, terete, longitudinally grooved. Leaves opposite or in whorls of 3, scalelike, basally ±  connate and reduced to membranous sheaths, generally ephemeral, mostly not photosynthetic; resin canals absent. Cones terminal or axillary, ovoid or ellipsoid. Pollen cones solitary or clustered at nodes, each cone composed of membranous bracts arranged in 2-8 decussate pairs or whorls of 3; proximal bracts empty; each distal bract subtending a male flower composed of 2 basally fused, orbicular or obovate scales (false perianth); anthers sessile or stipitate on staminal column. Seed cones opposite or in whorls of 3 or 4 at nodes, each cone composed of overlapping bracts; bracts arranged in 2-10 decussate pairs or whorls of 3, red and fleshy at maturity (rarely brown and membranous), proximal bracts empty, most distal bracts subtending an axillary female flower composed of a pair of fused, leathery scales (false perianth) enclosing ovule with a single membranous integument prolonged into a slender, tubular micropyle. Seeds 1 or 2(or 3) per cone. Cotyledons 2. Germination epigeal. 2n = 14*, ?24*, 28*, ?36*, 56*.",
      "One genus and ca. 40 species; arid regions of E and N Africa, Asia, Europe, North America, and South America; 14 species (two endemic) in China.\r",
      "The strictly flowering plant terms flower, staminal column, and anther are used here to avoid unwieldy descriptions.Cheng Ching-yung. 1978. Ephedraceae. In: Cheng Wan-chün & Fu Li-kuo, eds., Fl. Reipubl. Popularis Sin. 7: 468-489."
    ],
    "authors":"Liguo Fu, Yong-fu Yu & Harald Riedl"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Fagaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10338",
    "knowledge_content":[
      "Trees or rarely shrubs, monoecious, evergreen or deciduous. Stipules usually early deciduous. Leaves alternate, sometimes false-whorled in Cyclobalanopsis. Inflorescences unisexual or androgynous with female cupules at the base of an otherwise male inflorescence. Male inflorescences a pendulous head or erect or pendulous catkin, sometimes branched; flowers in dense cymules. Male flower: sepals 4-6(-9), scalelike, connate or distinct; petals absent; filaments filiform; anthers dorsifixed or versatile, opening by longitudinal slits; with or without a rudimentary pistil. Female inflorescences of 1-7 or more flowers subtended individually or collectively by a cupule formed from numerous fused bracts, arranged individually or in small groups along an axis or at base of an androgynous inflorescence or on a separate axis. Female flower: perianth 1-7 or more; pistil 1; ovary inferior, 3-6(-9)-loculed; style and carpels as many as locules; placentation axile; ovules 2 per locule. Fruit a nut. Seed usually solitary by abortion (but may be more than 1 in Castanea, Castanopsis, Fagus, and Formanodendron), without endosperm; embryo large.",
      "Seven to 12 genera (depending on interpretation) and 900-1000 species: worldwide except for tropical and S Africa; seven genera and 294 species (163 endemic, at least three introduced) in China.\r",
      "Many species are important timber trees. Nuts of Fagus, Castanea, and of most Castanopsis species are edible, and oil is extracted from nuts of Fagus. Nuts of most species of this family contain copious amounts of water soluble tannin. Members of the Fagaceae are the main element of both broad-leaved evergreen and mixed mesophytic forests from 500-3200 m. Huang Chengchiu, Chang Yongtian, Hsu Yongchun & Jen Hsienwei. 1998. Fagaceae. In: Chun Woonyong & Huang Chengchiu, eds. Fl. Reipubl. Popularis Sin. 22: 1-332.",
      "Male inflorescences elongated catkins, erect or pendulous; female flowers solitary or in spikes; germination hypogeal (epigeal in Formanodendron).",
      "Cupules solitary on rachis, mostly bilaterally symmetric with abaxial and adaxial sides differing in shape and\/or spines (± radially symmetric in C. calathiformis. C. cerebrina. C. uraiana, and C. sclerophylla)",
      "Cupules in cymes on rachis (often some cupules abort but still evident at base of developed cupules, except in L. fenzelianus, radially symmetric",
      "Castanea  MillerCastanopsis  (D. Don) SpachCyclobalanopsis  OerstedFagus  LinnaeusFormanodendron  Nixon & CrepetLithocarpus  BlumeQuercus  Linnaeus"
    ],
    "authors":"Chengjiu Huang, Yongtian Zhang & Bruce Bartholomew"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Ginkgoaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10370",
    "knowledge_content":[
      "Trees deciduous, dioecious; trunk tall, densely branched; branchlets dimorphic: both long and short. Leaves sparsely and spirally arranged on long branchlets, fasciculate on short branchlets, long petiolate, flabellate, venation parallel, close, dichotomous, open but with rare anastomoses, base broadly cuneate, margin straight, entire, apex 2-lobed or notched. Reproductive structures produced in clusters in axils of scalelike leaves at apex of short branchlets before leaves expand. Pollen cones pedunculate, pendulous, catkinlike; microsporophylls numerous, spirally and rather sparsely arranged; microsporangia 2, elliptic; pollen sacs longitudinally dehiscent. Ovules borne on a long, dichotomously branched peduncle sometimes dividing into 3-5 terminal forks; each fork discoid at apex, bearing an erect, sessile ovule; usually only 1 seed ripening per peduncle. Seeds long pedunculate, pendulous, drupelike, with a single integument differentiated into a fleshy, succulent sarcotesta, a bony sclerotesta, and a membranous endotesta; female gametophyte tissue abundant. Cotyledons 2(or 3). Germination hypogeal. 2n = 24*.",
      "Cheng Wan-chün & Fu Li-kuo. 1978. Ginkgoaceae. In: Cheng Wan-chün & Fu Li-kuo, eds., Fl. Reipubl. Popularis Sin. 7: 18-23."
    ],
    "authors":"Liguo Fu, Nan Li & Robert R. Mill"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Gnetaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10375",
    "knowledge_content":[
      "Vines evergreen, woody, less often erect shrubs or trees, dioecious or sometimes monoecious; stems with swollen nodes. Leaves opposite, petiolate, without stipules, simple, pinnately veined, margin entire. Flowers unisexual, borne in whorled, spikelike cones (here termed \"spikes\"), arranged in lax, dichasial cymes. Cymes terminal or lateral, sometimes arranged in dense, cauliflorous clusters on old stems. Spikes with many cupular to almost flat, annular, involucral collars, each formed by the fusion of a whorl of bracts. Male spikes with collars closely arranged and ±  hiding axis (less often somewhat laxly arranged), each collar with 20-80 flowers, often also with a whorl of sterile female flowers, apical whorl with sterile female flowers only; male flowers with a cupular, succulent false perianth, usually ±  obconical; stamens 2, filaments fused, exserted from false perianth; anthers opening by a common, apical slit, pollen rounded, with minute projections. Female spikes solitary or several in a panicle, often cauliflorous; involucral collars widely separated, each with 4-12 flowers; female flowers with a false perianth tightly enclosing ovule; ovule with 2 integuments, innermost integument elongated into a micropylar tube exserted from false perianth; outer integument with a fleshy, outer layer connate with false perianth and developing into a false seed coat, inner layer bony. Seeds drupelike, enclosed in a red, orange, or yellow, fleshy (rarely corky) false seed coat; female gametophyte tissue copious, succulent. Cotyledons 2. Germination epigeal.",
      "One genus and about 40 species: mostly tropical and subtropical Asia, fewer species in W Africa and NW South America; nine species (six endemic) in China.\r",
      "Following common convention, the strictly flowering plant terms inflorescence, flower, fruit, stamen, filament, and anther are used here to avoid unwieldy descriptions. Cheng Ching-yung. 1978. Gnetaceae. In: Cheng Wan-chün & Fu Li-kuo, eds., Fl. Reipubl. Popularis Sin. 7: 490-504."
    ],
    "authors":"Liguo Fu, Yong-fu Yu & Michael G. Gilbert"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Juglandaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10460",
    "knowledge_content":[
      "Trees or rarely shrubs, deciduous, semievergreen, or evergreen, monoecious or rarely dioecious; bark tight (or exfoliating). Branchlets with solid or chambered pith. Terminal buds subglobose or ovoid to oblong, naked or with scales. Stipules absent. Leaves alternate (or opposite), odd- or even-pinnate, sometimes trifoliolate, rarely simple; leaflets with glandular, peltate scales, often resinous and aromatic, particularly conspicuous abaxially on young leaves and twigs, margin serrate or rarely entire. Inflorescences pendulous or sometimes erect, lateral or terminal, on reduced shoots arising on branchlets of previous year (old growth) or on current year’s growth (new growth), of several types: androgynous panicle with male, lateral spikes and female, central spike; androgynous panicle with male, mainly lateral spikes and female, central spike male at apex; cluster of male spikes and solitary female spike; or solitary male and female spikes. Flowers unisexual, anemophilous, rarely entomophilous. Male flowers subtended by an entire or 3-lobed bract; bracteoles 2 or absent; sepals 0-4, adnate to receptacle when present; stamens 3-40(-100), inserted on receptacle; filaments short to nearly absent, free or united at base; anthers glabrous or pubescent, 2-loculed, dehiscing longitudinally. Female flowers with an entire or 3-lobed bracts; bracteoles 2 or 3 (or absent); sepals 0-4, adnate to ovary, free at apex; gynoecium of 2 carpels united into an inferior ovary, 1-loculed, but at base 2-4(-8)-loculed; style 1, short or elongate, rarely absent; stigmas 2, carinal or commissural, sometimes 4-lobed, plumose or fleshy; ovule 1, orthotropous. Fruiting spike elongate, and pendulous or short and erect, rarely conelike. Fruit a drupelike nut, 2-4(-8)-chambered at base, with a dehiscent or indehiscent husk, or a 2- or 3-winged or disc-winged nutlet. Seed solitary, without endosperm. Cotyledons 4-lobed, much contorted. Germination hypogeal or epigeal. 2n = (28), 32, (64).",
      "Nine genera and 60 or more species: mostly in temperate and subtropical regions of the N hemisphere; seven genera (one endemic) and 20 species (seven endemic, one introduced) in China.\r",
      "Kuang Ko-zen & Lu An-ming. 1979. Juglandaceae. In: Kuang Ko-zen & Li Pei-chun, eds., Fl. Reipubl. Popularis Sin. 21: 6-44.",
      "Flowering spikes of both sexes erect; fruiting spike conelike, bracts persistent, overlapping; fruit a minute, 2-winged nutlet; leaves odd-pinnate",
      "Male flowering spikes pendulous, female spike erect; fruiting spike not conelike; bracts dispersed with nuts or nutlets; fruit a small, 2- or 3-winged nutlet or a medium to large, drupelike nut with a husk; leaves odd- or even-pinnate.",
      "Fruiting bract 3-lobed, expanded into membranous, pinnately veined wings subtending nutlet; lateral bracteoles fused, forming a small, anterior rim or well-developed prophyll; leaves even-pinnate",
      "Fruiting bract entire, inconspicuous; lateral bracteoles expanded into 2 small wings on nutlet, fused into disc wing, or fused with sepals to form husk; leaves odd-pinnate.",
      "Branchlets with solid pith; male spikes in clusters of 3 or 5-8; drupelike nuts with a 4-9-valved, dehiscent husk.",
      "Branchlets with chambered pith; male spikes solitary or in clusters of 3-5; disc- or 2-winged nutlets or drupelike nuts with an indehiscent or irregularly dehiscent husk.",
      "Leaflet margin entire; male spikes in clusters of 5-8; stamens 5-15; husk strongly keeled, splitting into 4-9 segments; nuts with attenuate apex",
      "Leaflet margin serrate; male spikes in clusters of 3; stamens 3-7; husk not keeled, occasionally with small flanges, splitting into 4 segments; nuts rarely with prominent, attenuate apex",
      "Fruit a large, drupelike nut, indehiscent or with an irregularly dehiscent husk; germination hypogeal; female spike usually less than 10-flowered, erect",
      "Fruit a small, winged nutlet, indehiscent; germination epigeal; female spike 10- to numerous flowered, pendulous.",
      "Annamocarya  A. ChevalierCarya  NuttallCyclocarya  IljinskayaEngelhardia  Leschenault ex BlumeJuglans  LinnaeusPlatycarya  Siebold & ZuccariniPterocarya  Kunth"
    ],
    "authors":"Anmin Lu, Donald E. Stone & L. J. Grauke"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Myricaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10594",
    "knowledge_content":[
      "Trees or shrubs, evergreen or deciduous, monoecious or dioecious, aromatic, often with resinous, peltate glands. Leaves alternate, simple, pinnately veined, entire to irregularly serrate or lobed, rarely pinnatifid; stipules absent or rarely present. Flowers in spikes, usually unisexual, anemophilous, without perianth. Male flowers solitary in axil of each bract, with 2-4 bracteoles or not. Stamens 2-20, often 4-8 on receptacle at base of bract; filaments short, free or slightly united at base; anthers erect, dithecal, extrorse, dehiscing longitudinally. Female flowers solitary or 2-4 in axil of bract, usually with 2-4 bracteoles. Gynoecium of 2 carpels united into a compound and 1-loculed ovary; styles distinct or united only at base; ovule solitary, basal, erect, orthotropous. Fruit drupaceous, or nearly a nutlet, often with headlike, wax-covered papillae; endocarp hard. Seeds nearly without endosperm; embryo straight; cotyledons fleshy, plano-convex.",
      "Three genera and ca. 50 species: widespread in both hemispheres, mostly in temperate or subtropical regions; one genus and four species (two endemic) in China.\r",
      "Kuang Ko-zen & Lu An-ming. 1979. Myricaceae. In: Kuang Ko-zen & Li Pei-chun, eds., Fl. Reipubl. Popularis Sin. 21: 1-6."
    ],
    "authors":"Anmin Lu & Allan J. Bornstein"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Pinaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10691",
    "knowledge_content":[
      "Trees or rarely shrubs, evergreen or deciduous, monoecious. Branchlets often dimorphic: long branchlets with clearly spirally arranged, sometimes scalelike leaves; short branchlets often reduced to slow growing lateral spurs bearing dense clusters of leaves at apex. Leaves solitary or in bundles of (1 or)2-5(-8) when basally subtended by a leaf sheath; leaf blade linear or needlelike, not decurrent. Cones unisexual. Pollen cones solitary or clustered, with numerous spirally arranged microsporophylls; microsporophyll with 2 microsporangia; pollen usually 2-saccate (nonsaccate in Cedrus, Larix, Pseudotsuga, and most species of Tsuga). Seed cones erect or pendulous, maturing in 1st, 2nd, or occasionally 3rd year, dehiscent or occasionally indehiscent, with many spirally arranged ovulate scales and bracts; ovulate scales usually smaller than bracts at pollination, with 2 upright ovules adaxially, free or only basally adnate with bracts, maturing into seed scales. Seed scales appressed, woody or leathery, variable in shape and size, with 2 seeds adaxially, persistent or deciduous after cone maturity. Bracts free or adnate basally with seed scales, well developed or rudimentary, exserted or included. Seeds terminally winged (except in some species of Pinus). Cotyledons 2-18. Germination hypogeal or epigeal. 2n = 24* (almost always).",
      "Ten or eleven genera and ca. 235 species: N hemisphere; ten genera (two endemic) and 108 species (43 endemic, 24 introduced) in China.Species of the Pinaceae are among the most valuable and commercially important plants in the world. Most species are trees, and are often excellent sources of lumber, wood products, and resins; many are cultivated for afforestation and as ornamentals.\r",
      "Cheng Wan-chün, Fu Li-kuo, Law Yu-wu, Fu Shu-hsia, Wang Wen-tsai, Chu Cheng-de, Chao Chi-son & Chen Chia-jui. 1978. Pinaceae. In: Cheng Wan-chün & Fu Li-kuo, eds., Fl. Reipubl. Popularis Sin. 7: 32-281.",
      "Leaves evergreen, needlelike, 2-5(-7) per bundle, terminal on very short branchlets, base enclosed by sheath; seed cones maturing in 2nd or 3rd year; seed scales woody, thickened, apex differentiated into apophysis and umbo",
      "Leaves evergreen or deciduous, linear or needlelike, spirally arranged or in a cluster at apex of short branchlets, not in bundles; seed cones maturing in 1st year (except in Cedrus); seed scales thin, woody or leathery, without apophysis and umbo.",
      "Lateral short branchlets absent, or poorly defined (in Cathaya), with leaves all solitary, never in bundles (though in Cathaya partly so dense as to appear bundled).",
      "Leaves evergreen, needlelike, usually triangular or ± quadrangular in cross section, stiff; seed cones maturing in 2nd(or 3rd) year",
      "Leaves deciduous, linear-needlelike or narrowly oblanceolate-linear, flattened, flexible; seed cones maturing in 1st year.",
      "Pollen cones solitary; seed scales thin, ± leathery, persistent after maturity; leaves ca. 1.8 mm wide",
      "Branchlets opposite, with orbicular leaf scars; seed cones erect; seed scales deciduous at maturity, with cone rachis persistent",
      "Branchlets irregularly alternate, leaf scars often elliptic or on peglike projections (pulvini); seed cones usually pendulous or erect; seed scales persistent at maturity.",
      "Seed cones erect; pollen cones terminally clustered on branchlets; seed and wing as long as seed scale",
      "Seed cones usually pendulous, occasionally erect; pollen cones solitary in leaf axils; seed and wing shorter than seed scale.",
      "Leaves not borne on peglike projections, leaving slightly raised, elliptic scars, grooved adaxially; bracts distinctly exserted, 3-lobed at apex",
      "Leaves borne on persistent, peglike projections (pulvinus), flattened or ± rhombic in cross section; bracts rudimentary, included.",
      "Leaves sessile, quadrangular, subflattened, or flattened in cross section; seed cones usually more than 4 cm (sometimes less than 4 cm in Picea purpurea)",
      "Leaves petiolate, flattened, rarely subquadrangular in cross section; seed cones usually 1.5-3.5 cm (to ca. 6 cm in Tsuga longibracteata)",
      "Abies  MillerCathaya  Chun & KuangCedrus  TrewKeteleeria  CarrièreLarix  MillerPicea  A. DietrichPinus  LinnaeusPseudolarix  GordonPseudotsuga  CarrièreTsuga  (Endlicher) Carrière"
    ],
    "authors":"Liguo Fu, Nan Li, Thomas S. Elias & Robert R. Mill"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Piperaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10692",
    "knowledge_content":[
      "Herbs, shrubs, or climbers, rarely trees, usually aromatic. Vascular bundles ±  scattered in transverse section in a monocotyledonlike manner. Tip of stem sometimes enclosed within a stipulelike sheath, the prophyll, sometimes adnate to petiole, absent in Peperomia. Leaves alternate, often opposite or whorled in Peperomia, simple, base often asymmetric, palmately or pinnately veined. Inflorescence a pedunculate spike, rarely grouped into an umbel, rarely a raceme (in Zippelia), leaf-opposed or axillary, rarely terminal. Flowers small, bisexual, hermaphroditic, polygamous or dioecious, nearly always sessile; bracts small, usually peltate or cupular, usually without perianth. Stamens 1-10; filaments usually free; anthers 2-locular, distinct or connate, longitudinally dehiscent. Gynoecium 2-5-carpellate, connate; ovary superior, 1-locular, ovule 1, orthotropous; stigmas 1-5, sessile or with very short styles. Fruit a small drupe or nutlet; pericarp fleshy, thin or dry, sometimes with sticky papillae (in Peperomia) or glochidiate spines (in Zippelia). Seeds with copious starchy perisperm and a minute embryo embedded in small endosperm.",
      "About eight or nine genera and 2000-3000 species: tropical and subtropical regions, mostly in North and South America, rather fewer in Asia, a few in Africa; three genera and 68 species (36 endemic, four introduced) in China.\r",
      "Chinese species of economic value include Peperomia blanda, P. tetraphylla (medicines), Piper hainanense, P. hancei, P. hongkongense, P. nigrum (spice, medicine), P. sarmentosum, P. wallichii, P. wangii, and P. yunnanense.Tseng Yung-chien, Chen Pei-shan & Zhu Pei-zhi. 1982. Piperaceae. In: Tseng Yung-chien, ed., Fl. Reipubl. Popularis Sin. 20(1): 11-78.",
      "Prophylls present, often adnate to petiole, leaving conspicuous scars around stem nodes; leaves alternate; stigmas 3-5, rarely 2",
      "Prophylls absent, without or scars at nodes; leaves often opposite or whorled in Chinese species; stigma 1, rarely 2-cleft"
    ],
    "authors":"Yung-chien Tseng, Nianhe Xia & Michael G. Gilbert"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Podocarpaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10713",
    "knowledge_content":[
      "Trees or shrubs evergreen, dioecious or rarely monoecious. Leaves decussate, subopposite, or spirally arranged; blade scalelike, subulate, or linear to elliptic, stomatal lines abaxial or present on all surfaces. Pollen cones terminal, solitary or clustered in leaf axils, or borne in spikelike complexes; individual cones pedunculate or sessile; microsporophylls numerous, spirally arranged, with distinct adaxial and abaxial surfaces; microsporangia 2; pollen 2(or 3)-saccate in Chinese species, (rarely nonsaccate). Seed-bearing structures terminal or axillary, solitary, occasionally spikelike, comprising few to several spirally arranged bracts; all or only apical bracts fertile, smooth or warty; basal bracts sometimes fused and succulent (together with peduncle) to form a \"receptacle,\" or obsolete; ovule (inverted) or inclined in Chinese species. Seed drupelike or nutlike, wholly or (in Dacrydium) partly enveloped in a sometimes colored and succulent epimatium derived from fertile ovulate scale. Cotyledons 2.",
      "Eighteen genera and ca. 180 species: tropical, subtropical, and S temperate zones, mainly in S hemisphere but extending to montane tropical Africa, Central America, and Japan; four genera and 12 species (three endemic) in China.\r",
      "Although strictly a flowering plant term, \"receptacle\" is used widely in Podocarpaceae literature, e.g., by Tomlinson (Int. J. Plant Sci. 153: 572-588. 1992). Spjut (Mem. New York Bot. Gard. 70: 21, 71-73. 1994) incorrectly used the term \"epimatium\" to denote the peduncle of Nageia and also the receptacle of Podocarpus and Dacrycarpus.",
      "Cheng Wan-chün, Fu Li-kuo & Chao Chi-son. 1978. Podocarpaceae. In: Cheng Wan-chün & Fu Li-kuo, eds., Fl. Reipubl. Popularis Sin. 7: 398-422.",
      "Leaves dimorphic: juvenile leaves needlelike or linear; adult leaves needlelike or scalelike, less than 5 mm.",
      "Leaves ± monomorphic: adult leaves neither needlelike nor scalelike, more than 5 mm; juvenile leaves similar to adult leaves in shape but often larger and\/or wider.",
      "Juvenile leaves 2-ranked, arranged in 1 plane (forming an oblong-ovate branchlet outline), linear, not scalelike; adult leaves needlelike or scalelike, falcate, 0.8-1.5 mm",
      "Juvenile leaves not 2-ranked, spreading, not arranged in 1 plane, linear to needlelike or subulate; adult leaves hard and scalelike, 2-5 mm",
      "Leaf blade without an obvious midvein but with many, slender, longitudinal veins dichotomous in basal region and converging toward apex",
      "Dacrycarpus  (Endlicher) de LaubenfelsDacrydium  Solander ex G. ForsterNageia  GaertnerPodocarpus  L’Heritier ex Persoon"
    ],
    "authors":"Liguo Fu, Yong Li & Robert R. Mill"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Salicaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10787",
    "knowledge_content":[
      "Trees or shrubs, deciduous or rarely evergreen, dioecious, rarely polygamous. Leaves alternate, rarely subopposite, usually petiolate, simple; stipules persistent or caducous. Catkins erect or pendulous; each flower usually with a cupular disc or 1 or 2(or 3) nectariferous glands. Male flowers with 2-many stamens; filaments filiform, free or united; to connate; anthers 2(or 4)-loculed, dehiscing longitudinally. Female flowers with 1 pistil, sessile or stipitate; ovary superior, 1- or 2-loculed; ovules several to many, anatropous, with a 1 integument; style 1, 2 in Chosenia; stigmas 2-4. Capsule dehiscing by 2-4(or 5) valves; placenta and inside wall of ovary with long hairs. Seeds 4-numerous, glabrous; hairs and seeds simultaneously deciduous when capsule matures.",
      "Three genera and about 620 species: mainly N hemisphere, a few in S hemisphere; three genera and 347 species (236 endemic) in China, including at least nine hybrids and at least one introduced species.\r",
      "Growth monopodial, buds with several outer scales, terminal bud present (except in Populus sect. Turanga); both male and female catkins pendulous; disc cupular; leaf blade usually 1-2 × as long as wide",
      "Growth sympodial, buds with 1 scale, terminal bud absent; female catkin erect or spreading, very rarely pendulous; flowers without disc but glands sometimes connate and discoid; leaf blade often at least several × as long as wide.",
      "Male catkin erect; nectariferous gland present; filaments usually distinct from bracts (fused in Salix sect. Urbanianae)"
    ],
    "authors":"Cheng-fu Fang, Shi-dong Zhao & Alexei K. Skvortsov"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Saururaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10799",
    "knowledge_content":[
      "Herbs perennial, aromatic. Stems erect, ascending, or prostrate, obviously jointed. Leaves alternate, simple; stipules interpetiolately connate or adnate to petiole, forming a sheath. Inflorescence a dense spike or raceme, sometimes resembling a single flower when large involucral petaloid bracts are present at base; bracts evident or inconspicuous. Flowers bisexual; perianth absent. Stamens usually 3, 6, or 8, free or adnate to ovary base; anthers 2-loculed, longitudinally dehiscent. Pistils (2 or)3- or 4-carpelled; carpels distinct or connate, if distinct: each carpel with 2-4 ovules, if connate: ovary 1-loculed, placentation parietal, each placenta with 6-13 ovules; styles free. Fruit a schizocarp or apically dehiscent capsule. Seed 1 or many; endosperm scanty; perisperm abundant; embryo minute.",
      "Four genera and ca. six species: E and S Asia, North America; three genera and four species (one endemic) in China.\r",
      "Saururaceous taxa have been extensively compared in studies of floral vasculature (H. X. Liang & S. C. Tucker, Amer. J. Bot. 77: 607-623. 1990), organogenesis (H. X. Liang, Acta Phytotax. Sin. 32: 425-432. 1994), pollen morphology (H. X. Liang, Acta Bot. Yunnan. 14: 401-404. 1992), and stem anatomy (S. Carlquist & al., I. A. W. A. Bull, n.s., 16(2): 133-150. 1995). Phylogenetic relationships of Saururaceae and its sister clade Piperaceae have been discussed by S. C. Tucker, (Syst. Bot. 18: 614-641. 1993).Tseng Yung-chien. 1982. Saururaceae. In: Tseng Yung-chien, ed., Fl. Reipubl. Popularis Sin. 20(1): 4-11.",
      "Herbs prostrate, ± stoloniferous; stamens shorter than styles; petioles nearly as long as or longer than leaf blades",
      "Herbs erect or ascending, rhizomatous; stamens longer than styles; petioles shorter than leaf blades.",
      "Inflorescence a raceme, without involucral petal-like bracts; stamens 6 or 8, rarely 3, filaments ca. as long as or slightly longer than anthers; fruit a schizocarp; leaf blade ovate to ovate-lanceolate",
      "Inflorescence a dense spike, with 4 rarely 6 or 8, involucral petal-like bracts at base; stamens 3, rarely 4, filaments ca. 3 × as long as anthers; fruit a dehiscent capsule; leaf blade broadly ovate or ovate-cordate"
    ],
    "authors":"Nianhe Xia & Anthony R. Brach"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Sciadopityaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20001",
    "knowledge_content":[
      "Trees evergreen, monoecious; branches short, spreading. Leaves dimorphic: scalelike leaves scattered on branchlets or clustered at apex of branchlets, small; connate leaves formed by the complete fusion of two leaves, arising from the axils of scalelike leaves and spreading radially at apex of branchlets, linear, flat, leathery, with a deep furrow both adaxially and abaxially. Pollen cones clustered at apex of branches; microsporophylls numerous, spirally arranged. Seed cones ripening in 2nd year, terminal, shortly pedunculate, with numerous, spirally arranged cone scales; bracts nearly enclosed by cone scales. Seeds 5-9 per scale, ovoid, with a narrow wing. Cotyledons 2. 2n = 20.",
      "Chen Chia-jui & Tsui Hung-pin. 1978. Sciadopitys. In: Cheng Wan-chün & Fu Li-kuo, eds., Fl. Reipubl. Popularis Sin. 7: 283-284."
    ],
    "authors":"Liguo Fu, Yong-fu Yu & Aljos Farjon"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Taxaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10871",
    "knowledge_content":[
      "Trees or shrubs evergreen, dioecious or rarely monoecious. Leaves spirally arranged or decussate, linear or lanceolate, abaxial surface with 1 stomatal band on each side of prominent or inconspicuous midvein, resin canal present or absent. Pollen cones solitary in leaf or bract axils, or aggregated into spikelike complexes apically on branches; microsporophylls numerous; pollen sacs 3-9, radially arranged or on outer side of microsporophyll and then with distinct adaxial and abaxial surfaces; pollen nonsaccate. Seed-bearing structures solitary or paired in axils of leaves or bracts, pedunculate or sessile, with several overlapping or decussate bracts at base; ovule solitary, borne at apex of floral axis, erect. Seed sessile or pedunculate, drupelike or nutlike, partially enclosed in a succulent, saccate or cupular aril, or completely enclosed within aril; female gametophyte tissue abundant. Cotyledons 2. Germination epigeal, hypogeal in Torreya.",
      "Five genera and 21 species; mainly N hemisphere (except Austrotaxus R. H. Compton: New Caledonia); four genera (one endemic) and 11 species (five endemic, one introduced) in China.\r",
      "Cheng Wan-chün, Fu Li-kuo & Chu Cheng-de. 1978. Taxaceae. In: Cheng Wan-chün & Fu Li-kuo, eds., Fl. Reipubl. Popularis Sin. 7: 437-467.",
      "Leaves with midvein ± inconspicuous adaxially; pollen sacs borne on outer side of microsporophylls, with distinct adaxial and abaxial surfaces; seed-bearing structures paired in leaf axils, sessile; seed completely enclosed within aril",
      "Leaves with midvein prominent adaxially; axillary; pollen sacs various; seed-bearing structures solitary in axils of leaves or bracts, shortly pedunculate or subsessile; seed surrounded by a cupular or saccate aril, but with distal part exposed.",
      "Leaves decussate, with resin canal; pollen cones arranged in terminal (very rarely lateral) spikes; seed-bearing structures long pedunculate; aril saccate, almost completely enclosing seed except for extreme apex",
      "Leaves spirally arranged, sessile, without resin canal; pollen cones solitary in leaf axils, not forming spikes; seed-bearing structures shortly pedunculate or subsessile; aril cupular, enclosing only proximal part of seed.",
      "Branchlets irregularly alternate; abaxial stomatal bands of leaves pale yellow or pale grayish green; aril of seed red when ripe",
      "Branchlets subopposite or subwhorled; abaxial stomatal bands of leaves white powdery; aril of seed white when ripe"
    ],
    "authors":"Liguo Fu, Nan Li & Robert R. Mill"
  },
  {
    "group_title":"Cycadaceae through Fagaceae",
    "family":"Taxodiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10872",
    "knowledge_content":[
      "Trees evergreen, semievergreen, or deciduous, monoecious; trunk straight; main branches ±  whorled. Leaves spirally arranged or scattered (decussate in Metasequoia), monomorphic, dimorphic, or trimorphic on same tree, lanceolate, subulate, scalelike, or linear. Microsporophylls and cone scales spirally arranged (decussate in Metasequoia). Pollen cones borne in panicles, or solitary or clustered at branch apices, or axillary, small; microsporangia with (2 or)3 or 4(-9) pollen sacs; pollen nonsaccate. Seed cones terminal or borne near apex of previous year’s growth, ripening in 1st year, persistent or late deciduous; cone scales developing after ovules originate in bract axils; bracts and cone scales usually spirally aranged (decussate in Metasequoia), sessile, opening when ripe (falling in Taxodium), semiconnate and free only at apex, or completely united; bracts occasionally rudimentary (in Taiwania); ovules 2-9 per bract axil, erect or pendulous; cone scales of mature cones flattened or shield-shaped, woody or leathery, 2-9-seeded on abaxial side. Seeds flat or triangular, wingless (in Taxodium), narrowly winged all round or on 2 sides, or with a long wing on proximal part. Cotyledons 2-9. 2n = 22*.",
      "Nine genera and 12 species: Asia, North America, and (Athrotaxis D. Don) Tasmania; eight genera (one endemic, three introduced) and nine species (one endemic, four introduced) in China.\r",
      "A merger of the Taxodiaceae and Cupressaceae is increasingly supported by both morphological and molecular evidence (see note under Cupressaceae). However, the two groups are kept as separate families here for pragmatic reasons. Tsui Hung-pin, Cheng Wan-chün, Fu Li-kuo & Chao Chi-son. 1978. Taxodiaceae. In: Cheng Wan-chün & Fu Li-kuo, eds., Fl. Reipubl. Popularis Sin. 7: 281-312.",
      "Leaves and cone scales decussate (but leaves spirally arranged on leading branchlets); lateral branchlets deciduous; cone scales shieldlike, woody, 5-9-seeded (when fertile); seeds compressed, winged all round",
      "Leaves and cone scales spirally arranged (but leaves often appearing falsely 2-ranked or alternate); other characters various.",
      "Deciduous or semievergreen; fertile cone scales 2-seeded; seeds irregularly triquetrous or slightly flattened.",
      "Deciduous or semievergreen; pollen cones borne in pendulous racemes or panicles; seeds irregularly triquetrous, large, wingless",
      "Semievergreen; pollen cones borne on short, erect branchlets; seeds elliptic, slightly flattened, small, with a single, terminal, recurved wing",
      "Leaves subulate; seed cones sessile; umbo of cone scales with a central spine and 4 or 5(-7) toothlike projections",
      "Leaves all scalelike, or scalelike on main branchlets and linear on lateral branchlets; seed cones pedunculate; umbo of cone scales without spines or projections.",
      "Leaves scalelike on main branchlets and linear on lateral branchlets; seed cones with 15-20 cone scales, ripening in 1st year",
      "Cryptomeria  D. DonCunninghamia  R. Brown ex Richard & A. RichardGlyptostrobus  EndlicherMetasequoia  Hu & W. C. ChengSequoia  EndlicherSequoiadendron  J. BuchholzTaiwania  HayataTaxodium  Richard"
    ],
    "authors":"Liguo Fu, Yong-fu Yu & Robert R. Mill"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Aizoaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10020",
    "knowledge_content":[
      "Herbs, annual or perennial, subshrubs, or shrubs, succulent. Stems erect or prostrate. Leaves simple, rarely pinnate, mostly opposite, sometimes alternate, in many species fleshy, margin entire, rarely with teeth; true stipules absent, sometimes a stipule-like sheath present at base of petiole. Inflorescences terminal or seemingly axillary cymes, or solitary flowers. Flowers bisexual, rarely unisexual, actinomorphic, perigynous or epigynous. Nectaries separate or in a ring around ovary. Tepals (4 or)5(–8), connate below into a tube. Petals absent or present. Stamens 3 to many, free or connate at base, outermost often as filamentous staminodes; anthers dehiscing by longitudinal slits. Ovary inferior, syncarpous; carpels 2 to many; ovules 1 to many, on long funicles, mostly campylotropous; placentation axile or parietal, sometimes basal-parietal. Stigmas as many as carpels. Fruit a hygroscopic or circumscissile capsule, more rarely a berry or nut. Seeds with slender embryo curved around perisperm, rarely with an aril; endosperm scanty or absent.\r",
      "About 135 genera and 1800 species: mainly in arid, subtropical regions, most species in S Africa, some in Australia and W parts of the Americas, some pantropical; three genera and three species in China.",
      "The family is divided into five subfamilies, of which two, Sesuvioideae and Tetragonioideae, are represented by native species in China.Many members of the subfamilies Mesembryanthemoideae and Ruschioideae are ornamentals and are in cultivation worldwide. Until the early 20th century, these were nearly all included in the genus Mesembryanthemum. Since then, the majority of the members of that genus has been placed in a great number of smaller genera. Five species have been recorded as cultivated in China: Aptenia cordifolia (Linnaeus f.) Schwantes, Carpobrotus edulis (Linnaeus) L. Bolus, Glottiphyllum longum (Haworth) N. E. Brown, Lampranthus spectabilis (Haworth) N. E. Brown, and Mesembryanthemum crystallinum Linnaeus. Further species are likely to be introduced into China.Tetragonia, together with the genus Tetragonocarpus, is sometimes treated as an independent family, the Tetragoniaceae. Sesuvium and Trianthema, together with Cypselea Turpin and Zaleya N. L. Burman, are sometimes treated as a separate family, the Sesuviaceae.",
      "Lu Dequan. 1996. Aizoaceae (Sesuvium–Tetragonia). In: Tang Changlin, ed., Fl. Reipubl. Popularis Sin. 26: 30–36."
    ],
    "authors":"Dequan Lu & Heidrun E. K. Hartmann"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Amaranthaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10031",
    "knowledge_content":[
      "Herbs, clambering subshrubs, shrubs, or lianas. Leaves alternate or opposite, entire, exstipulate. Flowers small, bisexual or unisexual, or sterile and reduced, subtended by 1 membranous bract and 2 bracteoles, solitary or aggregated in cymes. Inflorescences elongated or condensed spikes (heads), racemes, or thyrsoid structures of varying complexity. Bracteoles membranous or scarious. Tepals 3-5, membranous, scarious or subleathery, 1-, 3-, 5-, or 7(-23)-veined. Stamens as many as tepals and opposite these, rarely fewer than tepals; filaments free, united into a cup at base or ± entirely into a tube, filament lobes present or absent, pseudostaminodes present or absent; anthers (1- or)2-loculed, dorsifixed, introrsely dehiscent. Ovary superior, 1-loculed; ovules 1 to many; style persistent, short and indistinct or long and slender; stigma capitate, penicillate, 2-lobed or forming 2 filiform branches. Fruit a dry utricle or a fleshy capsule, indehiscent, irregularly bursting, or circumscissile. Seeds lenticular, reniform, subglobose, or shortly cylindric, smooth or verruculose.\r",
      "About 70 genera and 900 species: worldwide; 15 genera (one introduced) and 44 species (three endemic, 14 introduced) in China.",
      "Morphology of the androecium, perianth (tepals), and the inflorescence has traditionally been used to circumscribe genera and tribes. Pseudostaminodia are interstaminal appendages with variously shaped apices. Filament appendages are the lateral appendages of filaments (one on each side). The basic structure of the inflorescence is the cyme (branchlets arising from the bracteole axils, the bracteoles serving as bracts for upper flowers), which can be reduced to one flower with two bracteoles and a bract. Units of dispersal vary considerably (capsules opening with lower part persistent, flower and bracteoles falling together, or cymose partial inflorescences breaking off above bract) and can be characteristic for genera. Several genera possess long trichomes serving dispersal at the base of the tepals.Digera arvensis Forsskål (Fl. Aegypt.-Arab. 65. 1775) has been reported from Anhui. However, we have seen no specimens and are therefore unable to treat it in this account.",
      "Kuan Ke-chien. 1979. Amaranthaceae. In: Kung Hsien-wu & Tsien Cho-po, eds., Fl. Reipubl. Popularis Sin. 25(2): 194–241."
    ],
    "authors":"Bojian Bao, Thomas Borsch & Steven E. Clemants"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Aristolochiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10063",
    "knowledge_content":[
      "Herbs, shrubs, rarely lianas, subshrubs, or trees; root, stems, and leaves with oil cells. Leaves alternate; stipules absent; petiole usually present and well defined; leaf blade simple, usually pinnately veined, sometimes palmately 3-5-veined, margin usually entire, rarely 3-5-lobed. Inflorescences terminal or axillary, racemes, cymes, or corymbs, or flowers solitary. Flowers bisexual, zygomorphic or actinomorphic. Perianth usually with 1 petaloid whorl (in Saruma with 2 whorls: outer one sepaloid, inner one petaloid), mostly connate into distinct tube, cylindric to campanulate or subglobose; limb rotate, urceolate, cylindric, or ligulate, 1-3-lobed; lobes valvate. Stamens 6-12 (in China), in 1 or 2 series; filaments adnate to ovary (in Asarum) or style column (in Thottea) with anthers free, or filaments and anthers fully adnate to style column to form gynostemium (in Aristolochia); anthers 2-loculed, dehiscence longitudinal. Ovary inferior to superior, 6-loculed (in Thottea 4-loculed); carpels connate only at base or fully fused; ovules numerous, anatropous, usually in 1 or 2 series; placentation parietal. Styles free or connate, column 3- or 6-lobed (in Thottea 5-20-lobed). Fruit a fleshy or dry capsule, rarely siliquiform or follicular. Seeds many; testa somewhat hard or crustaceous; endosperm copious, fleshy; embryo minute.\r",
      "About eight genera and 450–600 species: primarily in tropical and subtropical regions; four genera (one endemic) and 86 species (69 endemic) in China.",
      "Cheng Ching-yung, Yang Chun-shu & Hwang Shu-mei. 1988. Aristolochiaceae. In: Kiu Hua-shing & Ling Yeou-ruenn, eds., Fl. Reipubl. Popularis Sin. 24: 159–245.",
      "Ovary 4-loculed; fruit siliquiform; stems erect; stamens 8-9 in 1 series [6-36(-46) in 1 or 2 series].",
      "Ovary 6-loculed; fruit subglobose to cylindric capsules; stems usually climbing or twining; stamens usually 6 in 1 series or 12 in 2 series.",
      "Perianth actinomorphic; stamens usually 12 in 2 series; stems herbaceous, rhizomatous; fruit fleshy or spongy capsules; flowers terminal, solitary.",
      "Perianth zygomorphic; stamens 6 in 1 series; stems woody or herbaceous, usually climbing or twining; fruit dry capsules; flowers axillary, solitary, fasciculate, or arranged in inflorescences."
    ],
    "authors":"Shumei Huang, Lawrence M. Kelly & Michael G. Gilbert"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Balanophoraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10089",
    "knowledge_content":[
      "Herbs, monoecious or dioecious, fleshy, parasitic on roots or rhizomes of various hosts. Rhizome usually branched, usually with scales or warts and\/or lenticels. Flowering shoots endogenously arising from rhizome; scapes with or without leaves, unbranched. Leaves scaly, opposite or alternate and distichous or spiraled, sometimes whorled, rarely contorted or clustered, without stomata. Inflorescences unisexual or androgynous, terminal, spadix or spadixlike structure covered with minute branches; branches frequently subtended by variously modified bract. Flowers unisexual, pedicellate or sessile. Male flowers: larger than female flowers, 3(or 4 or more)-merous. Perianth apically lobed or dentate, sometimes absent; lobes valvate. Stamens 1 or 2 when perianth absent or usually as numerous as and opposite to perianth lobes when perianth present; filaments free or connate into a synandrium; anthers free or connate, 2-loculed or more, dehiscent by slits. Female flowers: congested on branches or basally on spadicles and\/or shoot axis. Perianth absent or reduced and 2- to irregularly lobed, adnate to ovary. Ovary inferior. styles 1 or 2; stigmas slightly capitellate. Fruit a 1-seeded achene.\r",
      "Eighteen genera and ca. 50 species: primarily in tropical and subtropical regions; two genera and 13 species (one endemic) in China.",
      "Tam Pui-cheung. 1988. Balanophoraceae. In: Kiu Hua-shing & Ling Yeou-ruenn, eds., Fl. Reipubl. Popularis Sin. 24: 250–268.",
      "Styles 2; flowering shoot leafless or leaves scale-like and indistinct; inflorescences covered by peltate scales; rhizome containing starch.",
      "Style 1; flowering shoot bearing distinct leaves; inflorescences without peltate scales; rhizome containing wax (balanophorin)."
    ],
    "authors":"Shumei Huang & Jin Murata"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Basellaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10096",
    "knowledge_content":[
      "Vines herbaceous or herbs twining, usually fleshy, glabrous. Leaves simple, alternate, usually petiolate, margin entire. Inflorescences of spikes, racemes, or panicles; bracts 3, caducous; bracteoles 2, persistent. Flowers bisexual, actinomorphic, small. Perianth segments 5, white or reddish, distinct or connate at base, imbricate in bud, persistent in fruit. Stamens 5, opposite to petals; filaments inserted on perianth. Ovary superior, 1-loculed; ovule 1, basal, campylotropous. Pistil united from 3 carpels. Style simple with 3 stigmas or 3 free styles. Fruit a utricle, dry or fleshy, often surrounded by persistent bracteoles and perianth. Seed globular; testa membranous; endosperm copious; embryo spirally twisted or semicircular to horseshoe-shaped.\r",
      "Four genera and 25 species: tropics and subtropics, mostly in the Americas; two genera (introduced) and three species in China.",
      "Flowers pedicellate; perianth segments membranous, spreading-rotate at anthesis; filaments reflexed in bud."
    ],
    "authors":"Dequan Lu & Michael G. Gilbert"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Cannabaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10154",
    "knowledge_content":[
      "Herbs, annual or perennial, erect or twining, dioecious or sometimes monoecious, often with cystoliths (a hard calcium carbonate structure at base of a hair). Stems furrowed or winged. Stipules free. Leaves alternate or opposite, palmately lobed or compound, sometimes simple. Male inflorescences a bracteate cymose panicle. Male flowers: pedicellate; sepals 5, free; petals absent; stamens 5, opposite sepals; filaments short; anthers 2-loculed, dehiscent by longitudinal slits. Female inflorescences a bracteate spicate cyme much reduced in Cannabis, pendent or erect. Female flowers: sessile; calyx appressed to ovary, membranous; petals absent; ovary 1-loculed; ovule solitary, pendulous from locule apex; style 2-parted, branches filiform. Fruit an achene, covered by persistent calyx; endosperm fleshy; embryo curved or spirally involute.\r",
      "Two genera and four species: N Africa, Asia, Europe, North America; two genera and four species (one endemic) in China.",
      "Because all the Chinese species in this family are cultivated and are often found naturalized in disturbed habitats, it is difficult to know the true wild distributions.Cannabaceae has sometimes been included in Moraceae or Urticaceae but is now usually recognized as a distinct family. The subfamily Celtidoideae of Ulmaceae could possibly be included within Cannabaceae (see the discussion after the Ulmaceae family description).",
      "Chang Siushih. 1998. Cannaboideae. In: Chang Siushih & Wu Chengyih, eds., Fl. Reipubl. Popularis Sin. 23(1): 220–224.",
      "Plants twining; stem with 6 ridges or wings; leaves opposite, palmately lobed or sometimes simple; stems, branchlets, and petioles with rigid 2-armed stalked hairs; female inflorescences pendent, conelike.",
      "Plants erect; stems furrowed but without 6 ridges or wings; leaves alternate or opposite on basal parts of plants, pinnately compound; stems, branchlets, and petioles scabrous but without rigid 2-armed stalked hairs; female inflorescences erect, not conelike."
    ],
    "authors":"Zhengyi Wu, Zhe-Kun Zhou & Bruce Bartholomew"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Chenopodiaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10185",
    "knowledge_content":[
      "Herbs annual, subshrubs, or shrubs, rarely perennial herbs or small trees. Stems and branches sometimes jointed (articulate); indumentum of vesicular hairs (furfuraceous or farinose), ramified (dendroid), stellate, rarely of glandular hairs, or plants glabrous. Leaves alternate or opposite, exstipulate, petiolate or sessile; leaf blade flattened, terete, semiterete, or in some species reduced to scales. Flowers monochlamydeous, bisexual or unisexual (plants monoecious or dioecious, rarely polygamous); bracteate or ebracteate. Bractlets (if present) 1 or 2, lanceolate, navicular, or scale-like. Perianth membranous, herbaceous, or succulent, (1-)3-5-parted; segments imbricate, rarely in 2 series, often enlarged and hardened in fruit, or with winged, acicular, or tuberculate appendages abaxially, seldom unmodified (in tribe Atripliceae female flowers without or with poorly developed perianth borne between 2 specialized bracts or at base of a bract). Stamens shorter than or equaling perianth segments and arranged opposite them; filaments subulate or linear, united at base and usually forming a hypogynous disk, sometimes with interstaminal lobes; anthers dorsifixed, incumbent in bud, 2-locular, extrorse, or dehiscent by lateral, longitudinal slits, obtuse or appendaged at apex. Ovary superior, ovoid or globose, of 2-5 carpels, unilocular; ovule 1, campylotropous; style terminal, usually short, with 2(-5) filiform or subulate stigmas, rarely capitate, papillose, or hairy on one side or throughout. Fruit a utricle, rarely a pyxidium (dehiscent capsule); pericarp membranous, leathery, or fleshy, adnate or appressed to seed. Seed horizontal, vertical, or oblique, compressed globose, lenticular, reniform, or obliquely ovoid; testa crustaceous, leathery, membranous, or succulent; embryo annular, semi-annular, or spiral, with narrow cotyledons; endosperm much reduced or absent; perisperm abundant or absent.\r",
      "Probably about 100 genera and 1400 species (depending on taxonomic opinions): mainly in arid areas, deserts, and coastal and saline habitats of N and S Africa, Asia, Australia, Europe, and North and South America; 42 genera (two endemic, two introduced) and 190 species (21 endemic, six introduced) in China.",
      "Many species of Chenopodiaceae are adapted to, and are major components of, arid or ruderal environments. They are often intimately involved with the daily life of people. For example, Beta vulgaris is one of the most important sources for sugar; Chenopodium quinoa is a new high-protein crop; Spinacia oleracea and Beta vulgaris are excellent vegetables; Dysphania ambrosioides and Salsola collina are used medicinally; seeds of Agriophyllum squarrosum are called “sand-rice” locally and are edible; seeds of Corispermum declinatum are used for making gin; the ash of Halogeton arachnoideus and some species of Salsola contains soda which is used in noodle-making; and Anabasis aphylla can be used as an insecticide. Many species are important as animal forage in desert, semidesert, and steppe regions, and some species make good windbreaks and soil binders. Haloxylon ammodendron has been used extensively in biological reconditioning of the desert.",
      "Kung Hsien-wu, Chu Ge-lin, C. P. Tsien Cho-po, Ma Cheng-gung & Li An-jen. 1979. Chenopodiaceae. In: Kung Hsien-wu & C. P. Tsien Cho-po, eds., Fl. Reipubl. Popularis Sin. 25(2): 1–194.",
      "Bractlets rudimentary, membranous, scale-like, hidden by perianth; stigmas papillose or hairy throughout; embryo planospiral.",
      "Bractlets developed, herbaceous or succulent, navicular or similar to leaves, surrounding perianth (in Sympegma bractlets absent, but flowers fascicled at apex of branchlets); stigmas papillose only adaxially; embryo conic-spiral rarely planospiral (in tribe Salsoleae).",
      "Flowers unisexual; perianth of female flowers pellucid-membranous, lobed at apex, enlarged, incrassate, and berrylike in fruit; perianth segments of male flower spreading, caducous; anther 0.6-0.7 mm.",
      "Perianth segments connate into a tube, with 5 membranous teeth at apex; perianth adaxially with an acicular appendage adnate to it in fruit; axil of bractlets with a fascicle of villous hairs.",
      "Perianth segments not connate into a tube, without an acicular appendage; axil of bractlets glabrous or ± hairy, but hairs not fascicular.",
      "Perianth segments connate, hardening and forming an urceolate body in fruit; anther appendage inflated and bladderlike.",
      "Perianth segments free, proximally becoming leathery and adaxially concave in fruit; anther appendage thick, not inflated and bladderlike, with 3 teeth.",
      "Subshrubs, or woody stems specialized into tuberous caudex, or absent; anthers without appendage; leaves obtuse or acute at apex, sometimes with blunt spines.",
      "Shrubs or small trees; flowers emerging from lateral, dwarf branches on second year's growth; perianth membranous, with a winged appendage in fruit; utricle slightly concave; disk inconspicuous.",
      "Subshrubs; flowers emerging from annual branches; perianth slightly succulent, with a rudimentary winged appendage; disk conspicuous.",
      "Perianth free from ovary, not enlarged, incrassate, or hardened in fruit (in tribe Atripliceae ovary is attached to 2 specialized bractlets).",
      "Flowers borne in axil of succulent bracts, appearing sunken into rachis; leaves reduced to scales or succulent-tuberculate, decurrent if terete.",
      "Shrubs or subshrubs; bracts of female flowers united below middle, forming a tube, with 4 fascicles of villous hairs (with only ramified hairs in Krascheninnikovia compacta).",
      "Herbs annual; bracts of female flowers connate to apex, both sides with an acicular appendage near apex.",
      "Perianth segments 1-3, white, membranous; utricles exposed, compressed, with 2-fid beak at apex; plant body ± covered with ramified hairs.",
      "Perianth (3 to)5-parted, succulent or herbaceous; utricles flattened, rarely only compressed, without beak; plant body without ramified hairs.",
      "Utricles convex on both sides; rostra nearly equal to length of kernel; seed free from pericarp; leaves and bracts acicular to spinulose at apex.",
      "Utricles convex abaxially, plane or slightly concave adaxially; rostra 1\/8-1\/5 length of kernel; seed adherent to pericarp; leaves and bracts acute but not acicular at apex.",
      "Plants covered with glandular hairs (subglabrous in Dysphania aristata, but then terminal inflorescence branches without flowers, ending with acute setae).",
      "Plants covered with vesicular hairs (furfuraceous), occasionally glabrous (but then terminal inflorescence branches bearing flowers).",
      "Perianth adnate to utricle, densely villous, resembling a woolly ball; seed horizontal (vertical in bisexual flowers); stigmas smooth; anthers yellow, ca. 0.7 mm.",
      "Perianth free from utricle, villous but not resembling a woolly ball; seed vertical; stigmas papillose; anthers usually purplish red, ca. 1.5 mm."
    ],
    "authors":"Gelin Zhu, Sergei L. Mosyakin & Steven E. Clemants"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Loranthaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10520",
    "knowledge_content":[
      "Shrubs, usually aerial hemiparasites on other seed plants, often spreading along host by runners (epicortical roots), more rarely terrestrial root-parasitic shrubs or trees, nodes not articulated, glabrous or hairy, hairs often stellate or verticillate. Leaves opposite or alternate, stipules absent; petiole often indistinct; leaf blade simple, usually pinnately veined, margin entire. Inflorescences terminal or axillary, racemes, spikes, or umbels (sometimes condensed into heads); bracts usually inconspicuous, sometimes forming conspicuous involucre (in Tolypanthus). Flowers usually bisexual, rarely unisexual (plants dioecious), 4-6-merous, actinomorphic or zygomorphic, often conspicuous. Calyx adnate to the ovary, limb annular to cupular, entire or shortly toothed, persistent. Petals usually 4-6, free or connate, valvate. Disk usually inconspicuous to ± absent. Stamens as many as petals, opposite and adnate to them; anthers mostly basifixed, sometimes dorsifixed, 2-4-loculed, dehiscence longitudinal, locules sometimes with many transverse divisions so as to be multilocellate. Pollen oblate or suboblate, usually trilobate, or triangular. Ovary inferior, 1- or 3- or 4-loculed, without true ovules, embryo sacs originating from a central column or at the ovary base, integument absent. Style simple; stigma small. Fruit a berry (rarely a drupe or capsule), with a viscin layer (sticky mucilaginous tissue) outside the vascular bundles. Seed 1; testa absent; endosperm copious; embryo large.\r",
      "Between 60 and 68 genera and 700–950 species: primarily in tropical and subtropical regions; eight genera and 51 species (18 endemic) in China.",
      "Some species, including Macrosolen cochinchinensis, Scurrula parasitica, and several species of Taxillus, are used medicinally. Some species, particularly Scurrula parasitica and related species, can be troublesome parasites of fruit trees and other cultivated woody plants.",
      "Kiu Hua-shing. 1988. Loranthoideae. In: Kiu Hua-shing & Ling Yeou-ruenn, eds., Fl. Reipubl. Popularis Sin. 24: 87–139.",
      "Each flower subtended by 1 bract and 2 bracteoles; flowers 6-merous, corolla lobes connate more than 1\/2 length; ovary incompletely 3-loculed.",
      "Each flower subtended by 1 bract; flowers 4-6-merous, if 6-merous then corolla lobes free; ovary 1-loculed.",
      "Bract not keeled; bracteoles often connate; inflorescences of short racemes or spikes, rarely umbels.",
      "Corolla lobes connate into tube, often split on 1 side; inflorescences of umbels, racemes, or spikes.",
      "Flowers sessile, 5- or 6-merous; corolla greenish, yellowish, or white, 1.5-3.5(-5) mm; anthers ovoid or biglobose, sometimes absent.",
      "Flowers sessile or pedicellate, 4-6-merous; corolla red, pink, orange, or yellowish, (3-)5-12 mm; anthers ellipsoid.",
      "Dendrophthoe  MartiusElytranthe  (Blume) BlumeHelixanthera  LoureiroLoranthus  JacquinMacrosolen  (Blume) BlumeScurrula  LinnaeusTaxillus  TieghemTolypanthus  (Blume) Blume"
    ],
    "authors":"Huaxing Qiu & Michael G. Gilbert"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Molluginaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=20193",
    "knowledge_content":[
      "Herbs annual or perennial, subshrubs, or shrubs, rarely dioecious, glabrous or rarely hairy. Stems erect or prostrate. Leaves simple, alternate, rarely opposite, often in a basal rosette or in pseudowhorls on stems, margin entire; stipules absent or membranous. Inflorescences terminal or in seemingly axillary cymes, rarely as a solitary flower. Flowers bisexual, rarely unisexual, actinomorphic, hypogynous, rarely perigynous. Tepals 5, rarely 4, free or connate below into a tube, lobes white or pink to purple, sometimes yellow inside (in Glinus). Petals absent or few to many, white, pink, or purple. Stamens 3-5 or many, arranged in several rings, free or connate at base in bundles; anthers dehiscing by longitudinal slits. Ovary superior, syncarpous (in Gisekia developmentally syncarpous; fruit a deeply lobed schizocarp); carpels 2-5 or many, placentation axile, rarely seemingly basal. Stigmas as many as locules. Ovules 1 to many per locule. Fruit usually a loculicidal capsule or deeply (3-)5-15-lobed mericarps (in Gisekia), rarely breaking into 2 nutlets [in Limeum Linnaeus, not in Flora area]. Seeds with embryo curved around a hard, starchy perisperm.\r",
      "About 14 genera and 120 species: arid, tropical and subtropical regions of both hemispheres; three genera and eight species in China.",
      "The relationships of the anomalous genus Gisekia are uncertain. In the past, Gisekia has been included in Aizoaceae, often together with Molluginaceae. Recent treatments offer either a placement in Phytolaccaceae (e.g., Rohwer in Kubitzki, Fam. Gen. Fl. Pl. 2: 511, 514. 1993) or in a family of its own, Gisekiaceae (e.g., Gilbert, Kew Bull. 48: 343–356. 1993); one of us (Hartmann) favors either option. The mericarpic fruit separates the genus from Aizoaceae and Molluginaceae, from which it differs also by the presence of betalain and the absence of anthocyanin as pigments. No currently accepted plant family contains both anthocyanin and betalain producers.",
      "Lu Dequan. 1996. Aizoaceae (Gisekia–Mollugo). In: Tang Changlin, ed., Fl. Reipubl. Popularis Sin. 26: 20–30."
    ],
    "authors":"Dequan Lu & Heidrun E. K. Hartmann"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Moraceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10583",
    "knowledge_content":[
      "Trees, shrubs, vines, or rarely herbs, frequently with milky or watery latex, sometimes spiny. Stipules present, frequently caducous. Leaves alternate, rarely opposite; petiole often present and well-defined; leaf blade simple, sometimes with cystoliths, margin entire or palmately lobed, venation pinnate or palmate. Inflorescences axillary, frequently paired, racemose, spicate, capitate, or rarely cymose, sometimes a fig or syconium with flowers completely enclosed within a hollow receptacle. Flowers unisexual (plants monoecious or dioecious), small to very small. Calyx lobes (1 or)2-4(-8), free or connate, imbricate or valvate. Corolla absent. Male flowers: stamens as many as and opposite to calyx lobes (except in Artocarpus), straight or inflexed in bud; anthers 1- or 2-loculed, crescent-shaped to top-shaped; pistillode (rudimentary sterile pistil) often present. Female flowers: calyx lobes usually 4; ovary superior, semi-inferior, or inferior, 1(or 2)-loculed; ovules 1 per locule, anatropous or campylotropous; style branches 1 or 2; stigmas usually filiform. Fruit usually a drupe, rarely an achene, enveloped by an enlarged calyx and\/or immersed in a fleshy receptacle, often joined into a syncarp. Seed solitary; endosperm present or absent.\r",
      "Between 37 and 43 genera and 1100–1400 species: widespread in tropical and subtropical areas, less common in temperate areas; nine genera and 144 species (26 endemic, five introduced) in China.",
      "Economically, the most important species are those of Morus and Maclura associated with the production of silk. Some species in Broussonetia, Maclura, and Morus are important for paper making; some species in Artocarpus, Ficus, and Morus have edible fruit; and some species of Artocarpus and Broussonetia are used for furniture or timber.",
      "Chang Siushih, Wu Chengyih & Cao Ziyu. 1998. Moroideae. In: Chang Siushih & Wu Chengyih, eds., Fl. Reipubl. Popularis Sin. 23(1): 1–219.",
      "Trees, shrubs, or vines, with latex; inflorescences usually very compact, occasionally spikelike, very rarely a cyme.",
      "Inflorescences a fig with many minute flowers completely enclosed within a hollow receptacle opening by an apical pore closed by scale-like bracts.",
      "Inflorescences a capitulum, spike, or raceme, rarely a cyme, or with flowers inserted on a discoid receptacle.",
      "Plants often armed with axillary spines, at least when young, often climbing, sometimes a small tree; flowers in a globose head.",
      "Plant sometimes spiny, particularly on juvenile growth; bisexual inflorescences sometimes present; pistillode absent.",
      "Trees to 40 m high, rarely less than 8 m, without spines; bracteoles and perianth without glands; mature syncarp (3-)5-15 or more cm.",
      "Plants climbing or if erect, a shrub or small tree less than 7 m high, often with axillary spines, at least when young; bracteoles and perianth with yellow glands; mature syncarp 1.5-2.5(-5) cm.",
      "Antiaris  LeschenaultArtocarpus  J.R. Forster & G. ForsterBroussonetia  L’Héritier ex VentenatFatoua  Gaudichaud-BeaupréFicus  LinnaeusMaclura  NuttallMalaisia  BlancoMorus  LinnaeusStreblus  Loureiro"
    ],
    "authors":"Zhengyi Wu, Zhe-Kun Zhou & Michael G. Gilbert"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Nyctaginaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10617",
    "knowledge_content":[
      "Herbs, shrubs, trees, or sometimes spiny vines. Leaves opposite, alternate, or ± whorled; stipules absent; petiole usually present, well defined; leaf blade simple, herbaceous or slightly fleshy, margin entire. Inflorescences mostly terminal, less often axillary, of cymes, umbels, or verticils, sometimes 1-flowered or fasciculate, often grouped into panicles; bracts often inconspicuous, sometimes forming calyxlike involucre, or large and brightly colored. Flowers bisexual, rarely unisexual or polygamous, actinomorphic. Perianth constricted beyond the ovary, base persistent, closely enclosing ovary which appears inferior, limb petaloid beyond constriction, tubular, funnelform, or campanulate, apex 5-10-lobed, lobes plicate or valvate in bud, persistent or caducous. Disk absent. Stamens (1-)3-5(-many), hypogynous, free or connate at base, involute in bud; anthers 2-loculed, dehiscence longitudinal. Ovary superior, 1-loculed; ovule 1. Style 1; stigma globose. Fruit an achenelike anthocarp enclosed by persistent perianth, ribbed or winged, often glandular. Seed 1; endosperm present; embryo straight or curved.\r",
      "About 30 genera and 300 species: tropics and subtropics, mainly in tropical America; six genera (two introduced) and 13 species (one endemic, three introduced) in China.",
      "Inflorescences many-flowered cymes or panicles; bracts absent or inconspicuous; ovary sessile; fruit sticky.",
      "Inflorescenes 3-flowered cymes; bracts conspicuous, reddish, purple, or orange, rarely white or yellow, adnate to flowers; ovary stipitate; fruit not sticky.",
      "Flowers enclosed by a calyxlike involucre; fruit globose, obovoid, oblong, fusiform, or terete, sometimes ribbed, without sticky glands.",
      "Flowers in cymose panicles, umbels, or verticils; fruit clavate, obconic, turbinate, terete, or obovoid, 5- or 10-ribbed, with sticky glands.",
      "Involucre not accrescent or membranous; flowers large, showy, opening in the afternoon; perianth salverform, 2-6 cm, limb 2.5-3 cm in diam.; pedicel 1-2 mm.",
      "Involucre accrescent, membranous in fruit; flowers inconspicuous, opening in the morning; perianth campanulate or funnelform, 0.6-0.8(-1) cm, limb ca. 0.8 cm in diam.; pedicel 20-25 mm.",
      "Inflorescences cymose panicles, sometimes compact and headlike; perianth limb campanulate; filaments and style included or shortly exserted; fruit with unraised glands.",
      "Inflorescences umbels or verticils; perianth limb funnelform; filaments and style long exserted; fruit with large, raised, wartlike glands, usually near apex.",
      "Boerhavia  LinnaeusBougainvillea  Commerson ex JussieuCommicarpus  StandleyMirabilis  LinnaeusOxybaphus  L'Héritier ex WilldenowPisonia  Linnaeus"
    ],
    "authors":"Dequan Lu & Michael G. Gilbert"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Olacaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10624",
    "knowledge_content":[
      "Shrubs, scandent shrubs, trees, or lianas, sometimes hemiparasitic, often glabrous. Lateral shoots sometimes with bud scales at base. Stipules absent. Leaves alternate, rarely opposite; petiole well developed; leaf blade simple, margin entire; veins usually pinnate, sometimes palmate and 3-5-veined. Inflorescences axillary, rarely also terminal, cymose, fasciculate, racemelike, spikelike, or umbellate, mostly small; bracts small and inconspicuous. Flowers usually bisexual, actinomorphic, 3-7-merous, sometimes heterostylous. Calyx small at anthesis, cupular, discoid, or lobed, sometimes accrescent to partly or wholly covering fruit, sometimes fused to fruit (in Schoepfia). Petals free or basally connate, valvate. Disk cuplike or annular, rarely free glands, sometimes accrescent and covering fruit apex (in Schoepfia). Stamens 3-15, rarely in part staminodes, epipetalous; anthers basi- or medi-fixed, usually 2-loculed, longitudinally dehiscent. Ovary usually superior, rarely semisuperior but sometimes apparently inferior through fusion with calyx, 2-5-loculed or semiloculed with apex of ovary 1-loculed; ovules solitary in each locule or semilocule, pendent from apex of free central placenta, usually anatropous, integuments 1 or 2. Style terminal, simple; stigma 2-5-lobed. Fruit a drupe, sometimes with an accrescent calyx. Seed solitary; testa thin; endosperm abundant; embryo small; cotyledons 2-4.\r",
      "Between 23 and 27 genera and 180–250 species: tropical and warm-temperate regions worldwide; five genera (one endemic) and ten species (three endemic) in China.",
      "Ling Yeou-ruenn. 1988. Olacaceae. In: Kiu Hua-shing & Ling Yeou-ruenn, eds., Fl. Reipubl. Popularis Sin. 24: 30–46.",
      "Leaves palmately 3-5-veined, usually narrowly but distinctly peltate; liana, sometimes with axillary tendrils; inflorescences a dichotomous cyme, often very lax; fruiting pedicel accrescent to 1.5-2.5 cm; fruit dehiscent.",
      "Leaves pinnately veined, not peltate; tendrils absent; inflorescences fasciculate, racemelike, spikelike, or umbellate; fruiting pedicel to 1 cm, often ± absent; fruit indehiscent.",
      "Inflorescences umbellate, sometimes compound with umbels arranged along short axis; fruit oblately ± pear-shaped, 3-4.5 cm wide, wider than long.",
      "Inflorescences fasciculate, racemose, or spicate (sometimes in cymes in Ximenia); fruit ± globose, ellipsoid, or ovoid, 0.5-3 cm wide, longer than wide.",
      "Staminodes present; petals glabrous on inside; calyx enlarged, free from and partly or entirely enveloping fruit.",
      "Staminodes absent; petals hairy on inside; calyx not enlarged, not enclosing fruit or completely fused to fruit.",
      "Branchlets usually spiny; stamens 8 or 10; petals with hairs more widely distributed; drupe 2-3 cm wide.",
      "Branchlets without spines; stamens 4 or 5; petals with a tuft of hairs around insertion of each stamen; drupe 0.5-1.4 cm wide."
    ],
    "authors":"Huaxing Qiu & Michael G. Gilbert"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Opiliaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10636",
    "knowledge_content":[
      "Evergreen trees, shrubs, or lianas, root parasites. Stipules absent. Leaves alternate, simple, margin entire, penninerved. Inflorescences axillary or cauliflorous, spikes, racemes, or panicles [or umbels, in Africa]; bracts narrowly ovate or scale-like. Flowers small, actinomorphic, (3-)5-merous, bisexual or unisexual and plants then dioecious or gynodioecious (in Champereia). Perianth free or tepals partly united, valvate. Stamens as many as and opposite tepals, free or filaments inserted on tepals; anthers 2-loculed, introrse, dehiscence longitudinal. Disk intrastaminal, lobed, annular, or cupular. Ovary superior or semi-sunken in disk, 1-loculed; ovule 1, pendulous, unitegmic, tenuinucellar; placentation free-central. Style short or none; stigma entire or shallowly lobed. Fruit a drupe. Seed coat thin; endosperm oily; embryo terete, with 3 or 4 linear cotyledons.\r",
      "Ten genera and 33 species: widespread in tropical and subtropical regions; five genera and five species in China.",
      "Chen Pang-yu. 1988. Opiliaceae. In: Kiu Hua-shing & Ling Yeou-ruenn, eds., Fl. Reipubl. Popularis Sin. 24: 46–52."
    ],
    "authors":"Huaxing Qiu & Paul Hiepko"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Phytolaccaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10687",
    "knowledge_content":[
      "Herbs or shrubs, rarely trees, erect, rarely scandent, mostly glabrous, rarely dioecious. Leaves simple, alternate, entire; stipules absent or tiny. Inflorescences terminal, axillary, or leaf-opposed, racemose, cymose, panicled, or spicate. Flowers small, bisexual or rarely unisexual, actinomorphic, rarely zygomorphic. Tepals 4 or 5, persistent, free or connate at base, equal or unequal, imbricate in bud, green or sometimes other colored. Stamens 4 to many, inserted on a fleshy disk; filaments usually persistent, free or slightly connate at base; anthers 2-loculed, dorsifixed, longitudinally dehiscent. Ovary superior, globose; carpels 1 to many, free or connate; ovule solitary in each carpel, basal, campylotropous. Styles persistent, short or absent, erect or curved, as many as carpels. Fruit fleshy, a berry or drupe, rarely a capsule. Seeds reniform or oblate, small; testa membranous or hard and fragile, smooth or wrinkly; embryo large, curved, surrounding copious mealy endosperm.\r",
      "Seventeen genera and ca. 70 species: widespread in tropical and temperate regions, especially in the neotropics and S Africa; two genera (one introduced) and five species (one endemic, two introduced) in China."
    ],
    "authors":"Dequan Lu & Kai Larsen"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Podostemaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10714",
    "knowledge_content":[
      "Herbs, annual or perennial, aquatic. Roots usually flattened, thalloid or filiform. Leaves distichous, scattered, or imbricate, base often sheathed, margin entire or dissected. Flowers bisexual, solitary, actinomorphic or zygomorphic, enclosed or not by a spathella or spathella lacking. Tepals 2-5, free or ± connate. Stamens 1-4, hypogynous; filaments free or partially connate; anthers 2-4-loculed, longitudinally or irregularly dehiscent. Ovary superior, 2- or 3-loculed; ovules numerous, placenta central. Styles 2 or 3. Fruit a septicidal capsule. Seeds numerous, minute, without endosperm.\r",
      "About 40 genera and 200 species: widespread in tropical regions, a few species in temperate regions: three genera and four species (two endemic) in China.",
      "The plants live attached to submerged rocks or wood in rushing water in rapids or cataracts of streams and rivers. They are easily overlooked, and more field work is needed in China.",
      "Wu Te-lin. 1988. Podostemaceae. In: Kiu Hua-shing & Ling Yeou-ruenn, eds., Fl. Reipubl. Popularis Sin. 24: 1–5."
    ],
    "authors":"Huaxing Qiu & C. Thomas Philbrick"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Polygonaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10717",
    "knowledge_content":[
      "Authors: Anjen Li, Bojian Bao, Alisa E. Grabovskaya-Borodina, Suk-pyo Hong, John McNeill, Sergei L. Mosyakin, Hideaki Ohba & Chong-wook Park",
      "Herbs, shrubs, or small trees, sometimes monoecious or dioecious. Stems erect, prostrate, twining, or scandent, often with swollen nodes, striate, grooved, or prickly. Leaves simple, alternate, rarely opposite or whorled, petiolate or subsessile; stipules often united to a sheath (ocrea). Inflorescence terminal or axillary, spicate, racemose, paniculate, or capitate. Pedicel occasionally articulate. Flowers small, actinomorphic, bisexual, rarely unisexual. Perianth 3-6-merous, in 1 or 2 series, herbaceous, often enlarged in fruit or inner tepals enlarged, with wings, tubercles, or spines. Stamens usually (3-)6-9, rarely more; filaments free or united at base; anthers 2-loculed, opening lengthwise; disk annular (often lobed). Ovary superior, 1-loculed; styles 2 or 3, rarely 4, free or connate at lower part. Fruit a trigonous, biconvex, or biconcave achene; seed with straight or curved embryo and copious endosperm.\r",
      "About 50 genera and 1120 species: worldwide, but primarily N temperate with a few species in tropical regions; 13 genera (two endemic) and 238 species (65 endemic) in China.",
      "All Chinese genera belong to the Polygonoideae, a subfamily of some 790 species defined by the presence of ocreae, a monopodial branching pattern, and the lack of an involucre. The Eriogonoideae (330 species) are found only in the New World.Chinese genera of economic importance include Rheum, which has medicinal uses and is also a food plant (rhubarb) in many other regions, and Fagopyrum, which produces a grain (buckwheat).Fallopia nervosa Loureiro is Microcos paniculata Linnaeus (Tiliaceae).",
      "Li Anjen, Kao Tsoching, Mao Zumei & Liu Yulan. 1998. Polygonaceae. In: Li Anjen, ed., Fl. Reipubl. Popularis Sin. 25(1): 1–209.",
      "Stems twining or erect, tepals: outer 3, enlarged in fruit, abaxial surface with wings or keels, rarely not enlarged, without wings or keels."
    ],
    "authors":"Anjen Li, Bojian Bao, Alisa E. Grabovskaya-Borodina, Suk-pyo Hong, John McNeill, Sergei L. Mosyakin, Hideaki Ohba & Chong-wook Park"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Portulacaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10724",
    "knowledge_content":[
      "Herbs annual or perennial, rarely ± shrubby, usually succulent, usually glabrous except for nodal hairs and\/or scales. Leaves alternate or opposite; true stipules absent, nodes sometimes with axillary scales and\/or hairs; petiole usually poorly defined or absent; leaf blade simple, usually fleshy, margin entire. Inflorescences usually terminal, less often axillary, in cymes or racemelike panicles, forming heads of sessile flowers surrounded by an involucre of leaves, or reduced to solitary flowers. Bracts inconspicuous. Flowers bisexual, very rarely unisexual, actinomorphic. Sepals 2, free or basally connate, herbaceous or scarious. Petals 4-6 or seldom more, distinct or basally connate, imbricate, often brightly colored, usually short lived. Disk usually absent. Stamens 4-100, free, fascicled, or adnate to petals; filaments linear; anthers 2-loculed, introrse, dehiscence longitudinal. Ovary superior or half-inferior, 1-loculed, 2-5-carpellate; ovules 1 to many, campylotropous; placentation basal or free-central. Style linear; stigma 2-9-lobed. Fruit a thin-walled capsule, circumscissile or 2- or 3-valved, rarely a nut, often globose or subglobose, smooth. Seeds many, reniform or globose, caruncle present or not; endosperm mostly copious, surrounded by embryo.\r",
      "About 19 genera and 500 species: mainly in more arid regions of S hemisphere, especially Africa, South America, and Australia, fewer species in Asia, Europe, and North America; two genera (one introduced) and six species (two endemic, two introduced) in China.",
      "Leaf axils with hairs, bristles, and\/or slender scales, sometimes short and inconspicuous; flowers sessile, solitary or clustered; capsule circumscissile; seeds without caruncle.",
      "Leaf axils naked; flowers pedicellate, usually arranged in thyrse or panicle; capsule 3-valved; seeds with caruncle."
    ],
    "authors":"Dequan Lu & Michael G. Gilbert"
  },
  {
    "group_title":"Ulmaceae through Basellaceae",
    "family":"Proteaceae",
    "href":"florataxon.aspx?flora_id=2&taxon_id=10730",
    "knowledge_content":[
      "Trees or shrubs. Stipules absent. Leaves alternate, rarely opposite or whorled, simple or variously divided. Inflorescences axillary, ramiflorous, cauliflorous, or terminal, simple or rarely compound, with flowers borne laterally either in pairs or sometimes singly, racemose, sometimes spicate, paniculate, or condensed into a head; bracts subtending flower pairs usually small, sometimes accrescent and woody; floral bracts usually minute or absent. Flowers bisexual or rarely unisexual and dioecious, actinomorphic or zygomorphic. Perianth segments (3 or)4(or 5), valvate, usually tubular in bud; limb short, variously split at anthesis. Stamens 4, opposite perianth segments; filaments usually adnate to perianth and not distinct; anthers basifixed, usually 2-loculed, longitudinally dehiscent, connective often prolonged. Hypogynous glands 4 (or 1-3 or absent), free or variously connate. Ovary superior, 1-loculed, sessile or stipitate; ovules 1 or 2(or more), pendulous, laterally or basally, rarely subapically attached. Style terminal, simple, often apically clavate; stigma terminal or lateral, mostly small. Fruit a follicle, achene, or drupe or drupaceous. Seeds 1 or 2(or few to many), sometimes winged; endosperm absent (or vestigial); embryo usually straight; cotyledons thin or thick and fleshy; radicle short, inferior.\r",
      "About 80 genera and ca. 1700 species: mostly in tropics and subtropics, especially in S Africa and Australia: three genera (one introduced) and 25 species (12 endemic, two introduced) in China.",
      "The family is subdivided into Bellendenoideae, Caranarvonioideae, Eidotheoideae, Grevilleoideae, Persoonioideae, Proteoideae, and Sphalmioideae; all Chinese genera belong to Grevilleoideae. Grevillea robusta is grown extensively as a street tree in S China, especially in Yunnan.",
      "Kiu hua-shing. 1988. Proteaceae. In: Kiu Hua-shing & Ling Yeou-ruenn, eds., Fl. Reipubl. Popularis Sin. 24: 6–29.",
      "Flowers bisexual; fruit dry, with leathery to woody pericarp; leaves simple, margin entire or toothed.",
      "Flowers unisexual and plants dioecious; fruit drupaceous; leaves simple or tripartite to pinnatifid, margin entire."
    ],
    "authors":"Huaxing Qiu & Peter H. Weston"
  }
]